[
    {
        "voto": 1,
        "juez": "Republic of Cuba",
        "pregunta": "Finds that it has jurisdiction to give the advisory opinion requested",
        "texto": "Honourable  judges,  regarding  the  jurisdiction  of  the  International  Court  of  Justice  for  the emission  of  a  consultative  opinion  on  the  legal  question  presented  by  the  General  Assembly,  the Republic  of  Cuba  considers  that  this  august  body  is  fully  competent  to  emit  the  consultative opinion requested. /n/nArticle 96  of  the  United  Nations  Charter  confers  the  General  Assembly  and  the  Security Council,  the  unconditional    and  I  must  underline  unconditional    right  to  request  consultative opinions to the Court on any legal question. /n/nArticle 65,  paragraph 1,  of  the  Statute  of  the  International  Court  of  Justice  establishes  that the Court will emit consultative opinions regarding any legal question at the request by any organ authorized to do so by the Charter./n/nThe  General  Assembly  also  clearly  established  the  applicable  legal  framework  for  the interpretation  and  application  of  the  pertinent  legal  norms  in  the  emission  of  the  consultative opinion on the legal question. /n/nIn spite of the so-called “considerations”, or “political elements”, involved in the negotiated solution  of  the  Israeli-Palestinian  conflict,  and  the  request  by  several  States  that  the  Court  make discretional  use  of  Article 65,  paragraph 1,  of  its  Statute,  the  Republic  of  Cuba  considers  that  the Court  should  not  abstain  from  emitting  a  consultative  opinion  on  this  important  question.    In Cuba’s  view,  any  debate  on  the  optional  nature  of  Article 65,  paragraph 1,  of  the  Statute  is eminently theoretical in nature and can only be carried out in the light of the other Articles of said Statute and of the United Nations Charter. /n/nLikewise,  although  on  occasions  States  have  objected  to  the  jurisdiction  of  the  Court  based on the political nature of questions that have been placed before it, this has not prevented the Court from emitting consultative opinions on said questions, circumscribing itself to the legal consequences deriving from them, and, thus, adhering to its competence according to the internationally accepted instruments that govern its functioning. /n/nIt  is  Cuba’s  contention  that  the  emission  of  a  consultative  opinion  regarding  the  question presented  by  the  General  Assembly  is  based  not  only  on  Article 96  of  the  Charter,  but  also  on Article 14, which establishes that the General Assembly is competent to recommend measures for the  peaceful  solution  of  any  situation,  irrespective  of  origin,  even  a  situation  arising  from  a violation of the United Nations Charter itself. /n/nMention has been made in the written statements of the limitations imposed by Article 12 of the  Charter  to  the  fulfilment  by  the  General  Assembly  of  the  mandate  conferred  upon  it  by Article 14.  In Cuba’s view those limitations are not applicable in the cases involving requests for consultative  opinions  to  the  Court.    Article 96  of  the  Charter,  giving  this  faculty  to  the  General Assembly, is not qualified in any manner and, therefore, places no limitations whatsoever. /n/nFurthermore, even if Article 12 were to be theoretically applicable, limitations imposed by it would not be an obstacle for the request of a consultative opinion by the General Assembly on this issue.    The  fact  is  that  the  issue  at  hand  was  dealt  with  by  the  General  Assembly by virtue of  the United for Peace resolution resulting from a veto imposed by a Permanent Member of the Security Council  to  an  enabling  resolution.    Hence,  this  should  be  interpreted  in  the  sense  that,  for  all practical  purposes,  the  Security  Council  is  not  considering  the  draft  resolution  presented  to  it  and the item involved, even if said issue were still on the Council’s agenda. /n/nThe  Government  of  the  Republic  of  Cuba  considers  without  any  shadow  of  doubt whatsoever,  that  the  International  Court  of  Justice  is  competent  to  emit  a  consultative  opinion  on the legal question presented to it by the United Nations General  Assembly.  Articles 14 and 96 of the  United  Nations  Charter  and  Article 65,  paragraph 1,  of  the  Statute  of  the  Court  uphold  said competence.    Is  also  our  firm  view  that  the  emission  of  a  consultative  opinion  on  this  important issue is pertinent and timely. /n/nThe Government of the Republic of Cuba also considers that the emission of a consultative opinion on this important issue will not constitute an obstacle to the peace process but, on the contrary, would be an important tool in the hands of the United Nations General Assembly and  the  United  Nations  as  a  whole  for  the  fulfilment  of  its  functions  with  regard  to  this  conflict. Likewise,  it  can  contribute  to  clarify  to  the  international  community  the  terrible  socio-economic consequences for the Palestinian people derived from the construction of the Wall, particularly for the exercise of its inalienable right to self-determination."
    },
    {
        "voto": 1,
        "juez": "Republic of Cuba",
        "pregunta": "Decides to comply with the request for an advisory opinion",
        "texto": "In addition, Cuba considers that the emission of a consultative opinion on the legal question of reference is of significance in the present international context and for the negotiated solution of the Israeli-Palestinian conflict itself and for the most recent efforts carried out in that direction. /n/nA consultative issue should constitute an essential tool in the hands of the United Nations in the  fulfilment  of  its  functions,  particularly  for  the  General  Assembly  of  the  United  Nations, according to Article 14 of the Charter.  Likewise, it has also the role of contributing to clarify to the international community as a whole the terrible socio-humanitarian consequences for the Palestinian people derived from the construction of the Wall and, particularly, for the exercise of its right  to  self-determination  and  for  the  establishment  of  a  sovereign  and  independent  Palestinian State. /n/nThe emission of a consultative opinion on this question should also be a dissuasive element for  the  Occupying  Power  geared  at  having  it  stop  and  revert  the  construction  of  the  Wall  in  the Occupied Palestinian Territory and it should, at least, be a strong call on the Occupying Power to comply with the wishes of the United Nations General Assembly, as expressed in resolution ES-10/13 of 21 October 2003. /n/nThe  Government  of  the  Republic  of  Cuba  respectfully  hopes  that  the  International  Court of Justice, while emitting the consultative opinion requested by the General Assembly, recognizes that  the  construction  of  the  Wall  by  Israel  is  illegal  and  in  violation  of  norms  and  principles  of international law, including the Fourth Geneva Convention of 1949 and the relevant resolutions of the Security Council and the General Assembly. /n/nLastly,  Cuba  hopes  that  the  International  Court  of  Justice  acts  in  a  decisive  and unanimous manner in favour of peace and justice.  The Wall of separation continues to accentuate the illegal Israeli occupation, and perpetuates the system of “apartheid” established by Israel in the Occupied  Palestinian  Territory.    Furthermore,  with  these  actions,  Israel  moves  the  possibility  of reaching a negotiated, just and lasting solution to the Palestinian-Israeli conflict further along into the future."
    },
    {
        "voto": 1,
        "juez": "Republic of Cuba",
        "pregunta":"The construction of the wall being built by Israel, the occupying Power, in the Occupied Palestinian Territory, including in and around East Jerusalem, and its associated régime, are contrary to international law",
        "texto": "In addition, the General Assembly, by resolution ES-10/13, of 21 October 2003, established that the construction of the Wall is an issue that has clear implications for international law.  Said resolution, in its paragraph 1, “Demands that Israel stop and reverse the construction of the Wall in the  Occupied  Palestinian  Territory,  including  in  and  around  East  Jerusalem,  which  is  in departure of the Armistice Line of 1949 and is in contradiction to relevant provisions of International Law”. /n/nHonourable judges, with regard to the Republic of Cuba’s position on the most salient facts derived from the construction of the Wall, my delegation wishes to reiterate that the situation in the Occupied  Palestinian  Territory  has  always  been  a  source  of  deep  concern  for  my  country.    For decades, Israel, the Occupying Power, has been responsible for continuous and flagrant violations of human rights, of international humanitarian law and of international law in said territory and has ignored resolutions of the General Assembly and the Security Council. /n/nAt present, according to available public information, the situation is even more critical.  The construction  of  the  Wall  supposes  in  the  short-term  a  humanitarian  catastrophe  that  could  be conducive  to  the  extermination  and  genocide  of  the  Palestinian  people,  while,  at  the  same  time, conditioning,  from  the  physical  point  of  view,  the  co-existence  of  two  sovereign  and  independent States in the region, Israel and Palestine. /n/nThe construction of the Wall violates principles and norms of international law enshrined in the Charter of the United Nations and international law. /n/nIf the layout of the Wall foreseen by the authorities of the Occupying Power is carried out, it would  deviate  from  the  Armistice  Line  of  1949  (Green  Line)  up  to  22 km  in  several  places, annexing important zones of the West Bank and in and around Jerusalem. /n/nThe  Occupying  Power,  with  this  act,  would  de  facto  establish  a  new  border  by  means  of unilateral  imposition  and  the  use  of  the  force,  by  means  of  a  separation  wall  between  the Palestinian  Territory  occupied  in  the  war  of  aggression  carried  out  by  Israel  in  1967,  and  its  own State.    By  virtue  of  international  law,  an  aggressor  State  cannot  acquire  a  territory  by  means  of unilateral annexation. /n/nThe construction of the Wall in the Occupied Palestinian Territory also qualifies as an illicit act of annexation in accordance with the provisions of resolutions 478 (1980) and 497 (1981) of the United  Nations  Security  Council,  which  declare  that  the  acts  of  Israel  geared  at  the  annexation  of East Jerusalem and the Golan are null and void, and should not be recognized by States. /n/nThe  construction  of  the  Wall  also  ignores  the  principle  of  the  equality  of  rights  and self-determination of peoples.  The right to self-determination is founded on Article 1, paragraph 2, and  on  Article 55  of  the  United  Nations  Charter.    It  was  sanctioned  also  in  Article 1  of  the Covenants on Civil and Political Rights and on Cultural, Social, and Economic Rights. /n/nLikewise,  the  United  Nations  General  Assembly  has  ratified  this  principle  in  numerous resolutions.    Among  the  most  noteworthy,  it  is  found  in  resolution  1514  (XV)  of  the  fifteenth session  of  the  General  Assembly,  on  the  Declaration  on  the  concession  of  independence  to  the colonial countries and peoples, and in the aforementioned resolution 2625 (XXV) of the twenty-fifth session. /n/nThe  construction  of  the  Wall  goes  against  the  principle  of  peaceful  solution  of  disputes. Article 2,  paragraph 3,  of  the  United  Nations  Charter  establishes  that  States  should  resolve  their disputes  by  peaceful  means.    Thus,  any  delimitation  of  borders  should  be  negotiated  between  the two parties concerned on the basis of equality and equity for both which clearly derives from this principle.    The  parties  should  be  placed  on  equal  terms  and  each  one  of  them  should  respect  the rights of the other in accordance with international law.  The unilateral construction of the Wall by the  Occupying  Power,  in  the  Occupied  Palestinian  Territory,  is  in  no  way  conducive  to  a  climate propitious to the peaceful and negotiated solution of the Israeli-Palestinian conflict on equal terms. /n/nHonourable  judges,  it  is  crystal  clear  that  the  construction  of  the  Wall  goes  against  the provisions contained in a number of resolutions of the General Assembly and the Security Council. /n/nThe  consideration  of  these  resolutions  also  demonstrates  that  the  systematic  refusal  by  the Occupying Power to comply with the provisions contained therein regarding the acts committed in the Occupied Palestinian Territory, entails legal consequences for the Occupying Power. /n/nIn addition, the non-compliance by the Occupying Power of United Nations resolutions is in conflict with the principle of good faith, one of the fundamental principles of international law. /n/nThe  construction  of  the  Wall  in  the  Occupied  Palestinian  Territory  is  also  in  violation  of resolutions  adopted  by  the  United  Nations  bodies  in  the  context  of  the  Israeli  settlements  in  the Occupied Palestinian Territory. /n/nFurthermore,  the  construction  of  the  Wall  by  the  Occupying  Power  violates  principles  and norms of international humanitarian law. /n/nFirst and foremost, Cuba sustains that the Geneva Convention of 12 August 1949 regarding the  protection  of  civilian  persons  in  times  of  war,  the  Fourth  Geneva  Convention,  is  fully applicable to the Occupied Palestinian Territory, including in and around East Jerusalem. Reference should be made to the violations by Israel, the Occupying Power, of said Convention. /n/nThough  Israel  has  contended  that  the  Fourth  Geneva  Convention  is  not  applicable  to  the Occupied  Palestinian  Territory  as  it  is  “not  a  territory  of  a  High  Contracting  Party  as  required  by the  Convention”,  the  applicability  of  this  instrument  to  the  Occupied  Palestinian  Territory  enjoys extensive international recognition.  The written presentation delivered by the Republic of Cuba on 30 January 2004 to this Court, contains legal and factual elements confirming this assertion.  At the same  time,  Israel,  as  Occupying  Power,  is  also  legally  bound  by  other  consuetudinary  norms relating to occupation, according to the stipulations of the Rules annexed to the Hague Convention on Laws and Customs of Land Wars of 18 October 1907. /n/nIn  the  view  of  the  Republic  of  Cuba,  as  a  result  of  the  construction  of  the  Wall  and  of  the severe humanitarian and socio-economic conditions that this has entailed and will continue to entail for  the  population  of  the  Occupied  Palestinian  Territory,  the  Occupying  Power  incurs  in  a  large number of very serious violations of the Fourth Geneva Convention. /n/nIt violates the obligation emanating from Article 1, common to the four Geneva Conventions, according to which the “High Contracting Parties undertake to respect and to ensure respect of said Convention in all circumstances”. /n/nAs a result of the construction of the Wall and of the establishment of arbitrary restrictions to the  movement  of  Palestinian  persons  and  goods  from  one  side  of  the  Wall  to the  other,  access  by the  Palestinian  population  to  their  lands,  jobs,  markets  and  other  sources  of  subsistence  has  been severely limited, with which the Palestinian economy has been severely affected and its population subjected  to  unsustainable  conditions.    This  situation  clearly  demonstrates  that  the  Occupying Power  has  not  fulfilled  its  obligation  to  provide  these  persons  with  the  opportunity  to  find  paid employment,  according  to  provisions  included  in  Article 39,  paragraph 1,  of  the  Fourth  Geneva Convention. /n/nLikewise,  the  Occupying  Power  has  not  fulfilled  the  provisions  of  paragraph 2  of  said Article 39, according to which “where a Party to the conflict applies to a protected person methods of control which result  in  his  being  unable  to  support  himself,  and  especially  if  such  a  person  is prevented for reasons of security from finding paid employment on reasonable conditions, the said Party shall ensure his support and that of his dependents”. In this context, the Occupying Power has not fulfilled the provisions of Article 55, paragraph 1, of the Fourth Geneva Convention, according to which “the Occupying Power has the duty of ensuring the food and medical supplies of the population;  it should, in particular, bring in the necessary foodstuffs, medical stores and other articles if the resources of the Occupied Territory are inadequate”."
    },
    {
        "voto": 1,
        "juez": "Republic of Cuba",
        "pregunta": "Israel is under an obligation to terminate its breaches of international law; it is under an obligation to cease forthwith the works of construction of the wall being built in the Occupied Palestinian Territory, including in and around East Jerusalem, to dismantle forthwith the structure therein situated, and to repeal or render ineffective forthwith all legislative and regulatory acts relating thereto, in accordance with paragraph 151 of this Opinion",
        "texto": "Through  its  presentation,  the  Government  of  the  Republic  of  Cuba  reiterates  inter  alia,  its condemnation of acts of annexation, to the excessive use of force without establishing a distinction between civilians and combatants, to the creation of a humanitarian crisis caused by the limitations imposed on the circulation of goods and persons, to the inhuman treatment of children, and to the generalized destruction of goods, all of which are a direct consequence of the territorial expansion of  the  Occupying  Power  through  the  construction  of  the  Wall,  and  all  of  which  have  clear  legal consequences. /n/nThe right to self-determination of the Palestinian people cannot be alienated and it should be realized on the basis of territorial integrity within the borders of an independent Palestinian State. This right of the Palestinian people has been confirmed by the United Nations General Assembly in numerous  resolutions,  and  also  recognized  in  the  different  phases  of  the  peace  process  in  the Middle East. /n/nThe  right  to  self-determination  is  closely  linked  with  the  concept  of  territorial  sovereignty. A people can only exercise the right to self-determination within a territory.  The amputation of the Palestinian  territory  by  means  of  the  construction  of  a  wall  is  a  serious  breach  of  the  inalienable right  to  self-determination  of  the  Palestinian  people,  since  it  considerably  reduces  the  size  of  the already small self-determination unit within which such right should be exercised. /n/nThis  situation  must  cease.    Israel,  the  Occupying  Power,  has  the  obligation  to  stop  and  to revert the construction of the Wall, while the international community, on the other hand, has also the  obligation  of  not  recognizing  the  control by  the  Occupying Power  of  the  Palestinian  Territory delimited by the Wall. /n/nAccording  to  international  law  the  prohibition  of  acquiring  territories  by  force  applies independently  of  any  other  consideration.  The  Declaration  on  Principles  of  International  Law concerning Friendly Relations and Cooperation among States in accordance with the Charter of the United Nations,  that  is  resolution 2625  of  the  Twenty-Fifth  Session  of  the  General  Assembly (24 October 1970), establishes that “the territory of a State shall not be the object of acquisition by another State resulting from the threat or use of force.  No territorial acquisition resulting from the threat or use of force shall be recognized as legal”. /n/nThe  actions  adopted  by  Israel,  the  Occupying  Power,  of  building  a  wall  in  the  Occupied Palestinian Territory is not justified in any way whatsoever by military necessities. /n/nIt  violates,  furthermore,  the  principle  of  proportionality,  as  it  is  not  proportionate  with legitimate  security  interests,  moves  away  from  measures  of  that  character  and  acquires  the  nature of punishment, humiliation and conquest. /n/nIt must be recalled that, because of their special nature, the norms of international humanitarian  law  establish  obligations  applicable  to  the  international  community  as  a  whole. Therefore, every member of the international community is entitled to demand that said norms be respected. /n/nWith the destruction of dwellings, stores, cultivated lands and other goods belonging to the Palestinian population by the construction of the Wall, the Occupying Power is violating Article 53 of the Fourth Geneva Convention according to which “any destruction by the occupying Power of real estate or personal property belonging individually  or  collectively  to  private  persons,  or  to  the  State,  or  to  other  public authorities, or to social or cooperative organizations, is prohibited, except where such destruction is rendered absolutely necessary by military operations”. In Cuba’s view, the exception foreseen in this Article is not applicable to this case. /n/nKeeping in mind the previously mentioned violations of the rights of the “protected population”,  in  this  case  the  Palestinian  population  resided  in  the  Occupied  Palestinian  Territory, the  Occupying  Power  is  also  violating  Article  47  of  the  Fourth  Geneva  Convention,  according  to which “protected persons who are in occupied territory shall not be deprived, in any case or in any manner whatsoever, of the benefits of the present Convention...”. /n/nAll  the  violations  of  the  provisions  of  the  Fourth  Geneva  Convention  above  described, represent,  furthermore,  a  humiliation  to  the  Palestinian  people  by  virtue  of  Article 27  of  said instrument, according to which “protected persons are entitled, in all circumstances, to respect for their persons, their honour, their family rights, their religious convictions and practices, and their manners and  customs.    They  shall  at  all  times  be  humanely  treated,  and  shall  be  protected especially against all acts of violence or threats thereof...” In  all  evidence,  the  construction  of  the  Wall,  with  its  concrete  structure,  its  razor  wire,  its towers of observation and its electronic monitoring means, creates a population of prisoners. /n/nIn addition to the above, the disproportionate and excessive use of the concept of the right to legitimate  defence  by  the  Occupying  Power,  and  the  violation  of  the  principles  of  proportionality and distinction derived from the construction of the Wall should be also considered. /n/nThe Occupying Power intends to justify the construction of a Wall in the occupied Palestinian territory as being a security measure by virtue of the exercise by States of their right to legitimate  defence.    In  accordance  with  the  United  Nations  Charter  and  international  law,  States have the right to exercise  said right individually or collectively in the case of an armed attack for the protection of its legitimate security interests, and in cases of strict military necessity. Nevertheless, distinguished Members of the Court, those actions should be compliant with international human rights norms and international humanitarian law. /n/nIsrael, the Occupying Power, persists in serious violations of the provisions of the Fourth Geneva  Convention  of  1949.    It  still  refuses  to  accept  the  de  jure  applicability  and  even  the application  of  the  Convention  to  the  Occupied  Palestinian  Territory,  including  Jerusalem,  thus demonstrating  its  refusal  to  respect  the  wish  of  the  international  community,  that  for  more  than 30 years has confirmed the applicability of this Convention to the Occupied Palestinian Territory. /n/nThe  extreme  humanitarian  crisis  imposed  by  the  Occupying  Power  on  the  Palestinian population  since  the  construction  of  the  Wall,  as  described  in  the  report  of  the  Secretary-General and  in  other  public  sources,  may  be  classified  as  a  crime  of  extermination,  as  it  constitutes  the intentional  infliction  of  conditions  of  life,  calculated  to  bring  about  the  destruction  of  part  of  a population, in this case the Palestinian population. /n/nThe  Government  of  the  Republic  of Cuba  equally  expects  that  the  International  Court  of Justice recognize the international responsibility derived for the Occupying Power by the illicit acts previously  expressed.    Likewise,  the  Government  of  the  Republic  of  Cuba  considers  that  the stopping of the process of construction of the Wall in the Occupied Palestinian Territory cannot be postponed, and respectfully requests the Court to demand that the Wall be totally demolished and that the Occupying Power unrestrictedly fulfil its obligations under international law and international humanitarian law."
    },
    {
        "voto": 1,
        "juez": "Republic of Cuba",
        "pregunta": "Israel is under an obligation to make reparation for al1 damage caused by the construction of the wall in the Occupied Palestinian Territory,including in and around East Jerusalem",
        "texto": "The  Occupying  Power  is  up  to  now  preventing  22 Palestinian  locations  from  access  to schools by impeding the free circulation of Palestinians on both sides of the Wall, with which it is violating  the  provisions  of  Article 50,  paragraph 1,  according  to  which  “the  occupying  Power shall...  facilitate  the  proper  working  of  all  institutions  devoted  to  the  care  and  education  of children”. /n/nOn  the  other  hand,  the  Occupying  Power  is  up  to  now  preventing  30 Palestinian  locations from access to health services and eight from access to the primary sources of water provision by impeding the free circulation of Palestinians on both sides of the Wall.  With these actions, Israel is violating the provisions of Article 56, according to which, inter alia, “the occupying Power has the duty of ensuring and maintaining... the  medical and hospital establishments and services,  public  health and hygiene in the occupied territory...”. /n/nThe  emission  of  a  consultative  opinion  on  this  question  should  also  encourage  the Occupying Power to comply with the wishes of the international community and should also play a decisive  role  in  preventing  any  future  intention  of  the  Occupying  Power  to  obtain  international recognition of the de facto situation created in the Occupied Palestinian Territory as a result of the construction of the Wall."
    },
    {
        "voto": 1,
        "juez": "Republic of Cuba",
        "pregunta": "All States are under an obligation not to recognize the illegal situation resulting from the construction of the wall and not to render aid or assistance in maintaining the situation created by such construction; all States parties to the Fourth Geneva Convention relative to the Protection of Civilian Persons in Time of War of 12 August 1949 have in addition the obligation, while respecting the United Nations Charter and international law, to ensure compliance by Israel with international humanitarian law as embodied in that Convention",
        "texto": "It is a violation of the prohibition of the threat and use of force.  In conformity with Article 2, paragraph 4,  of  the  Charter,  the  Members  of  the  United  Nations  shall  abstain  in  international relations  to  resort  to  the  threat  or  use  of  force  against  the  territorial  integrity  or  the  political independence  of  any  State,  or  in  any  another  form  incompatible  with  the  purposes  of  the  United Nations. /n/nThe Government of the Republic of Cuba cannot accept that the following elements may be considered an answer proportionate to the perception of security of the Occupying Power:  the excessive  use  of  force,  the  lack  of  distinction  between  combatants  and  civilians,  the  creation  of  a humanitarian  crisis  as  a  consequence  of  the  limitations  imposed  on  the  circulation  of  goods  and persons, the death and the inhuman treatment of children, the generalized destruction of goods and, ultimately, the territorial expansion by means of the construction of the Wall."
    }
]