[
    {
        "voto": 1,
        "juez": "Republic of South Africa",
        "pregunta": "Finds that it has jurisdiction to give the advisory opinion requested",
        "texto": "A matter that has been raised by all those that contest the jurisdiction of the Court is the fact that the Court has a discretion to decide whether or not to give an advisory opinion. This fact cannot be contested as Article 65, paragraph 1, clearly states that the Court may give an advisory opinion on any legal question at the request of whatever body that may, in accordance with the Charter of the United Nations, make such a request.\n\nIn this regard, the position of the Court in the case concerning the Interpretation of Peace Treaties with Bulgaria, Hungary and Romania, First Phase, Advisory Opinion (I.C.J. Reports 1950, p. 72) is noted. The discretion therefore undoubtedly exists. The question that begs answering, though, is how the Court should exercise this discretion in such a manner that it remains faithful to the requirements of its judicial character.\n\nOne of the main issues raised by the opponents of the Court’s jurisdiction, is the lack of the judicial propriety for the Court if it accedes to the request to give an advisory opinion. This position appears to be based on a number of grounds, inter alia, the following:\n\nthe lack of consent to the jurisdiction of the Court by Israel;\nthe question relates to a substantive dispute between the parties;\nthe fact that this is a political and not a legal question;\nthe alleged ultra vires nature of the request;\nthe assumption that any opinion on this matter will serve no purpose, and will be harmful to achieving a settlement of the conflict;\nthe lack of facts before the Court due to the withdrawal by Israel to participate in the hearing.\n\n“Propriety” is defined in the Oxford Dictionary as “correctness concerning standards of behaviour or morals; the details or rules of conventionally accepted behaviour; appropriateness; rightness”. Based on the reasons that follow, we immediately conclude that there can be no doubt that it is correct and appropriate for the Court to give an advisory opinion in this case. If the arguments against the Court’s jurisdiction are weighed one by one, the only logical conclusion is the unquestionable jurisdiction of the Court to issue an advisory opinion in the present case. We will now deal with some of these arguments individually.\n\nThe lack of consent to the jurisdiction of the Court by Israel\n\nBy virtue of being a Member of the United Nations, a State and, in this particular case Israel, accepts the possibility of the General Assembly requesting an advisory opinion from the Court in accordance with the relevant provisions of the Charter and the Statute of the Court on a legal question.\n\nThe Court, in the Namibia case, emphasized the aforementioned principle by stating:\n\n“South Africa, as a Member of the United Nations, is bound by Article 96 of the Charter, which empowers the Security Council to request advisory opinions on any legal question” (Legal Consequences for States of the Continued Presence of South Africa in Namibia (South West Africa) notwithstanding Security Council Resolution 276 (1970), Advisory Opinion, I.C.J. Reports 1971, p. 23, para. 31).\n\nA number of States, in their written opinions or submissions, have used the Eastern Carelia case as authority that “no State can, without its consent, be compelled to submit its disputes with other States either to mediation or arbitration, or to any other kind of pacific settlement” (Status of Eastern Carelia, Advisory Opinion, 1923, P.C.I.J., Series B, No. 5, p. 27). However, this case needs to be distinguished from the present, as all Member States of the United Nations by virtue of acceding to the Charter have accepted the competence of the United Nations organs to refer matters to the Court for advisory opinions.\n\nFurthermore, Article 65, paragraph 1, of the Statute of the Court provides that: “The Court may give an advisory opinion on any legal question at the request of whatever body may be authorized by or in accordance with the Charter of the United Nations to make such a request.”\n\nArticle 96, paragraph 1, of the United Nations Charter stipulates that: “The General Assembly or the Security Council may request the International Court of Justice to give an advisory opinion on any legal question.”\n\nThese two provisions establish the competence of the General Assembly to request an advisory opinion from the Court and also the competence of the Court to give the requested opinion on any legal question. The choice of “any” in both Articles makes the Court’s jurisdiction quite expansive and circumscribed by whether the issue at hand is a legal question.\n\nThe advisory opinion has been requested by the General Assembly in line with Article 96, paragraph 1, of the United Nations Charter. This provision does not require the General Assembly to obtain the consent of any party before it requests an advisory opinion from the Court.\n\nThe Court, in the Western Sahara case (I.C.J. Reports 1975) affirmed that its competence to give an opinion did not depend on the consent of the interested States, even when the case concerned a legal question actually pending between them. An instance where the Court would refuse to render an opinion is when the circumstances disclose that to give a reply would have the effect of circumventing the principle that a State is not obliged to allow its disputes to be submitted to judicial settlement without its consent.\n\nThe lack of consent to the giving of an advisory opinion from any particular State is not relevant to the jurisdiction of the Court to provide the requested opinion. As the Court said in its Advisory Opinion on the Applicability of Article VI, Section 22, of the Convention on the Privileges and Immunities of the United Nations:\n\n“The jurisdiction of the Court... to give advisory opinions on legal questions, enables United Nations entities to seek guidance from the Court in order to conduct their activities in accordance with law. These opinions are advisory, not binding. As the opinions are intended for the guidance of the United Nations, the consent of States is not a condition precedent to the competence of the Court to give them.” (I.C.J. Reports 1989, pp. 188-189, para. 31; emphasis added.)\n\nSimilar views were expressed in the earlier case of the Interpretation of Peace Treaties with Bulgaria, Hungary and Romania case (I.C.J. Reports 1950, p. 71). A clear distinction has always been maintained between contentious cases on the one hand and advisory opinions on the other. In the Legality of the Threat or Use of Nuclear Weapons case this Court has gone even further to say that:\n\n“[I]t is not for the Court itself to purport to decide whether or not an advisory opinion is needed by the Assembly for the performance of its functions. The General Assembly has the right to decide for itself on the usefulness of an opinion in the light of its own needs.” (Legality of the Threat or Use of Nuclear Weapons, Advisory Opinion, I.C.J. Reports 1996[I], p. 237, para. 16.)\n\nFurthermore, this Court has found in the Interpretation of Peace Treaties with Bulgaria, Hungary and Romania case, that an opinion cannot be refused solely because the General Assembly might act ultra vires, as the General Assembly has the right to request opinions which it believes will be useful to it in the exercise of its functions. The competence of the General Assembly to request an advisory opinion, therefore, cannot be doubted on the ground that the opinion sought will not contribute to the performance of its functions.\n\nThis Court finds that the lack of consent to the giving of an advisory opinion by any particular State cannot in any way restrict the jurisdiction of the Court to give the requested advisory opinion. The Court finds that the criteria for giving an advisory opinion are clearly stated in Article 65, paragraph 1, of the Statute of the Court and Article 96, paragraph 1, of the United Nations Charter and that the General Assembly in requesting an opinion from the Court is well within its competence as provided for by these Articles."
    },
    {
        "voto": 1,
        "juez": "Republic of South Africa",
        "pregunta": "Decides to comply with the request for an advisory opinion",
        "texto": "In answering this question, it is instructive to recall and to reflect on the Court’s own views on this matter. The main aspect arising from the Court’s earlier consideration of how it should exercise its jurisdiction is the fact that the Court should in principle not refuse to give an advisory opinion. This the Court stated in the Interpretation of Peace Treaties case. The Court expressed itself thus.\n\n“[t]he Court has constantly been mindful of its responsibilities as ‘the principal judicial organ of the United Nations’... When considering each request, it is mindful that it should not, in principle, refuse to give an advisory opinion. In accordance with the consistent jurisprudence of the Court, only ‘compelling reasons’ could lead it to such a refusal.” (Legality of the Threat or Use of Nuclear Weapons, I.C.J. Reports 1996(I), p. 235, para. 140.)\n\nThe Court then declared that there has been no refusal in the history of the present Court, based on the discretionary power of the Court, to act upon a request for an advisory opinion. In fact, the Court has never refused to give an advisory opinion whenever all the other requirements for the exercise of this jurisdiction have been met. In sum, the Court asserted quite strongly that it will not take lightly a decision to refuse to give an advisory opinion.\n\nThe question should then be what are the “compelling reasons” that need to exist in order for the Court to decide not to issue an advisory opinion?\n\nOne may here indicate that perhaps being able to tease out examples of these “compelling” reasons may be made somewhat difficult by the very fact that there has been no refusal of an exercise of discretion on this ground. That notwithstanding, what is positive therefrom is that this fact underscores the very point that the Court has made repeatedly, which is that it will not lightly or readily refuse to exercise this jurisdiction.\n\nThe Court should not shy away from its obligation where an opportunity presents itself to provide advice, based on solid legal principles, especially when faced with a unique situation of international concern like the one we have here today, in respect of which there have been clear indications of the horrendous effects that the Wall has on the Palestinian people.\n\nThe lack of facts before the Court\n\nWith regard to the argument that there is a lack of facts before the Court, the Court needs to determine “whether it has before it sufficient information and evidence to enable it to arrive at a judicial conclusion upon any disputed questions of fact, the determination of which is necessary for it to give an opinion in conditions compatible with its judicial character” (Western Sahara, Advisory Opinion, I.C.J. Reports 1975, pp. 28–29, para. 46).\n\nIn the present case there are no disputed facts that we must emphasize. The Court has before it the two reports: that of the Secretary-General of the United Nations and that of the Special Rapporteur of the Commission on Human Rights on the Situation of Human Rights in the Palestinian Territories occupied by Israel. The existence of the Wall is an undisputed fact that is bound to have legal consequences in terms of the rules and principles of international law as provided for in the question put to the Court and on which the Court should pronounce itself.\n\nIn the Namibia case, the Government of South Africa argued that: “Since the Court may only give an Advisory Opinion on a legal question, it may consequently be doubted whether it is entitled to furnish an Opinion if, in order to do so, it also has to make findings as to primary facts.” (Statement submitted by the Government of the Republic of South Africa, Vol. 1, p. 143, para. 45). The Court rejected this argument completely (I.C.J. Reports 1971, p. 27, para. 40).\n\nAs a matter of policy a Member State should not be allowed to undermine the judicial function of the Court by refusing to place facts it considers essential before the Court, and then benefit from this situation by seeking to use it as a means of denying the Court jurisdiction. Such a stratagem is, in our view, so simple and transparent that it falls to be rejected out of hand by the Court."
    },
    {
        "voto": 1,
        "juez": "Republic of South Africa",
        "pregunta": "The construction of the wall being built by Israel, the occupying Power, in the Occupied Palestinian Territory, including in and around East Jerusalem, and its associated régime, are contrary to international law",
        "texto": "Human rights violations\n\nFurther consequences of the separation Wall have been grave infringements of recognized human rights principles as enshrined in the International Covenant on Civil and Political Rights (ICCPR) and the International Covenant on Economic, Social and Cultural Rights (ICESCR) of 16 December 1966, which Covenants have both been ratified by Israel. The grave human rights situation resulting from the construction of the separation Wall is well documented in both the report of the Secretary-General and also the report of the Special Rapporteur, which documents are in the Court’s possession.\n\nArticle 2 of the International Covenant on Civil and Political Rights provides clearly that “each State Party to the present Covenant undertakes to respect and to ensure to all individuals within its territory and subject to its jurisdiction the rights recognised by the Covenant, without distinction of any kind, such as race, color, sex, language, religion, political or other opinion, national or social origin, property, birth or other status”.\n\nThese rights are universal and inalienable rights of all members of the human family, and it is incorrect in law and even amoral to suggest that the residents of the Occupied Palestinian Territory are not entitled to these rights."
    },
    {
        "voto": 1,
        "juez": "Republic of South Africa",
        "pregunta": "Israel is under an obligation to terminate its breaches of international law; it is under an obligation to cease forthwith the works of construction of the wall being built in the Occupied Palestinian Territory, including in and around East Jerusalem, to dismantle forthwith the structure therein situated, and to repeal or render ineffective forthwith all legislative and regulatory acts relating thereto, in accordance with paragraph 151 of this Opinion",
        "texto": "The right to self-determination\n\nThe separation Wall violates two of the most fundamental principles of contemporary international law, namely the prohibition on the forcible acquisition of territory and of the right to self-determination.\n\nThe right to self-determination and the concept of territory are intrinsically linked. The right of the Palestinian people to self-determination is unquestionable, has been reaffirmed by the United Nations on numerous occasions and forms the underlying principle of the two-State solution.\n\nAs the Special Rapporteur of the Commission on Human Rights has correctly pointed out in his report,\n\n“A people can only exercise their right to self-determination within a territory. The amputation of Palestinian territory by the construction of the Separation Wall seriously interferes with the right of self-determination of the Palestinian people as it substantially reduces the size of the self-determination unit.”"
    },
    {
        "voto": 1,
        "juez": "Republic of South Africa",
        "pregunta": "All States are under an obligation not to recognize the illegal situation resulting from the construction of the wall and not to render aid or assistance in maintaining the situation created by such construction; all States parties to the Fourth Geneva Convention relative to the Protection of Civilian Persons in Time of War of 12 August 1949 have in addition the obligation, while respecting the United Nations Charter and international law, to ensure compliance by Israel with international humanitarian law as embodied in that Convention",
        "texto": "Applicability of international humanitarian law\n\nThere is no doubt that the Geneva Conventions apply to the 1967 armed conflict. Israel’s obligations as an Occupying Power in the Palestinian Territory are governed by rules and principles of international law, international humanitarian law and international human rights law. The general framework of international law governing occupation as contained in the Hague Regulations of 1907 and the Fourth Geneva Convention, is applicable to the Occupied Palestinian Territory and to Israel as the Occupying Power. Israel is a party to the four Geneva Conventions and it is widely accepted that the Hague Regulations of 1907 are declaratory of general international law, as confirmed by the Court in its Nuclear Weapons Advisory Opinion.\nFurthermore, the United Nations General Assembly reaffirmed the applicability of the Fourth Geneva Convention relative to the Protection of Civilian Persons in Time of War, of 12 August 1949, to the Occupied Palestinian Territory, including Jerusalem, and the other occupied Arab territories, in its resolution A/RES/56/60 of 14 February 2002.\n\nDe facto annexation\n\nThe de facto consequence of the construction of the separation Wall, which deviates from the Green Line, which represents the actual boundary between Israel and Palestine, is that that area will be annexed and incorporated within the territory of Israel. This de facto annexation is an attempt to create facts on the ground that will be difficult to change. Such a construction not only violates various Security Council resolutions, but is also in direct breach of the rule of customary international law against the acquisition of territory by force or annexation. In international law, annexation of this kind is tantamount to conquest, which was banned by the prohibition of the use of force contained in Article 2, paragraph 4, of the Charter. Furthermore, the construction of the separation Wall violates one of the fundamental rules of international humanitarian law as laid out in Article 47 of the Fourth Geneva Convention, under which the rights of persons living in occupied territories are fully protected by international law. The Occupying Power, in this case Israel, may not alter their legal situation by either a unilateral act or annexation of the territory, for they remain protected persons.\n\nJustification of self-defence and military necessity\n\nThe principle of self-defence cannot be employed as a justification for the construction of the separation Wall. It is established international law that the right to self-defence is a temporary right. In the present case however, the permanent structure of the separation Wall suggests the opposite. The principles of necessity and proportionality, which form part of the doctrine of self-defence, enshrined in Article 51 of the Charter, have been violated by Israel through the construction and the severe consequences of the separation Wall. These consequences have been the unwarranted restrictions of movement, isolation of civilians from their farmlands, destruction of crops and impairment of access to essential social services as described in the report of the Secretary-General prepared pursuant to General Assembly resolution ES-10/13 (A/ES-10/248 dated 3 December 2003) which is before the Court. These consequences are totally disproportionate and unnecessary, bearing in mind that the focus of Israeli defence is occasional and irregular attacks by lone operators.\n\nA question of fact that begs the Court’s consideration is why, if the separation Wall as a measure of self-defence is intended to protect Israeli citizens and territory, it is not being constructed on undisputed Israeli territory? Is the logical explanation for the chosen route of the separation Wall cutting across occupied territory not an attempt of de facto annexation? The answer in our view is obvious and in the affirmative.\n\nThe justification that has consistently been advanced by the Israeli Government for the construction of the separation Wall, is that it is necessary to ensure the security of Israel. They maintain that the destruction and seizure of Palestinian property and the violation of human rights of the Palestinian population are demanded by the necessities of war, as permitted by Article 23 of the Hague Regulations of 1907. In this regard the Court should take note that the Israeli Government in this instance is relying for protection on the very same Hague Regulations that they have always maintained do not bind them. Nonetheless, it is submitted that the concept of “military necessity” does not release a State from the obligations of complying with international humanitarian law. The Geneva Conventions of 1949 and their Additional Protocols, together with the Hague Regulations, have already struck the balance between the demands made on the law of conduct of war and the requirements of humanity.\n\nThe right of Israel to security has never been denied, but this right must be exercised within recognized norms of international law."
    }
]




