[
    {
        "voto": 1,
        "juez": "Indonesia",
        "pregunta": "Israel is under an obligation to make reparation for al1 damage caused by the construction of the wall in the Occupied Palestinian Territory,including in and around East Jerusalem",
        "texto": "Honourable  judges,  as  widely  reported,  the  construction  of  the  Wall  has  destroyed schools,  commercial  buildings,  homes,  water  networks  and  has  made  difficulties  for  teachers reaching their classes when travelling.  The shops and enterprises have been closed as a consequence  of  the  Wall.    The  restriction  of  movement  also  affects  access  to  sacred  places  and mosques.    Regarding  the  right  to  food  and  water,  the  Israeli  authority  has  taken  food  away  from farmers and the Wall has affected communities’ access to water.  Israel, as Occupying Power, does not fulfil its obligation to ensure the Palestinian right to health.  As reported by the Bertini Report there  are  “access  restrictions . . .  [which]  prevent  Palestinians  in  need  of  medical  treatment  from reaching health services” /n/nIsrael  is  under  a  legal  obligation  to  restore  land  and  private  properties  forcibly  seized  for  the construction of the Wall, to pay full compensation, to annul all measures enacted regarding the Wall,  to  cease  restriction  on  freedom  of  movement  in  the  Occupied  Palestinian  Territory, including East Jerusalem. /n/nLast  but  not  least,  Israel  is  under  an  obligation  to  co-operate  with  international  humanitarian organizations,  including  the  International  Committee  of  the  Red  Cross  and  the  Human  Rights Committee to respect the dignity of the Palestinian people."
    },
    {
        "voto": 1,
        "juez": "Indonesia",
        "pregunta": "Decides to comply with the request for an advisory opinion",
        "texto": "With  regard  to  Article 12  of  the  Charter,  let  me  refer  to  the  opinion  made  by  the honourable Judge Bruno Simma in his publication The Charter of the United Nations:  A Commentary  that  this  Article  has  been  gradually  eroded.    It  is  not  uncommon  that  the  General Assembly  has  made  recommendations  even  when  the  Security  Council  was  dealing  actively  with an  issue.    If  the  Security  Council  was  not  actually  exercising  its  function  at  that  moment,  or  if  a resolution  was  blocked  by  a  veto,  the  General  Assembly  has  assumed  that  it  is  free  to  make recommendations,  provided  that  these  did  not  directly  contradict  a  Security  Council  resolution41. /n/nThis  view  is  traditionally  legitimized  by  the  Uniting  for  Peace  Resolution  Mechanism42  which acknowledges  that  the  failure  of  the  Security  Council  to  discharge  its  responsibilities  does  not deprive  the  General  Assembly  of  its  rights  or  relieve  it  of  its  responsibilities  under  the  Charter. Having  said  that,  Indonesia  is  of  the  view  that  the  advisory  opinion  request  falls,  without  any doubt, within the scope of “functions” and “powers” of the General Assembly.  The argument that the advisory opinion request was ultra vires the competence of the General Assembly is therefore unfounded. /n/nMr. President,  distinguished  Members  of  the  Court,  a  State  or  group  of  States  might oppose  the  rendering  of  an  opinion  by  the  Court  on  the  ground  that  the  Court’s  opinion  on  this question will jeopardize the negotiating process.  On the contrary, the impartial legal views of the Court  will  give  a  solid  international  legal  ground  to  speed  up  the  negotiating  process.    The negotiating process cannot be a “compelling reason” for the Court not to give its opinion.  There is no precedent that the impartial legal opinion of the World Court would hamper the peace process or create additional barriers for the negotiating process or  make the  “two-State” solution impossible. Indonesia  shares  the  view  that  the  establishment  of  a  Palestinian  State,  living  side  by  side  with Israel must be realized through political dialogue.  It consistently maintains that the interest of the very  fundamental  principle  of  international  law  shall  not  be  compromised.    As  mentioned  by  the distinguished Palestinian representative yesterday, the implementation of the peace process should not  be  at  the  expense  of  the  legal  rights  of  the  Palestinian  people.    In  this  regard,  the  Indonesian Government believes that the advisory opinion of the Court could contribute positively to the peace process. /n/nThe  positive  contribution  of  the  Court  to  the  peace  process  has  been  expressed  by  a Member  of  the  Court,  the  former  Judge  and  President,  Mohamed  Bedjaoui,  before  the  Sixth Committee  on  16 October  1995.    In  this  case,  Indonesia  also  endorses  the  preventive  nature  of advisory opinions.  Since an advisory opinion could provide an authoritative and important guide, advisory  procedure  appears  to  be  an  instrument  of  “preventive  diplomacy”,  as  envisaged  in “Agenda  for  Peace”,  which  is  a  particularly  suitable  means  for  the  Court  to  defuse  tension  and ward  off  conflicts  by  the  determination  of  law.    In  this  connection,  I  would  like  to  recall  the positive  contribution  of  the  Court’s  Opinion  on  Namibia  to  the  establishment  of  the  rule  of international law in south-western Africa.  Within this context, Indonesia expects that an advisory opinion on this particular issue would be a legal building block for the peace process in the Middle East.  The impartial legal opinion of the Court on this question would provide a solid international legal ground ensuring that the negotiation process be fairly conducted in good faith."
    },
    {
        "voto": 1,
        "juez": "Indonesia",
        "pregunta":"The construction of the wall being built by Israel, the occupying Power, in the Occupied Palestinian Territory, including in and around East Jerusalem, and its associated régime, are contrary to international law",
        "texto": "Mr. President,  honourable  judges,  on  the  issue  of  legality,  Indonesia  strongly  believes that there is no legal justification for Israel to construct the Wall44.  The Wall is illegal because it is meant  to  ensure  control  of  the  Palestinian  Territories  through  various  measures.    By  building  the Wall,  the  Israeli  Government  has  ordered  vast  expropriations  of  land  and  has  destroyed  homes, shops, schools, water networks and agricultural land.  On the applicability of international humanitarian  law  in  the  Occupied  Palestinian  Territory,  the  construction  of  the  Wall  and  related access  arrangements  fail  to  meet  the  requirements  of  international  human  rights  and  humanitarian law. /n/nThe Wall violates Article 2 of the Universal Declaration of Human Rights.  Article 2 of the  Universal  Declaration  of  Human  Rights  also  makes  it  clear  that  “no  distinction  shall  be  made on the basis of the political, jurisdictional or international status of the country or territory to which a person belongs, whether it be independent, trust, non-self-governing or under any other limitation of sovereignty”.  This approach is also confirmed by United Nations General Assembly resolution 48/121  (1993)  endorsing  the  “Vienna  Declaration  and  Action  Plan  from  the  World Conference  on  Human  Rights”.    It  explicitly  ensures  that  effective  international  measures,  to guarantee and monitor the implementation of a human rights standard, should be taken in respect of people under foreign occupation. /n/nAlthough Article 12 of the ICCPR stated that freedom of movement can be restricted for security reasons  but the restrictions should be limited to what is necessary and proportionate as mentioned  in  General  Comments  No. 27  adopted  by  the  Human  Rights  Committee51.    The  Wall creates  walled-in  enclaves  confining  tens  of  thousands  of  people.    It  sharply  limits  freedom  of movement  except  to  a  handful  of  permit-holders,  and  endangers  Palestinians’  access  to  basic services  such  as  education  and  medical  care  and  other  access  to  work  and  water.    The  Israeli Government cannot use security concerns for Israelis living in illegal settlements to justify further illegal  changes  to  the  Occupied  Territory  by  constructing  illegal  barriers.    To  be  permissible, restrictions must be provided by law, must be necessary in a democratic society for the protection of  these  purposes  and  must  be  consistent  with  all  other  rights  recognized  in  the  Convention52. Restrictive measures must conform to the principle of proportionality;  they must be appropriate to achieve their protective function;  they must be the least intrusive instrument amongst those which might  achieve  the  desired  result;    and  they  must  be  proportionate  to  the  interest  to  be  protected53. The construction of a wall does not fulfil the obligation under Article 12 of the ICCPR. /n/nThe Wall also infringes on other Palestinian rights such as right to property as enshrined in  Article 17  of  the  Universal  Declaration  on  Human  Rights,  Article 1  of  the  ICESCR,  and Article 1 of the ICCPR;  the right to health as stated in Article 12 of the ICESCR and Article 56 of the  Fourth  Geneva  Convention;    the  right  to  education  as  stated  in  Article 3  of  the  ICESCR, Article 50  of  the  Fourth  Geneva  Convention;    the  right  to  work  as  enshrined  in  Article 23  of  the Universal Declaration of Human Rights and Article 6 of the ICESCR;  the right to food and water as  stated  in  Article 11  of  the  ICESCR;    and  lastly,  the  right  to  freedom  of  religion  as  stated  in Article 18 of the ICCPR, and Article 58 of the Fourth Geneva Convention. /n/nThe  construction  of  the  Wall  by  Israel  in  the  Occupied  Palestinian  Territory,  including  East Jerusalem,  departing  from  the  Armistice  Line  of  1949,  is  illegal  under  relevant  norms  and principles of international law and must be ceased and reversed."
    },
    {
        "voto": 1,
        "juez": "Indonesia",
        "pregunta": "Israel is under an obligation to terminate its breaches of international law; it is under an obligation to cease forthwith the works of construction of the wall being built in the Occupied Palestinian Territory, including in and around East Jerusalem, to dismantle forthwith the structure therein situated, and to repeal or render ineffective forthwith all legislative and regulatory acts relating thereto, in accordance with paragraph 151 of this Opinion",
        "texto": "Israel  is  a  party  to  the  Fourth  Geneva  Convention  of  1949  relative  to  the  Protection  of Civilian  Persons  in  Time  of  War  and  two  international  covenants  which  are  the  International Covenant  on  Civil  and  Political  Rights  (ICCPR),  and  the  International  Covenant  on  Social, Economical  and  Cultural Rights  (ICSECR).    However,  time  and  again,  Israel  refuses  to  apply  the Fourth  Geneva  Convention  to  the  Occupied  Palestinian  Territory  even  though  the  international community called upon the Israeli Government to accept de jure application of the Fourth Geneva Convention  in  Palestine45.    Also  according  to  Article 2  of  the  ICCPR  Israel,  as  a  party,  must undertake  “to  respect  and  to  ensure  to  all  individuals  within  its  territory  and  subject  to  its jurisdiction  the  rights  recognized  in  the  present  Covenant”.    Since  Palestinian  Territories  are  not part  of  Israel,  it  should  strictly  follow  these  principles,  not  only  towards  its  nationals  but  also  in protecting  the  rights  of  Palestinians.    Israel  should  accept  the  applicability of  international  human rights  and  humanitarian  law.    Israel  should  also  incur  international  responsibilities  arising  from  a continuing violation of international obligations46. /n/nHonourable judges,  Article 47 of the Fourth Geneva Convention ensures that the occupied population is entitled to certain rights that “protected persons . . . shall not be deprived, in any case or in any manner whatsoever, of  the  benefits  the  present  convention  by  any  change  introduced,  as  the  result  of  the occupation  of  a  territory,  into  the  institutions  or government  of  the  said  territory,  nor by any agreement concluded between the authorities of the occupied territories and the Occupying Power”. International humanitarian law guarantees in Article 27 that “Protected persons are entitled, in all circumstances, to respect for their persons, their  honor,  their  family  rights,  their  religious  convictions  and  practices,  and  their manners  and  customs.    They  shall  at  all  times  be  humanely  treated,  and  shall  be protected  especially  against  all  acts  of  violence  or  threats  thereof  and  against  insults and public curiosity.”47 The  Wall  is  a  combined  product  of  the  settlements  and  closure  policies.    The  Wall  adds  a permanent  barrier  to  the  barriers  already  put  in  place  through  checkpoints.    In  addition,  it  is  a permanent expropriation of private property. /n/nThe  “Bertini  Report”48  has  elaborated  on  the  humanitarian  situation  in  Palestine  and shown how closures, sieges, curfews and checkpoints are  strategies that have  affected the right to the freedom of movement and property.  The report states: “Palestinians  are  subject  to  a  variety  of  closures,  curfews,  roadblocks  and restrictions  that  have  caused  a  near-collapse  of  the  Palestine  economy . . .  and  rising dependency  on  humanitarian  assistance.    The  restrictions  affect  almost  all  activities, rendering  most  Palestinians  unable  to  carry  out  any  semblance  of  a  normal  life  and subject to daily hardships, deprivations and affronts to human dignity.”49 The  report  also  states  “There  is  a  consensus  among  all  parties,  and  this  report  confirms,  that  the current regime of closures and curfews is having a devastating impact on the Palestinian population, both on their economy and the humanitarian situation.” /n/nThe  International  Committee  of  the  Red  Cross  in  its  press  release  of  18 February 2004, stated  inter  alia  its  concern  about  the  humanitarian  impact  of  the  West  Bank  barrier  on  many Palestinians living in the Occupied Territory.  The ICRC’s opinion is that the West Bank barrier, in as  far  as  its  route  deviated  from  the  “Green  Line”  into  Occupied  Territory,  is  contrary  to international  humanitarian  law.    The  problems  affecting  the  Palestinian  population  in  their  daily lives clearly demonstrate that it runs counter to Israel’s obligation under international humanitarian law  to  ensure  the  humane  treatment  and  well-being  of  the  civilian  population  living  under  its occupation.  The measures taken by the Israeli authorities linked to the construction of the barrier in  the  Occupied  Territory  go  far  beyond  what  is  permissible  for  an  occupying  power  under international  humanitarian  law.    These  findings  are  based  on  the  ICRC’s  monitoring  of  the  living conditions of the Palestinian population and on its analysis of the applicable international humanitarian  law  provisions.    The  Israeli  authorities  have  been  regularly  informed  about  the ICRC’s  humanitarian  and  legal  concerns.    And  the  ICRC  therefore  calls  on  Israel  not  to  plan, construct, or maintain this barrier within the Occupied Territory. /n/nIsrael is under an obligation to fully and effectively respect the Fourth Geneva Convention, as well as Additional Protocol I to the Geneva Conventions to the Occupied Palestinian Territory, including East Jerusalem. /n/nAll  norms  and  principles  as  provided  by  international  human  rights  conventions  shall  be respected in the Occupied Palestinian Territory, including East Jerusalem, and therefore Israel is  under  obligations  to  stop  its  grave  breaches  of  international  human  rights  law,  and  to  bring all the perpetrators of human rights atrocities to justice."
    },
    {
        "voto": 1,
        "juez": "Indonesia",
        "pregunta": "Israel is under an obligation to make reparation for al1 damage caused by the construction of the wall in the Occupied Palestinian Territory,including in and around East Jerusalem",
        "texto": "Honourable  judges,  as  widely  reported,  the  construction  of  the  Wall  has  destroyed schools,  commercial  buildings,  homes,  water  networks  and  has  made  difficulties  for  teachers reaching their classes when travelling.  The shops and enterprises have been closed as a consequence  of  the  Wall.    The  restriction  of  movement  also  affects  access  to  sacred  places  and mosques.    Regarding  the  right  to  food  and  water,  the  Israeli  authority  has  taken  food  away  from farmers and the Wall has affected communities’ access to water.  Israel, as Occupying Power, does not fulfil its obligation to ensure the Palestinian right to health.  As reported by the Bertini Report there  are  “access  restrictions . . .  [which]  prevent  Palestinians  in  need  of  medical  treatment  from reaching health services” /n/nIsrael  is  under  a  legal  obligation  to  restore  land  and  private  properties  forcibly  seized  for  the construction of the Wall, to pay full compensation, to annul all measures enacted regarding the Wall,  to  cease  restriction  on  freedom  of  movement  in  the  Occupied  Palestinian  Territory, including East Jerusalem. /n/nLast  but  not  least,  Israel  is  under  an  obligation  to  co-operate  with  international  humanitarian organizations,  including  the  International  Committee  of  the  Red  Cross  and  the  Human  Rights Committee to respect the dignity of the Palestinian people."
    }
]