[
    {
        "voto": 1,
        "juez": "Malaysia",
        "pregunta": "Finds that it has jurisdiction to give the advisory opinion requested",
        "texto": "First, the request to render an urgent advisory opinion comes from the General Assembly, one of the two named principal organs of the United Nations which may request your Court to give an advisory opinion on “any legal question”. /n/nThe Court is presented by the General Assembly with an unambiguously legal question, and nothing more than a legal question. It is not for the Court to scrutinize possible scenarios about the political consequences of an advisory opinion with regard to a particular situation or to consider whether a State, which has disregarded innumerable United Nations resolutions, will be pleased or not with the advisory opinion. This has never been the role of the Court. The Court has never acted in such a manner. Those inviting it to adopt such an attitude are, in Malaysia’s view, seriously damaging the Court’s function, integrity and credibility. /n/nHere Malaysia wishes to concentrate this part of its oral statement on the nature of the territory upon which Israel is constructing the main part of its Wall. This is an essential point which the Court has to address with regard to both the admissibility of the request and the merits of the advisory opinion."
    },
    {
        "voto": 1,
        "juez": "Malaysia",
        "pregunta":"The construction of the wall being built by Israel, the occupying Power, in the Occupied Palestinian Territory, including in and around East Jerusalem, and its associated régime, are contrary to international law",
        "texto": "The General Assembly has come to the Court to seek and to obtain clarification on the legal consequences arising from the construction of the Wall being built by Israel, considering the rules and  principles  of  international  law,  and  to  obtain  further  legal  guidance  that  will  assist  the international community to determine its response.  No institution is better placed than your Court to assess in an authoritative way the situation from an international law perspective. /n/nThe Wall, sections of which are constructed deep inside the Occupied Palestinian Territory, departs from the Armistice Line of 1949 and is therefore illegal under international law. This implies the violation of the obligation to respect the territorial integrity of Palestine and the right of the Palestinian people to self-determination. /n/nThe Wall gravely violates the Fourth Geneva Convention in that it involves the illegal, de facto attempt at annexation of substantial parts of the Palestinian territory and its resources; the transfer of a large number of Palestinian civilians, and further deprivation of human rights of the Palestinians, resulting in further dire humanitarian consequences among an already deprived people. /n/nThe Wall constitutes a unilateral action. It harms the process of implementation of the Road Map. It undermines the effective creation of the Palestinian State. All of this implies a violation of the obligation to pursue negotiations in good faith. /n/nFourthly, the General Assembly adopted on 21 October 2003 the above-mentioned resolution A/ES-10/13, co-sponsored by the European Union and its acceding and associated members. The Assembly demanded that Israel stop and reverse the construction of the Wall in the Occupied Palestinian Territory, considering that this construction is in contradiction with relevant provisions of international law and requested the Secretary-General to report on compliance with the resolution. The Security Council’s failure to adopt a resolution to the same effect was only because of the exercise of a veto. On 24 November, the United Nations Secretary-General submitted a very disturbing report on the non-compliance of Israel with the European Union-initiated Assembly resolution, describing the poor conditions and deprivation of human rights of the Palestinian people and the failure to achieve a peaceful solution. Given this situation, it became imperative upon the Assembly to act. /n/nMoreover, the other so-called “half” of the question, that is the struggle against terrorism, was raised by Israel to justify the construction of the Wall. As reiterated in our Written Statement, Malaysia has always and consistently condemned all forms and manner of terrorism. Internationally, its unequivocal position on terrorism is well known and on record. But Malaysia has also consistently reaffirmed that the struggle against terrorism must be accomplished within the realm of international law and not in violation thereof. As demonstrated in Malaysia’s Written Statement, the construction of the Wall in the Occupied Palestinian Territory cannot be justified on the ground of self-defence, the only circumstance precluding wrongfulness invoked by Israel. Indeed, no other circumstance precluding wrongfulness could be rightfully raised. The conditions required by the Draft Articles on State Responsibility adopted by the International Law Commission to invoke such circumstances as necessity, distress or counter-measures, are clearly not met here. To mention just one reason, the construction of the Wall constitutes a violation of peremptory norms of international law, such as the right to self-determination of peoples and the respect of the territorial integrity of other countries. Palestine is already such a fragile and small entity and there should be no other encroachment of its territory and its natural resources. /n/nIn our Written Statement Malaysia elaborated the main argument why the Court should comply with the General Assembly’s request for an advisory opinion. It is also the main reason why the construction of the Wall is illegal: the Occupied Palestinian Territory is one under international supervision, for which the United Nations in general and the General Assembly in particular have a special responsibility. This responsibility will last until the whole of the former British Mandated Territory achieves a final status, that is, by the effective existence of two States one Arab and the other Jewish living side by side in peace. /n/nGeneral Assembly and Security Council resolutions have clearly and insistently determined that the West Bank, including East Jerusalem, is Occupied Palestinian Territory. Israel simply cannot validly deny these determinations by the United Nations in discharge of the Organization’s special responsibilities for a territory under international supervision. Hence, in this case the Court is not facing a bilateral boundary dispute, or even less, an attempt to request the Court to consider a boundary dispute in another guise, as some have liked us to believe. In its Written Statement, Israel deliberately misrepresented what Malaysia stated in the General Assembly, in order to prove that the intention of the request for an advisory opinion is to solve a bilateral dispute between Palestine and Israel in favour of the former. No, Mr. President, it is not a bilateral dispute, it is the continuous defiance by Israel of the whole international community with regard to a territory for which the United Nations has a special responsibility and in which the entire international community has a particular interest. Yes, Mr. President, we would like to say again and again: “justice must be done in Palestine”. This refers primarily to the respect for international law. /n/nIsrael has adopted a position with regard to the legal status of the Palestinian territory akin to that followed by South Africa with regard to Namibia during the period of the unlawful occupation of Namibia. Israel assumes, without legal justification, to have “rights” over the territory. Legally, the Palestinian situation is even more straightforward than those in the Namibia and Western Sahara Advisory Opinions. Initially, South Africa had a legal title to administer South West Africa as a Mandatory Power, until this Mandate was validly revoked by the General Assembly in 1966. In the case of Western Sahara, Spain was recognized as the Administering Power of a non-self-governing territory. In the case of the Occupied Palestinian Territory none of this has occurred. Israel simply has no legal title to administer a territory under international supervision. It is merely a belligerent occupier. Israel is in a pure de facto situation. /n/nMoreover, it is an indisputable fact that Israel did not claim any title to the West Bank before 1967. Even in the aftermath of the six-day war, and with the exception of Jerusalem, there was “no claim to annexation or title”, as Judge Rosalyn Higgins rightly pointed out in an article written after the war. /n/nIndeed, by establishing a de facto unilateral demarcation line by constructing the Wall, Israel is also violating the obligation to respect the Green Line. As explained in Malaysia’s written statement, whatever the intention of the construction of the Wall, it clearly purports to establish a new separation line. Israelis have freedom of movement west of the Wall but Palestinians need a permit. One of the justifications advanced in the Israeli Written Statement is another clear evidence of this. I quote: “the fence will be moved to reflect any agreement between the parties”. If this will be the case, then the construction of the Wall is nothing else than a unilateral demarcation line imposed upon the other party now, until “any agreement between the parties” will be reached. Moreover, it could be difficult to find any stronger evidence that the Wall is not a simple “temporary measure against terrorism”, but a true de facto separation line aimed at annexation of Palestinian territory than that provided by the official website of the Ministry of Foreign Affairs of Israel. It refers to the “Western, or Israeli side of the security fence”! /n/nThe insistence of Israel in comparing its “fence” in the West Bank, including in and around Jerusalem, with those existing at the borders with Egypt, Jordan and Lebanon, provides yet another striking evidence that the Israeli Government’s purpose in constructing the Wall is not simply to prevent terrorism, but to establish a physical line separating two different areas of exercise of territorial control. Whilst not insisting here upon the “unilateral disengagement plan” as announced by the Israeli Prime Minister, this plan proves indisputably the intentions of the Government of Israel in constructing the Wall."
    },
    {
        "voto": 1,
        "juez": "Malaysia",
        "pregunta": "Israel is under an obligation to terminate its breaches of international law; it is under an obligation to cease forthwith the works of construction of the wall being built in the Occupied Palestinian Territory, including in and around East Jerusalem, to dismantle forthwith the structure therein situated, and to repeal or render ineffective forthwith all legislative and regulatory acts relating thereto, in accordance with paragraph 151 of this Opinion",
        "texto": "Equally, in terms of the law of armed conflict there is no military necessity for Israel to build a wall in a territory it already occupies. From a human rights law perspective the Wall cannot justify the non-compliance with core human rights that are of a non-derogatory nature, even during a state of public emergency. Assuming that the Wall is being constructed in order to protect Israeli citizens within Israel, the Wall should be built on Israeli territory. Furthermore, if an additional main concern is to provide security to the Israeli citizens illegally settled on occupied Palestinian territory, then the best way is to withdraw from those illegal settlements. In any event, to accommodate the security concerns of these illegal Israeli settlements can never be to the detriment of the security and living conditions of the Palestinian people within their own territory and lands. /n/nThe Court will have no difficulty in finding as legal consequences of the construction of the Wall that it neither affects Palestinian sovereignty over the territory lying between the Wall and the Green Line nor creates any territorial right whatsoever in favour of Israel. Moreover, Israel itself, in trying to justify the construction of the Wall, has recognized that the “fence”, as Israel calls it, does not “annex any Palestinian lands” and “does not establish a border”. Hence, since the territories lying between the Green Line and the Wall are internationally recognized as being Palestinian territory, since they have not been claimed as Israeli territory and since they have come under Israeli control only by virtue of military occupation in 1967, the construction and maintenance of the Wall does not affect Palestinian sovereignty and does not create any territorial right in favour of Israel."
    },
    {
        "voto": 1,
        "juez": "Malaysia",
        "pregunta": "All States are under an obligation not to recognize the illegal situation resulting from the construction of the wall and not to render aid or assistance in maintaining the situation created by such construction; all States parties to the Fourth Geneva Convention relative to the Protection of Civilian Persons in Time of War of 12 August 1949 have in addition the obligation, while respecting the United Nations Charter and international law, to ensure compliance by Israel with international humanitarian law as embodied in that Convention",
        "texto": "Fifthly, contrary to what Israel seems to suggest, the Tenth Emergency Special Session was convened and reconvened in a lawful way. In resolution A/ES-10/2 of 2 April 1997, by a vote of 134 to 3, with 11 abstentions, the Assembly determined that: “the repeated violation by Israel, the occupying Power, of international law and its failure to comply with relevant Security Council and General Assembly resolutions and the agreements reached between the parties undermine the Middle East peace process and constitute a threat to peace and security”. /n/nIndeed, Israel has spoken about “Palestinian lands”. But a distinction must be made here. They are not only Palestinian lands, but also Palestinian territory. The former refers to private property or ownership, the latter to sovereignty. Malaysia wishes to add one further legal consequence to those already mentioned at pages 55 and 56 of our Written Statement: the construction and maintenance of the Wall in the Occupied Palestinian Territory does not affect in any way the private or public property of land situated between the Green Line and the line followed by the Wall."
    }
]