[
    {
        "voto": 1,
        "juez": "Republic of Bangladesh",
        "pregunta": "Finds that it has jurisdiction to give the advisory opinion requested",
        "texto": "The overriding importance and universal applicability of the advisory opinion to be rendered by the International Court of Justice.\n\nUnder the first heading Bangladesh would like to submit that the request for an advisory opinion made in resolution ES-10/16 is well founded in international law and is timely and appropriate in the context of the prevailing conditions in the Occupied Palestinian Territory. The basis of this submission is the persistent and continuing Israeli disregard of resolutions adopted by the United Nations Security Council, principally resolutions 242 and 348 and relevant resolutions of the United Nations General Assembly, the provisions of the Geneva Conventions and Additional Protocols and general international law. This persisting pattern of disregard over the decades threatens to undermine the authority and application of fundamental and peremptory norms of the United Nations Charter and international law.\n\nBangladesh considers that for the above reasons the advisory opinion to be rendered by the International Court of Justice will have significance beyond the Middle East and to future situations of conflict in different parts of the world. Since in the view of Bangladesh, the International Court of Justice will deliberate on fundamental principles of the Charter of the United Nations and international law, the Court’s pronouncement, will be timely, appropriate and likely to make a most valuable contribution to the establishment of peace not only in the Middle East but all over the world.\n\nIn this connection Bangladesh would like to recall the observations of the distinguished South African delegations in the debate of 8 December 2003 at the 10th Emergency Special Session of the General Assembly, in reference to the request for an advisory opinion as follows:\n“a clear precedent already exists for such an approach. In 1971 the United Nations Security Council called for an advisory opinion from International Court of Justice on the legal consequences for States of the occupation of Namibia. That opinion proved to be a turning point in the long struggle for independence of that country. We believe that Palestinians and Israelis alike would similarly benefit from a ruling of the International Court of Justice.”\n\nBangladesh fully concurs with this view. We also fully concur with the positions strongly stated in the previous presentations highlighting how the advisory opinion of this esteemed court will be in full consonance with positions taken by it in the past, the objective dictates of moral and legal compulsions and the overarching imperative to take all necessary steps to establish enduring peace in Palestine.\n\nBangladesh expresses its conviction that the advisory opinion to be rendered by the International Court of Justice will strengthen the application of the basic principles enshrined in the United Nations Charter and in general international law and would reaffirm that a just and lasting peace in the Middle East can only be established on the basis of these principles."
    },
    {
        "voto": 1,
        "juez": "Republic of Bangladesh",
        "pregunta": "Decides to comply with the request for an advisory opinion",
        "texto": "The overriding importance and universal applicability of the advisory opinion to be rendered by the International Court of Justice.\n\nUnder the first heading Bangladesh would like to submit that the request for an advisory opinion made in resolution ES-10/16 is well founded in international law and is timely and appropriate in the context of the prevailing conditions in the Occupied Palestinian Territory. The basis of this submission is the persistent and continuing Israeli disregard of resolutions adopted by the United Nations Security Council, principally resolutions 242 and 348 and relevant resolutions of the United Nations General Assembly, the provisions of the Geneva Conventions and Additional Protocols and general international law. This persisting pattern of disregard over the decades threatens to undermine the authority and application of fundamental and peremptory norms of the United Nations Charter and international law.\n\nBangladesh considers that for the above reasons the advisory opinion to be rendered by the International Court of Justice will have significance beyond the Middle East and to future situations of conflict in different parts of the world. Since in the view of Bangladesh, the International Court of Justice will deliberate on fundamental principles of the Charter of the United Nations and international law, the Court’s pronouncement, will be timely, appropriate and likely to make a most valuable contribution to the establishment of peace not only in the Middle East but all over the world.\n\nIn this connection Bangladesh would like to recall the observations of the distinguished South African delegations in the debate of 8 December 2003 at the 10th Emergency Special Session of the General Assembly, in reference to the request for an advisory opinion as follows:\n“a clear precedent already exists for such an approach. In 1971 the United Nations Security Council called for an advisory opinion from International Court of Justice on the legal consequences for States of the occupation of Namibia. That opinion proved to be a turning point in the long struggle for independence of that country. We believe that Palestinians and Israelis alike would similarly benefit from a ruling of the International Court of Justice.”\n\nBangladesh fully concurs with this view. We also fully concur with the positions strongly stated in the previous presentations highlighting how the advisory opinion of this esteemed court will be in full consonance with positions taken by it in the past, the objective dictates of moral and legal compulsions and the overarching imperative to take all necessary steps to establish enduring peace in Palestine.\n\nBangladesh expresses its conviction that the advisory opinion to be rendered by the International Court of Justice will strengthen the application of the basic principles enshrined in the United Nations Charter and in general international law and would reaffirm that a just and lasting peace in the Middle East can only be established on the basis of these principles."
    },
    {
        "voto": 1,
        "juez": "Republic of Bangladesh",
        "pregunta": "The construction of the wall being built by Israel, the occupying Power, in the Occupied Palestinian Territory, including in and around East Jerusalem, and its associated régime, are contrary to international law",
        "texto": "The application of the principles of the United Nations Charter, the resolutions of United Nations Security Council and United Nations General Assembly, for a just and lasting peace in the Middle East based on the termination of the illegal occupation of Palestinian territory and the self-determination of the people of Palestine.\n\nWe would like to submit that a just and lasting peace in the Middle East is based on the fundamental principle of the United Nations Charter and general international law that forcible occupation of Palestinian territory is illegal and attempted annexation of territory through use of force is also illegal. This principle underlines the relevant Untied Nations Security Council resolutions including resolutions 242, 338, 1397 and 1402. It also informs the peace process, and the recommendations of the Mitchell Report, the Tenet Work Plan and the Road Map endorsed by the Quartet. This fundamental principle requires the withdrawal of Israeli forces from the occupied territories and the declaration of Israeli settlements illegal and an obstacle to peace and calls for the complete cessation of settlement activities. The construction of the Wall operates to frustrate and undermine the application of this fundamental principle and represents a move to annex and permanently occupy the territory of Palestine and alter the ground realities to the detriment of the people of Palestine. A series of United Nations General Assembly resolutions have reaffirmed the inalienable right of the Palestinian people to self-determination including their right to have an independent State of their own while recognizing that all States in the region have the right to live in peace within secure and internationally recognized boundaries. The ongoing construction of the Wall effectively denies the right of the people of Palestine to self-determination. The construction also negates the inalienable right to return of the Palestinian people.\n\nThe application of international humanitarian law and in particular the Fourth Geneva Convention.\n\nThe Fourth Geneva Convention of 1949 prohibits the occupying power from depriving protected persons from the benefit of the Convention in any case or in any manner whatsoever including annexation of the whole or part of the occupied territory (Art. 47). This provision has been described as having “an absolute character”. The provision also incorporates a universally recognized rule endorsed by jurists and confirmed by numerous rulings of national and international courts, namely, “As long as hostilities continue the Occupying Power cannot therefore annex the occupied territory, even if it occupies the whole of the territory concerned. A decision on the point can only be reached in the peace treaty.” The construction of the Wall violates and breaches this basic rule, which has been declared applicable to the Occupied Territory of Palestine by resolutions of the United Nations Security Council and the United Nations General Assembly. The construction of the Wall also breaches Articles 9, 39, 51 of the Fourth Geneva Convention. It effectively deprives the Palestinian people from enjoyment of their property, access to employment and means of livelihood, access to natural resources necessary for human survival.\nFor these reasons it is our submission that the construction of the Wall constitutes a grave breach of the Geneva Conventions of 1949.\n\nThe four Geneva Conventions of 1949 and the Additional Protocols of 1977 enjoy universal acceptance and have passed into customary international law. These instruments constitute the central pillars of international humanitarian law. In the hierarchy of norms, the Geneva Conventions enjoy precedence. The Israeli claim that the Wall constructed in the Occupied Palestine Territory as a security barrier is not tenable. The location of the Wall itself raises grave questions of legality and the actual motive behind the construction of the Wall in the Occupied Territories. As was made amply clear in the Palestinian presentation this morning, the security needs could very well have been addressed by Israel without fundamentally altering the character of the Occupied Territories and segmenting it into small parcels with the presence of Israeli settlements. Bangladesh respectfully submits that the International Court of Justice reaffirms the sanctity of the Geneva Conventions and their application to the situation now obtaining in Palestine. It is necessary that this be so for the maintenance of international peace and security and that an affirmation of fundamental points of law is essential to uphold the rule of law amongst nations. The International Court of Justice, we hope, will adjudge and declare the construction of the Wall as illegal and contrary to general international law. We also hope that the esteemed Court will spell out in clear terms the legal consequences of the construction of this Wall.\n\nThe legal consequences of the construction of the Wall\n\nThe construction of the Wall in Palestine territory by the Occupying Power represents the culmination of a long-standing policy of permanent occupation and annexation of territory. The construction engenders crimes against humanity and in particular the following:; Intentionally directing attacks against the civilian population as such or against individual civilians not taking a direct part in hostilities,; Intentionally directing attacks against civilian objects, that is, objects which are not military objectives,; Intentionally directing attacks against personnel, installations, materials, units or vehicles involved in a humanitarian assistance or peace-keeping mission in accordance with the United Nations Charter, as long as they are entitled to the protection given to civilians or civilian objects under the international law of armed conflicts,; The transfer, directly or indirectly, by the Occupying Power of parts of its own civilian population into the territory it occupies, or the deportation or transfer of all or parts of the population of the Occupied Territory within or outside this Territory,; Intentionally directing attacks against buildings dedicated to religion, education, art, science or charitable purposes, historic monuments, hospitals and places where the sick and wounded are collected, provided they are not military objectives,; Destroying or seizing the enemy’s property unless such destruction or seizure be imperatively demanded by the necessities of war,; Declaring abolished, suspended or inadmissible in a court of law the rights and actions of the nationals of the hostile party,; Committing outrages upon personal dignity, in particular humiliating and degrading treatment,; Intentionally directing attacks against building, materials, medical units and transport and personnel using the distinctive emblems of the Geneva Conventions in conformity with international law; Intentionally using starvation of civilians as a method of warfare by depriving them of objects indispensable to their survival, including wilfully impeding relief supplies as provided for under the Geneva Convention.\n\nBangladesh submits that the impact of the construction of the Wall in and at the vicinity of Jerusalem also deserves special consideration by the International Court of Justice, as it alters or purports to alter the special status of the Holy City sacred to three great faiths. Bangladesh believes that the solution of the problem of Jerusalem and abandoning the construction of the Wall in the vicinity of the Holy City is a key to the achievement of just and durable peace in the Middle East."
    },
    {
        "voto": 1,
        "juez": "Republic of Bangladesh",
        "pregunta": "Israel is under an obligation to make reparation for all damage caused by the construction of the wall in the Occupied Palestinian Territory,including in and around East Jerusalem",
        "texto": "The application of the principles of the United Nations Charter, the resolutions of United Nations Security Council and United Nations General Assembly, for a just and lasting peace in the Middle East based on the termination of the illegal occupation of Palestinian territory and the self-determination of the people of Palestine.\n\nWe would like to submit that a just and lasting peace in the Middle East is based on the fundamental principle of the United Nations Charter and general international law that forcible occupation of Palestinian territory is illegal and attempted annexation of territory through use of force is also illegal. This principle underlines the relevant Untied Nations Security Council resolutions including resolutions 242, 338, 1397 and 1402. It also informs the peace process, and the recommendations of the Mitchell Report, the Tenet Work Plan and the Road Map endorsed by the Quartet. This fundamental principle requires the withdrawal of Israeli forces from the occupied territories and the declaration of Israeli settlements illegal and an obstacle to peace and calls for the complete cessation of settlement activities. The construction of the Wall operates to frustrate and undermine the application of this fundamental principle and represents a move to annex and permanently occupy the territory of Palestine and alter the ground realities to the detriment of the people of Palestine. A series of United Nations General Assembly resolutions have reaffirmed the inalienable right of the Palestinian people to self-determination including their right to have an independent State of their own while recognizing that all States in the region have the right to live in peace within secure and internationally recognized boundaries. The ongoing construction of the Wall effectively denies the right of the people of Palestine to self-determination. The construction also negates the inalienable right to return of the Palestinian people."
    },
    {
        "voto": 1,
        "juez": "Republic of Bangladesh",
        "pregunta": "All States are under an obligation not to recognize the illegal situation resulting from the construction of the wall and not to render aid or assistance in maintaining the situation created by such construction; all States parties to the Fourth Geneva Convention relative to the Protection of Civilian Persons in Time of War of 12 August 1949 have in addition the obligation, while respecting the United Nations Charter and international law, to ensure compliance by Israel with international humanitarian law as embodied in that Convention",
        "texto": "The application of the principles of the United Nations Charter, the resolutions of United Nations Security Council and United Nations General Assembly, for a just and lasting peace in the Middle East based on the termination of the illegal occupation of Palestinian territory and the self-determination of the people of Palestine.\n\nWe would like to submit that a just and lasting peace in the Middle East is based on the fundamental principle of the United Nations Charter and general international law that forcible occupation of Palestinian territory is illegal and attempted annexation of territory through use of force is also illegal. This principle underlines the relevant Untied Nations Security Council resolutions including resolutions 242, 338, 1397 and 1402. It also informs the peace process, and the recommendations of the Mitchell Report, the Tenet Work Plan and the Road Map endorsed by the Quartet. This fundamental principle requires the withdrawal of Israeli forces from the occupied territories and the declaration of Israeli settlements illegal and an obstacle to peace and calls for the complete cessation of settlement activities. The construction of the Wall operates to frustrate and undermine the application of this fundamental principle and represents a move to annex and permanently occupy the territory of Palestine and alter the ground realities to the detriment of the people of Palestine. A series of United Nations General Assembly resolutions have reaffirmed the inalienable right of the Palestinian people to self-determination including their right to have an independent State of their own while recognizing that all States in the region have the right to live in peace within secure and internationally recognized boundaries. The ongoing construction of the Wall effectively denies the right of the people of Palestine to self-determination. The construction also negates the inalienable right to return of the Palestinian people."
    }
]



