[
    {
        "voto": 1,
        "juez": "Republic of the Sudan",
        "pregunta": "Finds that it has jurisdiction to give the advisory opinion requested",
        "texto": "On the competence of the Court\n\nOn the competence of the Court, Article 92 of the United Nations Charter designated the Court as the “principal judicial organ of the United Nations”, and Article 96, paragraph 1, stipulates that the General Assembly or the Security Council may request the International Court of Justice to give an advisory opinion on any legal question. The Statute of the Court (Article 65) further stipulates that the Court may give an advisory opinion on any legal question at the request of whatever body may be authorized by or in accordance with the Charter of the United Nations to make such a request. There are no limitations, provisos or restrictions in those Articles, once the organs are requesting opinions on a question of law.\n\n6. The General Assembly, as authorized by the United Nations Charter has made such a request to the Court via its resolution ES-10/14 adopted on 8 December 2003 to urgently render an advisory opinion on the question of:\n\n “What are the legal consequences arising from the construction of the wall being built by Israel, the Occupying Power, in the Occupied Palestinian Territory, including in and around Jerusalem, as described in the report of the Secretary-General, considering the rules and principles of international law, including the Fourth Geneva Convention of 1949, and relevant Security Council and General Assembly resolutions?”\n\nThis request has come from a duly authorized organ (the United Nations General Assembly) as stipulated by the United Nations Charter and the Statute, and on a question of law (the legal consequences of the construction of the Wall within the rules and principles of international law). Arguments to the contrary do not hold, as the Court itself has proved through time. In its Advisory Opinions of 28 May 1948 and 3 March 1950 on Admission of States to the United Nations, the Court declared that it could give an opinion on any legal question and that there was no provision which prohibited it from exercising “an interpretive function falling within the normal exercise of its judicial powers”.\n\nThe Court further pointed out in its Opinion of 3 March 1950 that it could not attribute a political character to a request “which, framed in abstract terms, invited it to undertake an essentially judicial task, the interpretation of a treaty provision”. It is also a known fact that the majority of international law issues are typically part of a wider political context.\n\nIn its Advisory Opinion on the Legal Consequences for States of the Continued Presence of South Africa in Namibia of 21 June 1971, the President of the Court declared on the question of political pressure, and as a matter of judicial propriety, that the Court as the principal judicial organ of the United Nations, and in that capacity “would act only on the basis of law, independently of all outside influences or interventions whatsoever”.\n\nThe competence of the Court was again emphasized on considering the Western Sahara Advisory Opinion request in October 1975. The Court stated that “under Article 65, paragraph 1, of the Statute, the Court may give an advisory opinion, on any legal question at the request of any duly authorized body. The Court notes that the General Assembly of the United Nations is suitably authorized by Article 96, paragraph 1, of the Charter and that the two questions submitted to it are framed in terms of law and raise problems of international law. They are in principle questions of a legal character, even if they also embody questions of fact, and even if they do not call upon the Court to pronounce on existing rights and obligations. The Court is accordingly competent to entertain the request.”\n\nThe Court also, in the WHO and Egypt Advisory Opinion of 20 December 1980, stated that “it does not have to deal with the motives, which may have inspired the request once a submitted request falls within the normal exercise of its judicial process”. The Court affirmed this position further in the Nuclear Weapons Advisory Opinion of 6 July 1996.\n\nThe Court thus has consistently taken the position, that as the principal judicial organ of the United Nations, it has to shoulder its judicial interpretive responsibilities, and only decline giving opinions when there are compelling reasons, and when the question is not of law. As a matter of fact this Court has never failed to assert its competence to give advisory opinions on cases referred to it by duly authorized organs of the United Nations, and which has competence to do so on the specified issue. In this respect the Court summarized its practice in granting advisory opinions in the case concerning the Legality of the Threat or Use of Nuclear Weapons, 1996, when it stated: “In accordance with the jurisprudence of the Court, only ‘compelling reasons’ could lead it to such a refusal... there has been no refusal, based on the discretionary power of the Court, to act upon a request for advisory opinion in the history of the present Court.”\n\n "
    },
    {
        "voto": 1,
        "juez": "Republic of the Sudan",
        "pregunta": "The construction of the wall being built by Israel, the occupying Power, in the Occupied Palestinian Territory, including in and around East Jerusalem, and its associated régime, are contrary to international law",
        "texto": "The continuous construction and the presence of the Wall along the route which it follows defy the will of the international community. The Secretary-General’s report clearly states that Israel has not complied with the demand of the United Nations General Assembly in its resolution ES-10/13 to stop or reverse the ongoing construction of the barrier. The report’s observations included the following: “In keeping with the request of the General Assembly in resolution ES-10/13, I have concluded that Israel is not in compliance with the Assembly’s demand that it ‘stop and reverse the construction of the wall in the Occupied Palestinian Territory’.”\n\nIn his recent statement to the Court of 19 January 2004, the Secretary-General further concludes that the update of the report “finds that the Government of Israel has continued with ongoing construction of the barrier along the route approved by the Israeli cabinet on 1 October 2003 in Decision 883”.\n\n16. The Wall built in Occupied Palestinian Territory complicates efforts for reaching a final settlement to the Palestinian-Israeli problem, which has remained a highly threatening issue for international peace and security. As the United Nations Secretary-General concluded in his report prepared pursuant to General Assembly resolution ES-10/13, the Wall is of serious concern and has implications for the future. As he put it,\n\n“In the midst of the roadmap process, when each party should be making good-faith confidence-building gestures, the Barrier’s construction in the West Bank cannot in this regard, be seen as anything but a deeply counterproductive act. The placing of most of the structure on Occupied Palestinian Land could impair further negotiations.”\n\nThe Wall, hence, is a contradiction to international law being built in the Occupied Territory and can only be seen as intended to prejudge and complicate the final solution. The Secretary-General’s report further concludes “the Wall could change the longer-term prospects for peace by making the creation of an independent, viable and contiguous Palestinian State more difficult, or that increases suffering among the Palestinian People”.\n\nIt is therefore our contention that an advisory opinion pronouncing the legal consequences of the construction of the Wall shall benefit the prospects for peace by clarifying the law and discouraging unilateral negative actions.\n\nIt is a breach of international obligations by a State when an act of that State is not in conformity with what is requested of it by that obligation, regardless of its origin or character: this is found in Article 12 of the Draft Law on State Responsibility adopted by the International Law Commission in 2001 and of which the United Nations General Assembly took note in resolution 56/83 of 12 December 2001.\n\nThe construction of the Wall is to be considered an internationally wrongful act, as it constitutes a breach of international law within the meaning of these Articles.\n\nIt follows that Israel should continue the duty to perform the obligation breached including termination and cessation of the wrongful act, restitution and reparation.\n\nFurthermore, the construction of the Wall and its planned route, which deviates from the Armistice Line, and consumes almost 16.6 per cent of the entire West Bank, as reported by the United Nations Secretary-General, clearly violates the status of Palestine and infringes on the right of the Palestinian people to self-determination. It also violates a fundamental principle of international law that is the inadmissibility of the acquisition of territory by force. The Court, as the guardian of international law, has the duty to give guidance when international law is violated: as the Court has stressed in its Advisory Opinion on the South Africa in Namibia case of June 1971, on the question of legal consequences, “an illegal situation can not remain without consequences”. The construction of the Wall by Israel entails undesirable consequences if left unchecked.\n\nMr. President, honourable Members of the Court, in conclusion, the Government of the Sudan is of the opinion that:\n\nthe Court is competent and has jurisdiction to grant an advisory opinion on the legal question submitted to it by the United Nations General Assembly, and that there are no compelling reasons preventing it from doing so; and that the construction of the Wall by Israel in the Occupied Palestinian Territory is in contradiction of international law, and that it should comply with the United Nations General Assembly’s resolution ES-10/13 of 21 October 2003 to stop and reverse the construction of the Wall in the Occupied Palestinian Territory including in and around East Jerusalem. It should also be obliged to make adequate reparations for the damages caused by the construction action."
    },
    {
        "voto": 1,
        "juez": "Republic of the Sudan",
        "pregunta": "All States are under an obligation not to recognize the illegal situation resulting from the construction of the wall and not to render aid or assistance in maintaining the situation created by such construction; all States parties to the Fourth Geneva Convention relative to the Protection of Civilian Persons in Time of War of 12 August 1949 have in addition the obligation, while respecting the United Nations Charter and international law, to ensure compliance by Israel with international humanitarian law as embodied in that Convention",
        "texto": "On the applicability of international law on the Israeli action Mr. President, honourable Members of the Court, once the Court ascertains its competence in dealing with the request, then we believe the question of the legal consequences of the construction of the Wall within international law entails the consideration of a number of issues. Our contribution will focus on a limited number of these issues.\n\nThe question of the occupation of Israel of Palestinian and other Arab territories is beyond contention. This is ascertained in relevant United Nations Security Council and United Nations General Assembly resolutions. For example United Nations Security Council resolution 242 of 1967, referred to “territories occupied in the recent conflict”. The Occupied Palestinian Territories terminology has been used in numerous resolutions including the recent United Nations General Assembly resolutions of which ES-10/14 requested the urgent advisory opinion from this Court. The International Committee of the Red Cross in a statement before the conference of High Contracting Parties to the Fourth Geneva Convention, convened in Geneva on 5 December 2001, stated that it has always “affirmed the de jure applicability of the Fourth Geneva Convention to the territories occupied since 1967 by the State of Israel, including East Jerusalem”. The International Committee of the Red Cross further stated:\n\n“the Convention, ratified by Israel in 1951 remains fully applicable and relevant in the current context of violence. As an occupying power, Israel is also bound by other customary rules relating to occupation expressed in the regulations annexed to the Hague Convention respecting the laws and customs of war of 18th October 1907.” The High Contracting Parties have twice affirmed the applicability of the Fourth Geneva Convention on the Occupied Palestinian Territory on 15 July 1999, and on 5 December 2001 in the Geneva special sessions, respectively. United Nations resolution A/58/155 of 15 July 2003 has affirmed the same.\n\nThe Special Rapporteur of the Commission on Human Rights on the Situation of Human Rights in the Palestinian Territories Occupied by Israel  and this is its title  since 1967, report A/57/366 dated 29 August 2002, quoted the United Nations Secretary-General, speaking to the Security Council on 12 March 2002, as calling upon Israel to end its “illegal occupation” of the Palestinian Territory.\n\nAsked why he used the term “illegal”, he replied that the Security Council and the General Assembly have both on various occasions declared aspects of Israeli occupation as illegal. The comments of the Secretary-General  stated the Special Rapporteur  “underscore the fact that it is by the law of occupation that Israel’s conduct must be judged and that many of its practices violate basic principles of that governing law”.\n\nThe applicability of the Convention and other customary rules of international humanitarian law oblige the occupying power to refrain from certain acts that are in violation of them. Common Article I of the Convention obliges the High Contracting Parties to undertake to respect and to ensure respect for the Convention in all circumstances. The construction of the Wall, as stated in resolution ES-10/13, which demanded that Israel stop and reverse its construction; this construction is in contradiction to the relevant provisions of international law. Also, the construction of the Wall and the whole régime of measures relating to the Wall entails confiscation of lands, serious hardship to the occupied population, including displacement, other demographic effects and undue restriction of movement and mobility, as enumerated in the United Nations Secretary-General’s report ES-10/248 of 24 November 2003 pursuant to United Nations General Assembly resolution ES-10/13, and in addition to prejudice to territorial status, all being in violation of international law.\n\nThe Wall also violates international human rights law. It places undue suffering on the occupied Palestinian population and infringes on their basic human rights as stipulated in the two human rights covenants and other relevant instruments, which are blinding on Israel. The Secretary-General’s report clearly establishes this fact. The Court can rely on the Secretary-General’s fact analysis in giving its opinion, as the text of the Assembly’s request makes clear. The Wall will affect the lives of some 17,000 Palestinians in the West Bank and 220,000 in East Jerusalem. As the Secretary-General put it, “Palestinians will live in enclaves, areas where the Barrier almost completely encircles communities and tracts of land. The planned route incorporates nearly 320,000 settlers, including approximately 178,000 in Occupied East Jerusalem.”\n\nThe humanitarian and socio-economic impact was further illuminated by the Secretary-General’s report. “Recent reports by the World Bank and the United Nations show that construction has dramatically increased such damage in communities along its route, primarily through the loss, or severely limited access to land, jobs, and markets.”\n\nThe Wall, as the report informs, restricts movement of the population, isolated towns, affected health services, curtailed agricultural output and increased food insecurity in the region, all in violation of human rights law."
    }
]


