[
    {
        "voto": 1,
        "juez": "Belize",
        "pregunta": "The construction of the wall being built by Israel, the occupying Power, in the Occupied Palestinian Territory, including in and around East Jerusalem, and its associated régime, are contrary to international law",
        "texto": "President, Members of the Court, the Palestinian people have an inalienable right to self-determination and complete independence, which has always been systematically denied to them.\n\nThe League of Nations Mandate territories had a right to independence which was realized for all of them — except for Palestine.\n\nThe United Nations Charter enshrined the right to self-determination for the protection of all peoples except, in practice, for the Palestinians, more than half of whom were massacred or driven off their land in the 1948 Nakba. Their land was partitioned and half of it allocated to a new State that promptly extended it to 78 per cent by brute force.\n\nIn 1967, just seven years after resolution 1514, Israel commenced its still-continuing occupation of the entirety of the remaining Palestinian territory.\n\nSince then, Israel has, through its systematic manipulation of negotiations to undermine the presumed objectives, ensured that the Palestinian people are prevented from ever exercising that right.\n\nIsrael cannot be permitted to continue flouting one of the most fundamental principles of international law with impunity. Impunity breeds inhumanity.\n\nThe right of the Palestinian people to self-determination is violated in many ways. I will focus on three.\n\nFirst, the exclusion of Palestinians from any part of the Palestinian territory denies their right to territorial integrity, which is an essential part of the right to self-determination. The Palestinian people have a right to self-determination within the entirety of their territory.\n\nYet Israel has systematically removed and excluded Palestinians from parts of their territory. It has separated Gaza from the West Bank and prevented the free movement of Palestinians within the Palestinian territory. It has prohibited the return of Palestinians to their homes and property and established exclusionary illegal settlements in the West Bank, including East Jerusalem.\n\nThis is especially egregious because many of these almost 700,000 State-supported settlers are continuously terrorizing and forcibly displacing Palestinians from even more of their territory and engaging in pogroms against them.\n\nSecond, Israel denies the existence of Palestinians as a people. The Israeli Minister of Finance, himself an illegal settler, has stated that “there’s no such thing as a Palestinian people”. Senior Israeli leaders routinely deny that the Palestinian people have a right to self-determination. Moreover, the case brought by South Africa which Belize fully supports lays bare the fact that Israel’s genocidal campaign in Gaza also denies the right of Palestinians to exist at all.\n\nOne key tactic in this regard is Israel’s deliberate use of starvation to destroy the civilian population of Gaza. Gaza’s entire population of more than two million people is in crisis, facing the “worst levels of acute food insecurity”. By December 2023, the famine threshold had already been exceeded and the situation was deteriorating rapidly. This famine is not an accident. Indeed, senior Israeli officials have already clearly stated their intent to deprive civilians in Gaza of food and water.\n\nIn its planned erasure of the Palestinian people, Israel is also destroying Palestinian cultural, educational and historical institutions in Gaza. Almost 400 schools and every single university have been partially or fully destroyed, including one which was used as a base and interrogation centre by Israeli forces for months before they pillaged it and then detonated it. The intention is to erase all traces of Palestinian life and culture, to destroy the very essence of what makes the Palestinians a “people”. The message is clear: the total culture of Palestine must be destroyed and they must have no future in Gaza.\n\nThird, Israel is using forcible action to deprive the Palestinian people of their right to self-determination, freedom and complete independence. This includes the right of the Palestinian people “freely to determine, without external interference, their political status and to pursue their economic, social and cultural development”. Israel’s forcible action that denies the right to self-determination consists of institutional, coercive policies and practices that exert authority over and oppress the Palestinian people. These include: the complete control exercised over Palestinian natural and economic resources; the institutionalized and racist apartheid and the systematic and excessive use of force, arbitrary killing and mass incarceration of Palestinians, including children.\n\nIt also includes action taken by Israel to deny Palestinian political participation by criminalizing political speech and membership of, or connection with, Palestinian political parties.\n\nAs the United Nations rightly says, by depriving Palestinians of their fundamental rights, Israel has taken away their “agency and ability to unite, self-govern and develop as a polity”.\n\nThe consequence of this breach is that Israel must immediately, unconditionally and totally withdraw from all of the Palestinian territory.\n\nIsrael is determined to ensure that the Palestinian people do not now and do not ever exercise their right to self-determination. Israel considers itself an exception. No State reserves to itself the right to systematically violate the right of a people to self-determination  except Israel. No State seeks to justify the indefinite occupation of another’s territory except Israel. No State commits annexation and apartheid with impunity except, it seems, Israel.\n\nBut Israel must not be allowed such blatant impunity. It must not be allowed to continue to inflict scars for generations to come on those that survive this holocaust. Israel must be made to behave like all civilized nations, stop violating international law and United Nations resolutions, and respect the right of the Palestinian people to self-determination.\n\nPalestine must be free."
    },
    {
        "voto": 1,
        "juez": "Belize",
        "pregunta": "Israel is under an obligation to terminate its breaches of international law; it is under an obligation to cease forthwith the works of construction of the wall being built in the Occupied Palestinian Territory, including in and around East Jerusalem, to dismantle forthwith the structure therein situated, and to repeal or render ineffective forthwith all legislative and regulatory acts relating thereto, in accordance with paragraph 151 of this Opinion",
        "texto": "Mr President, Members of the Court, apartheid is “the strongest concentration of racist concepts put into action”. It goes hand-in-hand with Israel’s violation of the right to self-determination. It is impossible to realize a people’s right to self-determination within an “institutionalised regime of systematic racial oppression and discrimination”. The dehumanizing nature of apartheid suppresses the equality, identity and dignity at the heart of self-determination.\n\nThe existence of apartheid is relevant to the first question before the Court, which asks about the “legal consequences arising from the ongoing violation by Israel of the right of the Palestinian people to self-determination... and from its adoption of related discriminatory legislation and measures”. Although the Court can opine on discrimination falling short of apartheid, there are significant and different legal consequences resulting from the breach of the prohibition of apartheid that arises on the facts before the Court.\n\nI will address the definition and scope of apartheid; apply the definitional elements to the facts; and set out the legal consequences.\n\nThe Apartheid Convention’s definition reflects custom and has the same content as the term “apartheid” in Article 3 of CERD. The prohibition of apartheid is not limited to southern Africa or commission by a particular State.\n\nThe prohibition also applies beyond a State’s territory. Article 3 of CERD refers to “territories under [a State’s] jurisdiction”, which includes situations of occupation. The CERD Committee has determined that Article 3 applies to the “Palestinian population in Israel... and in the Occupied Palestinian Territory”.\n\nFirst, it is indisputable that the Palestinians are a “racial group” for the purposes of CERD and custom. Under Israeli law, the separate identity of the Jewish race is afforded a privileged status and the right to exercise self-determination in the State of Israel is “exclusive to the Jewish people”. Jewish Israelis and Palestinians are perceived by themselves and by external actors as different racial groups.\n\nSecond, Israel’s deployment of a combination of measures across the Palestinian territory, and against the Palestinian people, falls within Article II of the Apartheid Convention. Israel has long-standing discriminatory laws, policies and practices that affect only Palestinians and are designed to benefit exclusively, and maintain the dominance of, Israeli Jews, on both sides of the Green Line. Moreover, many measures are designed to fragment the Palestinian people as a group, and to separate Palestinians from Israeli Jews. This is what Namibia rightly calls “strategic fragmentation.\n\nSuch measures have been set out in Belize’s Written Statement. Here, I emphasize two points. First, in the West Bank, there is the separation wall, restrictive permit requirements, checkpoints and segregated roads. This creates what the Israeli army officially calls “sterilization” areas and roads closed to Palestinians. “Hebronization” meaning the strategies of repression and segregation is spreading.\n\nSecond, Gaza is under siege and blockade. Millions of Palestinians are confined to ever-smaller strips of land the longest and most complete siege of the greatest number in modern history. The whole of Gaza has become an impoverished, desperate ghetto.\n\nSince 1967, Israel has detained one million Palestinians, including tens of thousands of children.\n\nIsrael’s conduct against the Palestinian people has been characterized as apartheid by United Nations Special Procedures since 2007, including a joint statement of 47 mandate holders in 2020.\n\nTurning to the third element of apartheid: intent. Israel’s measures are imposed “for the purpose” of establishing and maintaining dominance and systematic oppression. This can be inferred from their scale and institutionalized nature, and from the differing effects they have on the Palestinian and Israeli peoples as regards access to basic services and rights protection. It is also directly evidenced by Israeli laws that affirm Jewish supremacy as a “national value”. Intent is heard in the hate speech of Israeli public officials, and political and religious leaders. The Court has ordered Israel to “take all measures within its power to prevent and punish the direct and public incitement to commit genocide in relation to members of the Palestinian group in... Gaza”. Intent is also evidenced by Israel’s suppression of dissent against the system of apartheid.\n\nIndoctrination starts in the classroom. The CERD Committee has expressed concern at the “tide of racist hate speech... in school curricula and textbooks”. The Committee on the Rights of the Child has pointed to “the extensive militarization of the educational system”, which is entrenched during compulsory military service. Israel’s State Comptroller has criticized the Government for “doing very little to purge the severe phenomena of racism and hatred among youth and to promote a shared society”.\n\nIf the requisite intent is established, any claimed security rationale cannot displace the conclusion that Israel’s conduct falls within Article II.\n\nIn the light of these violations of self-determination and the prohibition of apartheid, Belize requests the Court to formulate precisely what Israel and third States must do. Specific consequences facilitate accountability.\n\nBelize refers to the written pleadings that detail such consequences. The core consequence of the violation of the jus cogens right to self-determination and the prohibition of apartheid is immediate cessation; Israel must dismantle the physical, legal and policy régime of discrimination and oppression, including freeing political prisoners; evacuate Israeli settlers from Palestinian territories; permit Palestinians to return to their country and property; and lift the siege and blockade of Gaza. These consequences, taken collectively, mean that Israel must immediately, unconditionally and totally withdraw from the entire Palestinian territory. This legal consequence applies irrespective of the outcome of the Court’s consideration of occupation and annexation. Israel must also make full reparation for the damage suffered as a result of its violations.\n\nUnlawful occupation. On occupation, Belize makes three points. The first is that Israel is currently occupying all of the Palestinian territory. Secondly, the rules of international law applicable to determine whether the existence of that occupation is lawful are the rules on the use of force, the jus ad bellum. Thirdly, when those rules are applied to this occupation, it is evident that the occupation is neither necessary nor proportionate and is thus unlawful.\n\nIsrael is currently occupying all of the Palestinian territory.\n\nOn the first, Belize will concentrate today on Israel being in occupation of Gaza. That was the case before October last year and remains the case.\n\nIn July last year, Belize submitted that a State could be in occupation of territory even if it no longer has soldiers in it, if that State could “at any time they desired assume physical control of” the territory and had “the capacity to send troops within a reasonable time to make the authority of the occupying power felt”. That was a tragically prescient submission. Israel has since 7 October certainly made its power felt, and not just in the form of responding to the attack on it. Its recent conduct is a continuation and intensification of its long-term control over, violence against and incursions into Gaza. Israel controls who and what enters and leaves Gaza, including by air and sea, as well as the supply of water and energy. Gaza is under Israeli occupation and has been since 1967.\n\nJus ad bellum as the applicable law.\n\nI turn then to the rules applicable to determining whether Israel’s ongoing occupation of the Palestinian territory as a whole is lawful.\n\nThe position of the United States is that the jus ad bellum determines the lawfulness of territory becoming occupied, but not of its remaining occupied. On that approach, an occupying Power that has lawfully established an occupation would be unrestrained by law as to how long that occupation lasts. It would be restrained by the jus in bello as to how it conducts the occupation, but it would be under no legal restraint concerning the duration of the occupation. That would of course mean that an occupation could lawfully become indefinite, and that must be incorrect.\n\nThe correct position is that whether the existence of an occupation is lawful, either at the time of its commencement or as it continues, is determined by the jus ad bellum. That follows from the fact that an occupation is a use of force. Even if a use of force is initially necessary and proportionate, once either of those two conditions ceases to be met, the continuing use of force will become unlawful. That applies as much to occupations as it does to any other use of force.\n\nIsrael’s occupation of Palestinian territory is unlawful.\n\nApplying the rules on the use of force to this case, Israel’s occupation of Palestinian territory in June 1967 has been unlawful from its inception.\n\nIn any event, Israel’s occupation is certainly not now necessary or proportionate. If the occupation was ever lawful, it was part of Israel’s use of force against Egypt and Jordan in 1967. Israel signed a peace treaty with Egypt in 1979 and so its occupation of Gaza has been unlawful since at least that time. Israel signed a peace treaty with Jordan in 1994 and so its occupation of the West Bank has been unlawful at least since then.\n\nGuatemala has nonetheless argued in these proceedings that, in light of the events of 7 October, Israel should not be required to cease its presence in Gaza or the West Bank.\n\nConcerning the West Bank, including East Jerusalem, on no conceivable basis could it credibly be said that Israel’s continuing occupation of the West Bank is a necessary or proportionate response to the recent attack by Hamas from Gaza.\n\nConcerning Gaza, Israel’s use of overwhelming force including its ongoing occupation of Gaza is plainly not a necessary or proportionate response to the October attack.\n\nIn enforcing its occupation, Israel is committing breaches of international humanitarian law, in both Gaza and the West Bank. They are not, however, the breaches that lead to the most important consequences in this case. The fundamental issue, from which the most important consequences follow, is that it is unlawful for Israel to be exercising any control at all in respect of Palestinian territory.\n\nThat brings us to annexation.\n\nWhether a State has unlawfully annexed territory depends on two things: first, whether the State has physically seized the territory, and second, whether it has an intention to make the territory its own.\n\nThe requisite intention can be evidenced by a formal declaration of annexation, but it can also exist implicitly if the State has “clearly manifested its intention to hold the... territory permanently under its dominion”. That is what the Court has described as “de facto annexation”.\n\nIn one form or another, Israel has annexed all of the Palestinian territory. This is clear from the map you have seen used by the Prime Minister of Israel before the General Assembly last September that showed the West Bank and Gaza as part of Israel.\n\nFor East Jerusalem, the position is the most straightforward, since Israel has formally annexed it under Israeli law.\n\nFor the remainder of the West Bank, it is hardly less obvious.\n\nIsrael has occupied the entirety of the West Bank for 57 years with no plan for withdrawal or acknowledgement of any need or intention to ever withdraw.\n\nOn the contrary, it has an increasingly active programme of settling hundreds of thousands of Israelis in hundreds of settlements in the West Bank. These are permanent settlements on land that Israel is treating as its own.\n\nIsraeli officials thus speak of all of the West Bank as land over which Israel is sovereign.\n\nThese statements are matched by Israel’s transfer of administrative powers relating to the entirety of the West Bank from its military to its civilian authorities. That is a clear manifestation of the progression from occupation to annexation.\n\nAll of this is in the context of Israel refusing to recognize the existence of the Palestinian people as a people, or their right to self-determination and Statehood.\n\nThese circumstances have led United Nations bodies and special procedures correctly to conclude that Israel is responsible for de facto annexation of the entire West Bank, and not only of the part of it that the Oslo Accords label Area C. Area C constitutes more than 60 per cent of the West Bank and as the Court has seen from the fourth map that Palestine’s Foreign Minister displayed, it is clear that Areas A and B comprise a collection of isolated enclaves that are not viable without Area C.\n\nConsequences for Israel\n\nTurning to the heart of the questions posed to the Court, which is legal consequences, Israel’s occupation and annexation of Palestinian territory are continuing wrongful acts. Israel is thus under an obligation to cease those acts.\n\nWhether in respect of occupation or annexation, the conduct that constitutes a breach of the prohibition of the use of force is Israel’s presence in or exercise of effective control over Palestinian territory.\n\nTo cease that wrongful conduct, Israel must entirely withdraw from Palestinian territory. That includes withdrawing its civilian population from the West Bank, ceasing the construction and expansion of settlements there, and dismantling existing settlements.\n\nIt must also repeal or render ineffective all legislative and regulatory acts, policies and practices that contribute to its exercise of effective control over Palestinian territory.\n\nThe Court could also usefully indicate that the establishment of settlements has had no legal effect and does not give Israel any rights in respect of the land on which they are located.\n\nAs to the important question of timing, the Court has previously recognized that the obligation of cessation requires immediate action.\n\nIn the Wall Advisory Opinion, the Court drew attention to the need for efforts to initiate negotiations. Israel interprets this to mean that it can remain in Palestinian territory until a negotiated solution to the entire conflict is reached. Belize’s Written Comments are devoted to explaining why that is incorrect. The core difficulty is that Israel is not entitled to remain in breach of peremptory norms pending a negotiated solution. It is therefore crucial that the Court specify that Israel is required to withdraw from the Palestinian territory immediately, unconditionally and totally."
    },
    {
        "voto": 1,
        "juez": "Belize",
        "pregunta": "All States are under an obligation not to recognize the illegal situation resulting from the construction of the wall and not to render aid or assistance in maintaining the situation created by such construction; all States parties to the Fourth Geneva Convention relative to the Protection of Civilian Persons in Time of War of 12 August 1949 have in addition the obligation, while respecting the United Nations Charter and international law, to ensure compliance by Israel with international humanitarian law as embodied in that Convention",
        "texto": "As for States other than Israel, they are under a positive “obligation to recognize the illegality” of Israel’s continued presence in and control over the Palestinian territory.\n\nStates also have duties not to assist Israel to maintain a situation that is in breach of peremptory norms and to regulate private actors to ensure that their conduct does not support Israel’s illegal practices. Fulfilment of those duties includes weapons and their components not being provided to Israel in the knowledge that they will likely be used to perpetuate its control over Palestinian territory."
    }
]

