[
    {
        "voto": 1,
        "juez": "Gambia",
        "pregunta": "The construction of the wall being built by Israel, the occupying Power, in the Occupied Palestinian Territory, including in and around East Jerusalem, and its associated régime, are contrary to international law",
        "texto": "As the Court knows quite well, the international system is based on certain fundamental principles of law, which include peremptory norms of international law, or jus cogens norms. Adherence to these norms is not subject to derogation and compliance with them is owed erga omnes — to the international community as a whole. Some of the recognized jus cogens norms include the prohibition of aggression, the prohibition of genocide, the prohibition of apartheid and the right to self-determination.\n\nIf a particular action of a State violates one or more jus cogens norms, that action is illegal under international law. Any State may invoke the responsibility of that State for such a violation and seek an immediate end to it.\n\nThis is, fundamentally, the situation regarding Israel’s occupation in the Palestinian territories. The international community, collectively over many years, has found Israel’s occupation of the Palestinian territories to be illegal, among other reasons, on account of its violation of multiple jus cogens norms. And collectively we have invoked Israel’s responsibility in that regard to end the occupation.\n\nMr President, at least one State in the course of these proceedings has suggested that an occupation under international law cannot be illegal under any circumstances. This argument posits that “an occupation exists, therefore it is legal”. The proposition is unfounded in international law and fails for several reasons.\n\nFirst, this argument confuses jus in bello, and completely ignores the jus ad bellum. As the Court is well aware, international humanitarian law, and the jus in bello, is the body of law that governs the ways in which warfare can be conducted. It includes within it the law of occupation, a body of rules regulating the conduct of an occupying Power. It is, indeed, true that the obligations under jus in bello as they relate to an occupation persist throughout the pendency of that occupation.\n\nBut separate from jus in bello is the jus ad bellum, or the conditions under which States may resort to armed force. It is the jus ad bellum that addresses the legality of a use of force, including an occupation, which is maintained by the ongoing use of force. Article 2 (4) of the United Nations Charter prohibits the threat or use of force in any “manner inconsistent with the Purposes of the United Nations”. The only exceptions to this prohibition are the very narrow circumstances of the force authorized by the United Nations Security Council or self-defence under Article 51 of the Charter. Any use of force outside of these narrow exceptions — i.e. any annexation or occupation of territory arising from an act of aggression or otherwise unlawful use of force — is illegal. Any use of force that is unnecessary or disproportionate to the threat against which it is exercised is also illegal under jus ad bellum.\n\nSecond, the proposition that “an occupation exists, therefore it is legal” also ignores the existence and implications of jus cogens norms going beyond the jus ad bellum. If an occupation inherently violates one or more jus cogens norms, then it is illegal as a whole and the occupying Power’s responsibility for that violation can be invoked in order to bring the violation to an end. The occupying Power’s ongoing obligations under international humanitarian law do not, and cannot, preclude the wrongfulness of jus cogens violations inherent in the occupation itself.\n\nFor example, the argument that occupations are inherently legal, if adopted, would directly conflict with and undermine the prohibition on the annexation of territory. Any State that wanted to de facto annex a territory could do so by indefinitely occupying that territory but not formally incorporating it within its borders. It is the same with the jus cogens norms of the rights of self-determination. Simply put, flagrant violations of international law cannot be brushed aside by the fig leaf of occupation.\n\nFinally, the thesis that “an occupation exists, therefore it is legal” also ignores the fact that the Court has determined occupations to be unlawful in the past. As discussed in The Gambia’s Written Statement, this was the case regarding South Africa’s occupation of Namibia without title and regarding Uganda’s occupation of the Congolese province of Ituri. The United Nations Security Council and the General Assembly have characterized occupations resulting from unlawful uses of force to be illegal as well.\n\nIn sum, a belligerent occupation can be illegal per se if it violates the jus ad bellum and other jus cogens norms."
    },
    {
        "voto": 1,
        "juez": "Gambia",
        "pregunta": "Israel is under an obligation to terminate its breaches of international law; it is under an obligation to cease forthwith the works of construction of the wall being built in the Occupied Palestinian Territory, including in and around East Jerusalem, to dismantle forthwith the structure therein situated, and to repeal or render ineffective forthwith all legislative and regulatory acts relating thereto, in accordance with paragraph 151 of this Opinion",
        "texto": "Mr President, Members of the Court, The Gambia will highlight three reasons why Israel’s prolonged occupation of the Palestinian territories is illegal. All three of these reasons — the right of self-determination, the prohibition on apartheid and the jus ad bellum — reflect obligations rooted in jus cogens norms. This conclusion of illegality is shared by a substantial majority of the Participants in these proceedings, many for the same reasons as The Gambia.\n\nThe right to self-determination\n\nFirst, Israel’s occupation violates the right of the Palestinian people to self-determination and is therefore illegal. The erga omnes right of self-determination is “one of the essential principles of contemporary international law”, a jus cogens norm enshrined in the United Nations Charter.\n\nThe Court has before it extensive and uncontested fact-finding by multiple United Nations mandate holders, including the Independent International Commission of Inquiry on the Occupied Palestinian Territory and the many reports of the Special Rapporteur on the situation of human rights in the Palestinian territories occupied since 1967. These reports have been produced by independent United Nations mandate holders who engaged in extensive fact-finding utilizing multiple sources of evidence. The Court should accept these reports as conclusive and convincing evidence of Israel’s long-standing, ongoing and indefinite infringement on the right of self-determination for the Palestinian people.\n\nIndeed, there is no end in sight to Israel’s occupation. Already extending over 56 years, Israel’s current leadership boasts with pride its long-standing efforts to prevent the creation of an independent Palestinian State. As reported by the United Nations Special Rapporteur, Israel’s “occupation violates Palestinians’ ability to organize themselves as a people, free from alien domination and control”.\n\nNo derogation is permitted from respecting the right of the Palestinian people to self-determination. There is no escaping the conclusion that Israel’s occupation is illegal for violating the right of the Palestinian people to self-determination and that it must expeditiously be brought to an end.\n\nThe prohibition on apartheid\n\nSecond, Israel’s ongoing occupation of the Palestinian territories is also illegal because it amounts to a régime of apartheid, the prohibition of which is a peremptory norm of international law. This Court has described apartheid as a “flagrant violation of the purposes and principles of the Charter”.\n\nOnce again, the Court has before it extensive, credible and independent fact-finding demonstrating conclusively that Israel has imposed an apartheid reality in the Palestinian territories. This is clear in the reporting of the United Nations Special Rapporteur, who concluded that “Israel has imposed upon Palestine an apartheid reality in a post-apartheid world”. This is also reflected in the findings of the Committee on the Elimination of Racial Discrimination.\n\nSenior international leaders, like Ban Ki-moon, Desmond Tutu and former Israeli officials, including a former Attorney General, a former director of Israel’s Intelligence Service, Shin Bet, and a former Ambassador of Israel to South Africa, have also concluded that Israel’s occupation constitutes a régime of apartheid.\n\nThe most credible non-governmental human rights organizations that report on the situation in the Occupied Palestinian Territory have also concluded that the occupation is, in fact and in law, an apartheid régime.\n\nA sober review of the uncontroverted evidence convincingly shows that the occupation is a régime of apartheid. As such, Israel’s occupation of the Palestinian territories is illegal and must urgently be brought to an end.\n\nThe jus ad bellum\n\nThird, Israel’s 56-year occupation of Palestinian territories violates the laws on the use of force — jus ad bellum — and is illegal for that reason as well.\n\nAs discussed earlier, the prohibition on the threat and use of force is a jus cogens norm. Even when resort to force is justified by self-defence in response to an armed attack, the particular force used may still be illegal if it is unnecessary or disproportionate to the threat against which it is exercised.\n\nIsrael launched the June 1967 war that led to its occupation of the Palestinian Territory. After its surprise attack initiating the war, Israel occupied all remaining Palestinian territory in the West Bank, including East Jerusalem, the Gaza Strip, as well as Syria’s Golan Heights and Egypt’s Sinai Peninsula, “effectively tripling the size of territory under [its] control”. Since this use of force was not taken in response to an armed attack and was not necessary or proportionate even if it had been, the occupation was a flagrant violation of the laws of the use of force from the onset.\n\nFurthermore, even if the occupation of the Palestinian territories were lawful at one time, its continuation for more than five decades means that it could not possibly still be lawful today. First, the use of force in self-defence is only justified “within the strict confines” laid down in Article 51 of the Charter and “does not allow the use of force by a State to protect perceived security interests beyond [those] parameters”. As such, “essentially preventative” uses of force are beyond the scope of Article 51.\n\nSecond, as clarified in the Wall Advisory Opinion, Article 51 does not apply to situations involving conduct taken in response to purported threats emanating from within occupied territory. Israel therefore cannot justify its occupation as a response to illegal threats emanating from within the Occupied Palestinian Territory itself.\n\nIsrael’s ongoing occupation of the Palestinian territories also violates the jus ad bellum because its maintenance is unnecessary and disproportionate. It is simply not possible that it has been necessary for Israel to maintain its occupation since 1967 — for over 56 years. Moreover, Israel also cannot possibly justify its settlements upon and annexation of occupied territory as a necessary response to any perceived threat — not to mention the myriad of rights violations that are intrinsic to the occupation. By settling and annexing occupied territory, Israel has acted unnecessarily in using force.\n\nIsrael’s prolonged occupation is also wholly disproportionate to any legitimate aim. Israel’s occupation of the entirety of the Palestinian territories “long after the period in which any presumed armed attack... could reasonably be contemplated” makes it even more disproportionate now. And the manner in which the occupation has been conducted — including the establishment of an apartheid régime — renders the occupation disproportionate as well. In sum, Israel’s decades-long occupation violates the jus ad bellum and is therefore illegal."
    },
    {
        "voto": 1,
        "juez": "Gambia",
        "pregunta": "All States are under an obligation not to recognize the illegal situation resulting from the construction of the wall and not to render aid or assistance in maintaining the situation created by such construction; all States parties to the Fourth Geneva Convention relative to the Protection of Civilian Persons in Time of War of 12 August 1949 have in addition the obligation, while respecting the United Nations Charter and international law, to ensure compliance by Israel with international humanitarian law as embodied in that Convention",
        "texto": "THE COURT SHOULD DECLARE THAT ISRAEL’S OCCUPATION IS ILLEGAL AND MUST BE BROUGHT TO AN END\n\nMr President, Members of the Court, in the almost twenty years since the Wall Advisory Opinion, Israel has only deepened the occupation. Israel has annexed more territory and expanded its illegal settlements. It has further fragmented the Palestinian territory. In Gaza, Israel has decimated the territory and the Palestinian population there. In the territories overall, Israel has entrenched an apartheid régime. The Palestinian people continue to be deprived of their right to self-determination, indefinitely. And all the while, there is no justification under international law for Israel’s continued use of force to maintain the occupation — if there ever was one to begin with.\n\nMr President, Members of the Court, I remind us of the fundamental goals of the United Nations that I recited at the beginning of my remarks. If we are to ever achieve any of those goals in regard to the Palestinian people, then this Court must play its role in robustly answering the questions posed by the General Assembly.\n\nAs to the second question posed, The Gambia submits that the Court should find that Israel’s occupation of the Palestinian territories is illegal per se for all of the reasons discussed. And The Gambia further submits that the Court should find that Israel, all other States and the United Nations are under an obligation to bring about an end to Israel’s occupation immediately, or at least as rapidly as possible."
    }
]

