[
    {
        "voto": 1,
        "juez": "Libyan",
        "pregunta": "Finds that it has jurisdiction to give the advisory opinion requested",
        "texto": "We can start from the first point, the jurisdiction of the Court. As you know, Mr. President, Members of the Court, that Article 96, paragraph 1, of the United Nations Charter provides that “[t]he General Assembly or the Security Council may request the International Court of Justice to give an advisory opinion on any legal question”. On the other side, Article 65, paragraph 1, of the Court’s Statute further stipulates: “The Court may give an advisory opinion on any legal question at the request of whatever body may be authorized by or in accordance with the Charter of the United Nations to make such a request.” /n/nThese two provisions are, according to our view, sufficient to establish the competence of the General Assembly to request the advisory opinion from the Court, and the jurisdiction of the Court to give the requested opinion."
    },
    {
        "voto": 1,
        "juez": "Libyan",
        "pregunta":"The construction of the wall being built by Israel, the occupying Power, in the Occupied Palestinian Territory, including in and around East Jerusalem, and its associated régime, are contrary to international law",
        "texto": "It is, as you know, settled that the 1949 Geneva Convention relative to the Protection of Civilian Persons in Time of War applies to the Occupied Palestinian Territory, as noted by the Court in the Wall Opinion. In addition to that, the 1907 Hague Regulations “have become part of customary law” and therefore apply to the Occupied Palestinian Territory. Despite the Israeli argument that the Fourth Geneva Convention does not apply de jure to the Occupied Palestinian Territory, the Court found as a matter of treaty law, that it does indeed apply, as it would to “any occupied territory in the event of an armed conflict arising between two or more High Contracting Parties”. /n/nIn 2001, the Conference of High Contracting Parties “reaffirm[ed]” the applicability of the Fourth Geneva Convention in the Occupied Palestinian Territory, including East Jerusalem, Al Quds, and called, inter alia, upon “the Occupying Power to immediately refrain from committing grave breaches involving any of the acts mentioned in art. 147 of the Fourth Geneva Convention, such as wilful killing, torture, unlawful deportation, wilful depriving of the rights of fair and regular trial, extensive destruction and appropriation of property not justified by military necessity”. /n/nA variety of international human rights treaties apply to these proceedings. Among the most important of these are the International Covenant on Civil and Political Rights (ICCPR), the International Covenant on Economic, Social and Cultural Rights (ICESCR), the International Convention on the Elimination of all Forms of Racial Discrimination (CERD), the International Convention on the Elimination of all Forms of Discrimination against Women (CEDAW), the Convention on the Rights of the Child (CRC), and the Convention Against Torture and Other Cruel, Inhuman or Degrading Treatment or Punishment (CAT). Both States, Palestine and the occupying force, are parties to these treaties. /n/nThe prohibition against the threat or use of force against the territorial integrity or political independence of another State is enshrined in Article 2 (4) of the United Nations Charter and is an essential cornerstone of the international legal order. /n/nArticle 2 (4) provides: “All Members shall refrain in their international relations from the threat or use of force against the territorial integrity or political independence of any State, or in any other manner inconsistent with the purposes of the United Nations.” /n/nThe prohibition of racial discrimination and apartheid is reflected most in CERD. As the Court has very recently underlined that 182 States are parties to CERD  a fact which confirms the universal character of the convention. Those parties include both the State of Palestine and the occupying force. /n/nIt is well established that the prohibition of racial discrimination forms part of customary law and has long been recognized as a peremptory norm. The Court in Barcelona Traction considered the prohibition of racial discrimination to be a norm of erga omnes character, stating that: /n/n“Such obligations derive, for example, in contemporary international law, from the outlawing of acts of aggression, and of genocide, as also from the principles and rules concerning the basic rights of the human person, including protection from slavery and racial discrimination.” /n/nThe right of self-determination exists in customary international law and is recognized by the United Nations Charter as well as in the ICCPR and ICESCR. /n/nIt must be also stated that the obligation to respect a people’s right of self-determination is a peremptory principle of general international law. As the Court noted in the East Timor case, the right to self-determination “is one of the essential principles of contemporary international law”, enjoying an erga omnes character. /n/nThe United Nations General Assembly has repeatedly confirmed the right of Palestinian people to self-determination, for example, resolution 2672 of 8 December 1970. It recognized “that the people of Palestine are entitled to equal rights and self-determination, in accordance with the Charter of the United Nations” and that “full respect for the inalienable rights of the people of Palestine is an indispensable element in the establishment of a just and lasting peace in the Middle East”. /n/nMr President, Members of the Court, now we come to the illegality of the Israeli occupation of the Palestinian territory. The Israeli six-decade occupation of Palestinian territory is a continuing, gross and systematic breach of its legal obligations under the United Nations Charter and the general international law, also international humanitarian law, international human rights law and customary international law, including the violation of at least three peremptory norms of general international law of a jus cogens and erga omnes character. It shows that Israel has annexed and plans to continue to annex Jerusalem, Al-Quds, and the rest of the West Bank; that it has imposed systematic and comprehensive racial discrimination tantamount to apartheid against the Palestinian people based on their race; and that it has denied their right to self-determination in their own land. /n/nIn view of these policies and practices, Israel’s occupation of the Occupied Palestinian Territory is unlawful, rendering Israel’s continued presence in the Occupied Palestinian Territory an internationally wrongful act as it seriously breaches at least three peremptory norms of general international law, derogation from which is not permitted. /n/nOn the matter of self-determination, Israel has not only denied the right of the Palestinian people to self-determination, but actively tried to suppress and to extinguish it, even after the Court’s ruling in 2004 that Israel has an obligation erga omnes to respect the right of the Palestinian people to self-determination. Israel has in fact escalated its policies and practices with the specific intention of permanently precluding the exercise of the right of Palestinian people including their right to independence in their State"
    },
    {
        "voto": 1,
        "juez": "Libyan",
        "pregunta": "Israel is under an obligation to terminate its breaches of international law; it is under an obligation to cease forthwith the works of construction of the wall being built in the Occupied Palestinian Territory, including in and around East Jerusalem, to dismantle forthwith the structure therein situated, and to repeal or render ineffective forthwith all legislative and regulatory acts relating thereto, in accordance with paragraph 151 of this Opinion",
        "texto": "As a consequence, Israel’s prolonged six-decade occupation of the Occupied Palestinian Territory is in clear violation of peremptory norms of general international law, derogation from which is not permitted, and the occupation itself must be regarded as illegal, with all relevant legal consequences that attach under the law of international responsibility. This means that it must be brought to an immediate, unconditional and total end. /n/nNow, Mr President, Members of the Court, we come to the consequences. We start by legal consequences on the occupying Power. The occupying Power, or Israel, must fulfil its obligation to respect the Palestinian people’s right to self-determination. /n/nIsrael must immediately end the violation of the international obligation to respect the right of the Palestinian people to self-determination by ceasing all acts and measures that prevent and impede the Palestinian people from exercising their right to self-determination, including the immediate cessation of the occupation in all its manifestations. /n/nThe obligation of the State responsible for an act contrary to the international law to bring that act to an end is firmly established in general and international law. Accordingly, Israel is obligated to immediately cease all violations of the legal obligations in Jerusalem and the occupied Palestinian territories as a whole. /n/nThe cessation of these violations includes, inter alia, the dismantling of the illegal structures, including the settlements and the wall."
    },
    {
        "voto": 1,
        "juez": "Libyan",
        "pregunta": "Israel is under an obligation to make reparation for al1 damage caused by the construction of the wall in the Occupied Palestinian Territory,including in and around East Jerusalem",
        "texto": "Israel shall be obligated to make restitution and compensation for the damage suffered by the Palestinian people. And Israel is obligated to immediately repeal all its laws that aims to racial segregation and discrimination enshrining in the apartheid régime imposed against the Palestinian people."
    },
    {
        "voto": 1,
        "juez": "Libyan",
        "pregunta": "All States are under an obligation not to recognize the illegal situation resulting from the construction of the wall and not to render aid or assistance in maintaining the situation created by such construction; all States parties to the Fourth Geneva Convention relative to the Protection of Civilian Persons in Time of War of 12 August 1949 have in addition the obligation, while respecting the United Nations Charter and international law, to ensure compliance by Israel with international humanitarian law as embodied in that Convention",
        "texto": "Given the erga omnes nature of the right to self-determination in accordance with the standing resolutions of the United Nations General Assembly, it is also incumbent upon all States to ensure that any impediment to the exercise of the right of self-determination by the Palestinian people is brought to an immediate end. /n/nIn view of the nature and importance of the rights and obligations involved, all States have an obligation not to recognize the illegal situation resulting from Israeli violations in the occupied Palestinian territories, including Jerusalem. They are also obliged not to provide aid or assistance in maintaining the situation created by these illegal acts. /n/nFurthermore, the States parties to the Fourth Geneva Convention are obliged, to ensure that Israel complies with international humanitarian law as enshrined in that Convention, including the forcible transfer of Palestinians and the transfer of Israeli citizens to the Occupied Palestinian Territory."
    },
    {
        "voto": 1,
        "juez": "Libyan",
        "pregunta": "The United Nations, and especially the General Assembly and the Security Council, should consider what further action is required to bring to an end the illegal situation resulting from the construction of the wall and the associated régime, taking due account of the present Advisory Opinion",
        "texto": "The United Nations, and in particular the General Assembly and the Security Council, should consider what further measures are necessary to remove without delay any obstacle to the realization of the Palestinian people’s right to self-determination and to take the necessary measures to ensure the implementation of its relevant resolutions without further delay. Then also, the United Nations should consider what further action is required to bring the illegal occupation to ensure the implementation of the relevant resolutions without further delay."
    }
]