[
    {
        "voto": 1,
        "juez": "Palestine",
        "pregunta": "Finds that it has jurisdiction to give the advisory opinion requested",
        "texto": "I will present Palestine’s arguments on jurisdiction and admissibility. I can, and will, be succinct, as there is no doubt that the Court has jurisdiction to give the requested opinion and that there are no compelling reasons for the Court to decline to issue the requested opinion. /n/nMr President, the Court clearly has jurisdiction to provide the requested opinion. The General Assembly is obviously competent to request the opinion in line with Article 96, paragraph 1, of the Charter. Moreover, resolution 77/247 was adopted by a clear majority and in full compliance with both the requirements of the Charter and the Assembly’s Rules of Procedure./n/nThe questions posed by the General Assembly are also plainly legal in character. As the Court has repeatedly and consistently confirmed in its jurisprudence, the fact that the questions may have political implications is irrelevant and does not bar the Court from fulfilling its essential judicial function. /n/nSecond, the function of this Court, of these judges, of you, is to state the law: to spell out the legal rights and obligations that will allow a just solution in the future, in conformity with international law. The political context is totally irrelevant. The legal questions in Namibia, in the Wall case, in the Chagos case, all had a political context, but the Court did not blink. It has never shied away from drawing the consequences of the right to self-determination. In Chagos and in Namibia, the Advisory Opinions have been significant and positive in their outcomes and effects. By identifying the applicable legal principles, and then applying them to the facts, the Court performs a most significant, uniquely significant role, for protagonists and for the international community as a whole. With great respect to my friends from the United States and Britain, it is the very opposite of what they have written: the function of this Court, in interpreting and applying the right of self-determination of the Palestinian people, can only assist in a solution based on the law, by setting out the parameters required by the law to resolve the matter. A forthright advisory opinion from this Court makes a resolution more likely, not less likely."
    },
    {
        "voto": 1,
        "juez": "Palestine",
        "pregunta": "Decides to comply with the request for an advisory opinion",
        "texto": "Second, the questions concern the United Nations’ continuous responsibility for resolving the question of Palestine. This responsibility stems from its duties relating to matters of international peace and security arising under the Charter, and as the Court put it, “has its origin in the Mandate and the Partition Resolution concerning Palestine”. This responsibility continues, as confirmed by the unequivocal and contemporary practice of the General Assembly, the Security Council, as well as other United Nations organs and bodies. /n/nSome of these submissions oppose the advisory opinion because of the purported existence of a “negotiation framework” or of bilateral “negotiations”. However, none of these considerations constitutes a reasonable basis for the Court to refuse the General Assembly’s request. To the contrary, an opinion from the Court will assist in these negotiations by confirming the applicable international legal framework, as affirmed in United Nations resolutions, in order to reach a just and peaceful solution. /n/nThe Court’s opinion can thus only contribute to achieving the peaceful settlement of the question of Palestine called for by the Security Council. It  your opinion  will clarify the legal rights and obligations of Israel, of Palestine, of third States and of the United Nations to be reflected in a settlement that is truly consistent with international law. Thus, the Court’s opinion will also contribute to upholding the international rule of law at large. /n/nThird, the General Assembly, when deciding upon the request for the current advisory opinion, was acutely aware of the claim that such request would somehow purportedly undermine the chances of future negotiations. Nevertheless, the General Assembly decided to ask for the Court’s legal determination anyway. The General Assembly thus found that this argument had no merit. To the contrary, the General Assembly considered that the Court’s opinion would be helpful as to future steps to be taken by the political organs of the United Nations, as well as by all States. In line with your role as one of the principal organs of the organization, as envisaged in Article 7 of the Charter, the Court ought not now set aside this considered decision of the General Assembly. /n/nRather, Palestine invites the Court to fulfil its duty of providing its legal determination to the General Assembly by answering the legal questions put to it. In so doing, you will assist all States, as well as the United Nations, in furthering respect for the international rule of law, the fulfilment of the inalienable rights of the Palestinian people, and a just and peaceful solution in accordance with international law. /n/nFor all the above reasons, the State of Palestine requests the Court to declare that Israel’s discriminatory practices against the Palestinian people are tantamount to apartheid, which this Court defined in its 1971 Advisory Opinion on Namibia as “distinctions, exclusions, restrictions and limitations exclusively based on grounds of race, colour or descent or national or ethnic origin, which constitute a denial of fundamental human rights”. This actually reflects the Palestinian reality."
    },
    {
        "voto": 1,
        "juez": "Palestine",
        "pregunta":"The construction of the wall being built by Israel, the occupying Power, in the Occupied Palestinian Territory, including in and around East Jerusalem, and its associated régime, are contrary to international law",
        "texto": "I stand before you as 2.3 million Palestinians in Gaza, half of them children, are besieged and bombed, killed and maimed, starved and displaced. As more than 3.5 million Palestinians in the West Bank, including East Jerusalem, are subjected to the colonization of their territory and the racist violence that enables it. As 1.7 million Palestinians in Israel are treated as second-class citizens, as unwelcomed intruders in their ancestral land. As 7 million Palestine refugees continue to be denied their right to return to their land and homes. I stand before you as the entire Palestinian people continue to be denied their fundamental rights, their very existence negated. /n/nThe United Nations enshrined in its Charter the right of all peoples to self-determination and pledged to rid the world of the gravest breaches of this right, namely colonialism and apartheid. Yet, for decades, the Palestinian people have been denied this right and have endured both colonialism and apartheid. There are those who are outraged by the use of these words. They should instead be outraged by the reality we are living. This reality is known by every Palestinian, suffered by millions, generation after generation./n/nIt is a reality where Israel can destroy Gaza, killing tens of thousands of Palestinians, almost half of them children, leaving 1 million children starved, terrorized and traumatized for life, orphaned of a mother, a father, or both, amputated and disabled, leaving nearly 2 million people displaced and desperate, with nowhere to shelter from the onslaught. The genocide underway in Gaza is the result of decades of impunity and inaction. Ending Israel’s impunity is a moral, political and legal imperative. /n/nI thus implore you, as you hear the legal arguments, not to forget the Palestinian people. Not to forget that our people are struggling every day for their survival as individuals, families, communities, as a nation. That less than a month ago, this Court ordered provisional measures in a landmark case brought by the Republic of South Africa against Israel under the Genocide Convention  an Order that Israel continues to defy with impunity. /n/nFor decades Israel has occupied the Palestinian territory, committing violations that are inherent to its presence in our land and colonial objective. This occupation is annexationist and supremacist in nature. It is a deliberate, cynical perversion of international law. It is thus illegal. The only solution consistent with international law is for this illegal occupation to come to an immediate, unconditional, and total end. /n/nIn 1967, Israel then occupied the remainder of Palestine. And from the first day of its occupation, started colonizing and annexing the land with the aim of making its occupation irreversible. It left us with a collection of disconnected Bantustans preventing the independence of our State, as shown in map 4. Israel wanted the geography of Palestine, but not its demography. So it kept pushing our people out: out of their homes, out of their land. /n/nHere is the fifth map. It was displayed by Israel’s Prime Minister to the General Assembly last September. He called this “the New Middle East”. There is no Palestine at all on this map, only Israel, comprised of all the land from the Jordan River to the Mediterranean Sea. This shows you what the prolonged, continuous Israeli occupation of Palestine is intended to accomplish: the complete disappearance of Palestine and the destruction of the Palestinian people. /n/nIt has taken the Palestinian people decades of painful struggle to stand before you today. We appeal to the Court to uphold our rights to self-determination, return and all other human rights, including by declaring that the Israeli occupation is illegal and must end immediately, totally and unconditionally. /n/nFirst, the questions concern serious breaches of jus cogens and erga omnes norms. As my colleagues will show, those breaches, by Israel, include violations of:  the prohibition of acquisition of territory by force,  the prohibition of racial discrimination and apartheid,  the denial of the right of self-determination,  as well as other egregious violations of international human rights and humanitarian law of the same character. /n/nFirst, Israel has repeatedly refused, to this very day, to engage in meaningful negotiations with Palestine on the basis of international law and United Nations resolutions. This is reflected in repeated statements, including, most recently, by the Israeli Prime Minister and other high-ranking Israeli officials. The mere hypothetical possibility of future negotiations cannot thus be used as a mere pretext for avoiding the application of international law to this crucial matter, or for avoiding responsibility for ongoing breaches of peremptory norms of international law. /n/nI will address the legality of Israel’s prolonged occupation, annexation and settlement of the Occupied Palestinian Territory. In so doing, I will identify the elements that determine whether, and in what circumstances, a belligerent occupation is, or becomes, unlawful under international law; I will then review the evidence to assess whether those elements are present here; and I will show that, based on the applicable law and the well-established and undisputed facts, Israel’s 56-year occupation of Palestinian territory is manifestly and gravely unlawful, and that international law requires that it be brought to an end, completely and unconditionally. /n/nThe applicable rule of law is straightforward. As Pictet wrote in 1958, “occupation . . . is essentially a temporary . . . situation”. This remains the law. In December 2022, the General Assembly, in resolution 77/126, recognized that “the occupation of a territory is to be a temporary, de facto situation, whereby the occupying Power can neither claim possession nor exert its sovereignty over the territory it occupies”. This rule is neatly explained in the Written Statement of Switzerland: “The laws of occupation are built on the idea that occupation is only a temporary situation. They are based on four fundamental principles: 1) the occupying power does not acquire sovereignty over the territory it occupies; 2) the occupying power must maintain the status quo ante and must not take any measures which might bring about permanent changes”. The law is thus crystal clear: occupation can only be a temporary state of affairs. A permanent occupation is a legal oxymoron. /n/nMr President, what makes Israel’s ongoing occupation of the Palestinian territory unlawful is precisely its permanent character, and what demonstrates its permanence are: (i) Israel’s de jure and de facto annexation of Jerusalem and the West Bank; (ii) its claims of sovereignty over these areas, which it refers to by their biblical names, Judea and Samaria, and considers integral parts of the State of Israel; (iii) its establishment of hundreds of permanent Israeli settlements, with over 700,000 Israeli settlers, who have been promised by successive Israeli governments that they will never be removed; and (iv) the multitude of official statements and documents that openly declare Israel’s intention to incorporate all of the occupied territory east of the Green Line into the State of Israel as a permanent part of a single Jewish State extending from the Jordan River to the Mediterranean Sea. /n/nAs I will show you, the evidence is overwhelming and leaves no room for serious dispute about Israel’s actions or its intentions. As Israel’s Cabinet Secretary wrote in June of last year: “Judea and Samaria were not seized from a sovereign state recognized by international law, and the State of Israel has a right to impose its sovereignty over these areas as they comprise the cradle of history of the Jewish people and are an inseparable part of the Land of Israel.” As purported legal authority, the Cabinet Secretary invoked the First Book of Maccabees, written in the year 100 BC, chapter 15, verse 33: “It is not a foreign land we have taken nor have we seized the property of foreigners, but only our ancestral heritage, which for a time had been unjustly occupied by our enemies.” /n/nThis was followed in August of last year by a message broadcast on Israel’s Army Radio by Israel’s Heritage Minister: “Sovereignty must be extended within the borders of the West Bank . . . and in the most prudent way, to create international recognition that this place is ours . . . There is no Green Line, it is a fictitious line that creates a distorted reality and must be erased.” /n/nIn September 2023, Israel’s Prime Minister literally erased the Green Line, in his presentation to the United Nations General Assembly. As you saw earlier, he depicted the State of Israel as extending from the Jordan River to the Mediterranean Sea, eliminating not only the Green Line but all traces of Palestine. This was no oversight; it was an act of the Head of Government, with all the attribution that it implies. The same message was delivered by Israel’s Finance Minister in Paris, six months earlier, when he denied the existence of Palestine and declared that Palestinians do not constitute a people. Previously, he said: “We are here to stay. We will make it clear that our national ambition for a Jewish State from the river to the sea is an accomplished fact, a fact not open to discussion or negotiation.” This has been Israel’s consistent position. Here is the map of Israel produced by its armed forces and published by the Government in 2021. One State, Israel, from the river to the sea. There is no Green Line; there is no Palestine. Instead, Palestine has been replaced by “Judea” and “Samaria”, which, according to Israel’s highest officials, are now integral parts of the State of Israel. /n/nAs these official statements and maps demonstrate, Israel makes no secret of its intention to retain permanently the entire area east of the Green Line. Its annexation of occupied Palestinian territory began in 1967 with legislation annexing East Jerusalem, which Israel increased eleven-fold in size to incorporate not only the Holy City but also vast areas of the West Bank surrounding the City. Its Defence Minister, Moshe Dayan, declared at the time: “The Israel Defence Forces have liberated Jerusalem . . . We have returned to this most sacred shrine, never to part from it again.” In 1990, the Israeli Cabinet instructed the Foreign Minister to notify the Secretary-General of the United Nations that “Jerusalem is not, in any part, ‘occupied territory’; it is the sovereign capital of Israel”. In June 1996, the Guidelines of the incoming Israeli Government stated: “Jerusalem, the capital of Israel, is one city, whole and undivided, and will remain forever under Israel’s sovereignty.” More recently, in assuming office in December 2022, the current Prime Minister declared that “[t]he Jewish people are not occupiers in their own land nor occupiers in our eternal capital Jerusalem”. As these official statements make clear, Israel’s dominion over Jerusalem and the incorporated area of the West Bank is not intended to be temporary. It has been repeatedly proclaimed by Israel’s highest authorities to be “eternal”. /n/nIn furtherance of this end, more than 230,000 Israeli Jewish settlers  encouraged, subsidized and protected by the Israeli Government and occupation forces  have been installed in East Jerusalem, dramatically altering the demographic composition of the Holy City by creating an Israeli Jewish majority. /n/nIsrael has been equally clear in declaring its permanence in the West Bank, where more than 465,000 Israeli Jewish settlers have been implanted with the support of every Israeli government since 1967, in over 270 ever-expanding settlements, spread throughout this territory, in what can only be described as a vast colonial enterprise. These settlements, whose accelerated growth and distribution over the years are illustrated on your screens now, are a key instrument of Israel’s annexation of the West Bank; this is both their purpose and their effect. /n/nAs the Secretary-General reported to the General Assembly in 2015: “Occupation is supposed to be temporary because the annexation or acquisition of territory by force is strictly prohibited under international law . . . In the West Bank, including East Jerusalem, the establishment and maintenance of the settlements amount to a slow, but steady annexation of the occupied Palestinian territory.” /n/nIsrael has made no secret of the intended permanence of these settlements. In 2010, Prime Minister Netanyahu told Israeli settlers in the West Bank: “Our message is clear. ‘We are planting here, we will stay here, we will build here. This place will be an inseparable part of the State of Israel for eternity.’” In August 2019, the Prime Minister announced that: “The time has come to apply Israeli sovereignty over the Jordan Valley and to also arrange the status of all Jewish communities in Judea and Samaria . . . They will be part of the State of Israel.” In January 2020, Israel’s Defence Minister, Naftali Bennett, declared: “Our objective is that within a short amount of time . . . we will apply sovereignty to all of Area C, not just the settlements, not just this bloc or another.” /n/nIn December 2022, the Guiding Principles of the incoming Israeli Government declared: “The Jewish people have an exclusive and indisputable right to all parts of the Land of Israel. The Government will promote and develop the settlement of all parts of the Land of Israel  the Galilee, the Negev, the Golan and Judea and Samaria.” The coalition agreement between the political parties that formed the Government included this pledge: “[T]he Prime Minister will lead the formulation and promotion of policy in which sovereignty will be applied in Judea and Samaria, while choosing the timing and weighing all the national and international interests of the State of Israel.” /n/nGeneral Assembly resolution 77/126 was adopted on 12 December 2022, just as the current Israeli Government was assuming office. The resolution pointedly recalled: “[T]he principle of the inadmissibility of the acquisition of land by force and therefore the illegality of the annexation of any part of the Occupied Palestinian Territory, including East Jerusalem, which constitutes a breach of international law” and the resolution condemned Israel’s “annexation of land, whether de facto or through national legislation”. /n/nIsrael has thoroughly disregarded resolution 77/126, just as it disregarded all prior General Assembly and Security Council resolutions declaring illegal the annexation of any part of the Occupied Palestinian Territory and the establishment of Israeli settlements there. These include but are by no means limited to:  Security Council resolution 252 of 1968, declaring Israel’s acquisition of territory by military conquest “inadmissible”;  resolution 476 of 1980, which “[r]eaffirm[ed] the overriding necessity for ending the prolonged occupation of Arab territories” in 1980 and “[s]trongly deplore[d] the refusal of Israel . . . to comply with the relevant resolutions of the Security Council and the General Assembly”;  resolution 478 of 1980, which “determine[d] that all legislative and administrative measures and actions taken by Israel . . . to alter the character and status of the Holy City of Jerusalem, and in particular the ‘basic law’ on Jerusalem, are null and void and must be rescinded forthwith”;  resolution 2334 of 2016, which “reaffirm[ed] . . . the inadmissibility of the acquisition of territory by force”, and condemned “all measures aimed at altering the demographic composition, character and status of the Palestinian Territory occupied since 1967 . . . including, inter alia, the construction and expansion of settlements, transfer of Israeli settlers, confiscation of land, demolition of homes and displacement of Palestinian civilians”; and  at least 28 General Assembly resolutions, which expressly condemned Israel’s “annexation” of Jerusalem and the West Bank. /n/nIsrael has also blatantly disregarded the obligations reflected in the Court’s 2004 Advisory Opinion in the Wall case. Since then, instead of dismantling the wall, Israel has extended it from a length of 190 km to more than 460 km, encompassing hundreds of additional square kilometres of Palestinian land, and incorporating it into the State of Israel. In its Advisory Opinion, the Court expressed concern lest “the construction of the wall and its associated régime create a ‘fait accompli’ on the ground that could well become permanent, in which case, and notwithstanding the formal characterization of the wall by Israel, it would be tantamount to de facto annexation”. /n/nAnd that is precisely what has happened over the past 20 years, not only within the expanded confines of the wall, but all across the West Bank, most of which has now been annexed de facto by Israel. In 2022, the report of the United Nations International Commission of Inquiry concluded: “Israel treats the occupation as a permanent fixture and has  for all intents and purposes  annexed parts of the West Bank . . . The International Court of Justice anticipated such a scenario in its 2004 advisory opinion . . . This has now become the reality.” /n/nThe Special Rapporteur on human rights in the Occupied Palestinian Territory reached the same conclusion: “The occupation by Israel has been conducted in profound defiance of international law . . . Its 55-year-old occupation burst through the restraints of temporariness long ago. Israel has progressively engaged in the de jure and de facto annexation of occupied territory.” /n/nMr President, Israel’s ongoing annexation of the West Bank accelerated in 2023, with the largest ever expansion of settlements in the territory. Twenty-two new settlements were authorized and more than 16,000 new housing units were built, funded or planned by Israeli authorities. As explained by Israel’s Finance Minister: “The construction boom in Judea and Samaria and all over our country continues . . . We will continue to develop the settlement[s] and strengthen the Israeli hold on the territory.” /n/nIn developing its settlements, Israel has invested heavily in the infrastructure needed to supply them with water and electric power, as well as a network of roads and highways to connect them to one another and to Israel itself. These investments, in the hundreds of millions of dollars, attest to the intended permanent character of the settlements. The roads, which Palestinians are forbidden to use, and a pervasive system of roadblocks and checkpoints, prevent Palestinians but not Israeli settlers from moving from place to place in the West Bank, and they isolate Palestinian communities by cutting them off from one another. Israel’s settlement expansion has thus both uprooted Palestinians from their homes to make room for new settlements, and forced them to live in disconnected and non-contiguous enclaves, which the Special Rapporteur has called “a fragmented archipelago of 165 disparate patches of land”. This achieves the fundamental objective of the occupation: permanent acquisition of the maximum amount of Palestinian territory, with the minimum number of Palestinians in it. /n/nIn furtherance of this objective, and with increasing frequency, armed groups of settlers, supported by Israel’s occupation forces and encouraged by government ministers, have violently expelled thousands of peaceful Palestinian civilians from their ancestral villages and lands. A United Nations Fact Finding Mission confirmed: “[T]he motivation behind this violence and the intimidation against the Palestinians and their properties is to drive the local populations away from their lands and allow the settlements to expand.” The United Nations High Commissioner for Human Rights reported in March 2023: “[S]ettler violence further intensified, reaching the highest levels ever recorded by the United Nations.” In November 2023, the High Commissioner warned that the situation had further deteriorated with “a sharp increase in settler violence and takeover of land across the West Bank. Since 7 October,” he continued, “nearly 1,000 Palestinians from at least 15 herding communities have been forced from their homes”. /n/nThe Secretary-General, in his most recent report, issued on 25 October 2023, expressly linked the expansion of Israeli settlements to the permanent acquisition of Palestinian territory: “[S]uccessive Israeli Governments have consistently advanced and implemented policies of settlement expansion and takeover of Palestinian land. The policies of the current Government in this regard are aligned, to an unprecedented extent, with the goals of the Israeli settler movement to expand long-term control over the occupied West Bank, including East Jerusalem, and, in practice, to further integrate those areas within the territory of the State of Israel.” /n/nApparently, very far indeed. According to former US President Barack Obama, in the memoir he published in 2020: “[J]ust about every country in the world considered Israel’s continued occupation of the Palestinian territories to be a violation of international law. As a result, our diplomats found themselves in the awkward position of having to defend Israel for actions that we ourselves opposed.”70 This is exactly what the United States is doing  again  in these proceedings. /n/nStarting from the Nakba of 1948 until now, Israel has adopted discriminatory legislation and measures by which it has established a deeply entrenched system of racial discrimination against Palestinians, subjugating them to Israeli domination and denying their fundamental rights. /n/nDiscrimination against the Palestinian people is as integral to Israel’s prolonged occupation as is the annexation and colonization of the Palestinian territory. They are inextricable parts of the same whole and feed off each other. /n/nUsing “a toolbox of population control” and inhumane acts amounting to aggravated forms of racial discrimination, Israel restricts every aspect of Palestinian life, from birth to death, resulting in manifest human rights violations and an overt system of repression and persecution. /n/nThrough indiscriminate killing, summary execution, mass arbitrary arrest, torture, forced displacement, settler violence, movement restrictions and blockades, Israel subjects Palestinians to inhumane life conditions and untold human indignities, affecting the fate of every man, woman and child under its control. /n/nPalestinians, and Palestinians only, endure horrific levels of extensive human and material losses, including home demolitions enforced as collective punishment. All of this has created a coercive environment that facilitates Israel’s forcible displacement of Palestinians. /n/nAs described by the Special Rapporteur: “Collective punishment is an inflamed scar that runs across the entire Israeli occupation of Palestine. Notwithstanding numerous resolutions, reports and reminders critical of its use, Israel continues to rely upon collective punishment as a prominent instrument in its coercive toolbox of population control. The logic of collective punishment has been to project domination in order to subdue a subjugated population through inflicting a steep price for its resistance to alien rule.” /n/nApartheid exists in the Occupied Palestinian Territory. Twenty participant States expressly hold the same position including victims of apartheid, South Africa and Namibia. /n/nFinally, the inhuman acts are committed with the purpose of maintaining the apartheid régime, and by it, maintaining permanently Israel’s illegal occupation of Palestinian territory. /n/nA one-State reality of unequal rights consolidating segregation and apartheid against Palestinians is reflected in the inherently discriminatory character of the 2018 Basic Law “Israel  The Nation-State of the Jewish People”. /n/nUnder this law, “exercising the right to national self-determination in the State of Israel is unique to the Jewish people”. Developing Jewish settlements became an Israeli “national value”, not only in the occupied West Bank and the Syrian Golan but even in Israel, and I ask where? On which lands? The answer is on the lands where Palestinian citizens of Israel live, especially in the Galilee and the Naqab. /n/nMr President, Members of the Court, in its written statement the State of Palestine explained that the right to self-determination comprises four specific components. First, the right to territorial integrity. Second, the right not to be subjected to demographic manipulation within that territory by a foreign power. Third, the right to exercise permanent sovereignty over its natural resources. And fourth, the right to be able to pursue its chosen economic, social and cultural development. The prolonged occupation, colonization and purported annexation by Israel of Palestinian territory, with all the discriminatory and other unlawful acts, have and continue to deprive the Palestinian people of each of these four distinct components. /n/nLet me start with the right to territorial integrity, so recently recognized and given effect by the Court in its Advisory Opinion on Chagos, and endorsed by an overwhelming majority by the General Assembly of the United Nations. This implements resolutions 1514 and 2625. Yet, Israel has clearly violated the territorial integrity of the Occupied Palestinian Territory, through over more than half a century of belligerent occupation. As Mr Reichler has described, it has purportedly annexed Jerusalem and the West Bank, and it has established hundreds of settlements populated by more than 700,000 settlers, regarded as a permanent part of Israel. It has extended the Wall that this Court found to be illegal in 2004. It has confined Palestinians to enclaves. It has severed Jerusalem, it has restricted Palestinian rights of entry from the rest of the Occupied Palestinian Territory. It has transformed the Gaza Strip into an impoverished enclave, a besieged, bombarded community, severed from the West Bank and East Jerusalem. Its leaders have declared that Israel will be sovereign over all the land between the Jordan River and the Mediterranean Sea and it has made this formal government policy. /n/nWhat is the consequence of this? It is the acquisition of territory by force. It is the reduction and fragmentation, as you have seen, of the territory left for the Palestinians. This is a manifest violation of Palestine’s territorial integrity, its unity, its contiguity, which are core elements of the right to self-determination. The General Assembly, the Security Council, the Human Rights Council have repeatedly called for the preservation of Palestine’s territorial integrity, and condemned Israel’s acts as a violation of the right of the Palestinian people to exercise their self-determination. We urge the Court to declare Israel’s 56-year occupation to be unlawful, to confirm, to take the words of your recent opinion in the Chagos case, that Israel is under an obligation to bring its presence on the territory of Palestine to an end and to do so as rapidly as possible. /n/nMr President, Members of the Court, the fourth component of the right to self-determination is the right of a people to determine its own political status and direction, and to pursue its own economic, social and cultural development of its choice. This is confirmed by a multitude of instruments and General Assembly resolutions. Yet Israel persists in prohibiting and punishing political expressions of Palestinian identity and nationhood. Flags are outlawed and attacked. Civil society organizations and political parties are declared to be unlawful. Leaders and elected representatives, and civilians more generally, including so many children, are assaulted, exiled, imprisoned or killed. /n/nGeneral Assembly resolutions and many treaties confirm that these rights exist under international law. And they have been systematically violated. The economic, social and cultural rights of the Palestinian people are suppressed by a prolonged and unlawful occupation; by the purported annexation of the West Bank, including East Jerusalem; by the settlements; by the wall and its associated régime and infrastructure; by the blockade of Gaza; by the fragmentation of land; by the deprivation of resources; by the restrictions on freedom and movement of people and of goods; and by a multitude of other acts of subjugation and collective punishment. These acts, and others, have curtailed the access of the Palestinian people to livelihoods; they have made the country and the people totally dependent on aid. /n/nIn summary, Israel has arrogated to itself the right to decide who owns Palestinian land, who may live on it, and how it is to be used. On Israel’s approach, it decides on the use of resources and allocation of benefits. On Israel’s approach, it decides whether Palestinians remain or return. On Israel’s approach, it decides how, if at all, Palestinians may meet, trade, teach, worship, live, love. /n/nMr President, let us be blunt: Israel has sought to negate the rights of the Palestinian people to exercise their right of self-determination, in all aspects, across all parts of the territory of Mandatory Palestine. It has done so for decades and it wishes to do so forever. Tragically, tragically, Israel celebrates the manifest violation of international law inherent in its prolonged occupation. Tragically, tragically, Israel asserts “the right of national self-determination in the state of Israel is unique to the Jewish people”, under its own 2018 Basic Law. Tragically, tragically, Israel sets its face against the role of international law. No one in this Great Hall of Justice is starry-eyed about international law, but it is what we have, and it is your role, as judges of this Court, the principal judicial organ of the United Nations, to affirm the place and the power of international law, to confirm the illegality of the occupation, to make clear that Palestine — in all respects — meets the criteria of statehood under international law with all the rights and responsibilities that implies. /n/nAs we address you today, this breach has reached its most inhumane levels. More than two million Palestinians in Gaza are being pushed all the way to the border, to the very brink, Palestinian children, women and men consumed by disease, despair, destruction and death, which are spreading like wildfire. /n/nInstead, Israel started to colonize the land. /n/nInstead, Israel denied the existence of the Palestinian people."
    },
    {
        "voto": 1,
        "juez": "Palestine",
        "pregunta": "Israel is under an obligation to terminate its breaches of international law; it is under an obligation to cease forthwith the works of construction of the wall being built in the Occupied Palestinian Territory, including in and around East Jerusalem, to dismantle forthwith the structure therein situated, and to repeal or render ineffective forthwith all legislative and regulatory acts relating thereto, in accordance with paragraph 151 of this Opinion",
        "texto": "Mr President, Members of the Court, the evidence is before you  in the written submissions of the State of Palestine and dozens of other States and international organizations, and in the voluminous materials supplied to you by the Secretary-General  and it is indisputable. Under the umbrella of its prolonged military occupation, Israel has been steadily annexing the Occupied Palestinian Territory, and it continues to do so. Its undisguised objective is the permanent acquisition of this territory, and the exercise of sovereignty over it, in defiance of the prohibition on acquisition of territory by force. /n/nThe evidence is not only indisputable, it is of the highest probative value: investigative reports of authoritative United Nations agencies; reports of the Secretary-General; resolutions of the Security Council and the General Assembly; legislative and administrative acts by the Israeli Government; and public statements against interest by the most senior government officials admitting that Israel’s objective is sovereignty over all the territory east of the Green Line and its incorporation into a single Jewish State from the river to the sea. In this case, there is no reason not to take them at their word, because their deeds have been entirely consistent with it. /n/nFor Israel, as its successive governments have made clear, there is no Palestine. It simply does not exist. In November 2023, Prime Minister Netanyahu declared that his Government would never agree to a Palestinian State in the occupied territory71. He later declared: “I will not compromise on full security control over all the territory west of Jordan  and this is contrary to a Palestinian state.”72 Israel’s intransigence was confirmed by its staunchest ally in December 2023, when US President Joe Biden publicly lamented that Israel’s leaders “don’t want anything remotely approaching a two-state solution”73. /n/nThat is the very solution demanded by the Security Council, the General Assembly, the overwhelming majority of States and the State of Palestine itself. It is, in fact, the only solution that can lead to lasting peace and security for the Israeli people as well as the Palestinian people. And it is this very solution that has been frustrated by Israel’s defiant insistence on maintaining its dominion over Palestinian territory in perpetuity. This is why the Court’s advisory opinion is so critical and so urgent. The best, and possibly the last, hope for the two-State solution that is so vital to the needs of both peoples is for the Court to declare illegal the main obstacle to that solution  the ongoing Israeli occupation of Palestine  and for it to pronounce, in the clearest possible terms, that international law requires that this entire illegal enterprise be terminated: completely, unconditionally and immediately. /n/nMr President, the law is clear and it demands nothing less. A permanent occupation  one that is founded upon annexation and massive settlement of the occupied territory, and which aims to exercise sovereignty over it  is manifestly and gravely unlawful; it is an ongoing international wrong that must be brought to an immediate end. As the Court ruled in 1971: “[T]he continued presence of South Africa in Namibia being illegal, South Africa is under obligation to withdraw its administration from Namibia immediately and thus put an end to its occupation of the Territory”. /n/nThe Secretary-General applied this principle directly to Palestine in his remarks to the Security Council one month ago: “Palestinians must see their legitimate aspirations for a fully independent, viable and sovereign State realized, in line with United Nations resolutions, international law and previous agreements. Israel’s occupation must end.” /n/nMr President, the proverbial ball is now in your court. The General Assembly has asked you the critical questions. It is now your responsibility to answer them. Silence is not an option. As the immortal Palestinian poet, Mahmoud Darwish, wrote: “In silence we become accomplices.” But, he assured us, when we speak: “Every word has the power to change the world.” /n/nMr President, Members of the Court, your words have such power. In 2004, the Court affirmed the inalienable right of the Palestinian people to self-determination. In 2024, it is time for you to enable them finally to exercise that right, by freeing them from the unlawful Israeli occupation of their territory, so that they may live in a sovereign and fully independent State of their own, in peaceful and secure coexistence with all their neighbours, including Israel. By upholding international law, which is all the State of Palestine asks you to do, your powerful words will change the world. /n/nIsrael’s measures, policies and practices against the Palestinian people are no less pervasive in their reach or less pernicious in their consequences than the institutionalized racial discrimination and segregation that existed in South Africa. And just like in 1971, the international community relies on this Court to play its own genuine role to bring about an end to this glaring injustice. An immediate end to this illegal situation will bestow on the Palestinian people the fundamental rights to which they are entitled by international law, yet unfortunately they have been so unjustly denied. /n/nWhat are the consequences of Israel’s violations of Palestine’s right to self-determination and its exercise? Professor Pellet is going to address these matters, so I can be brief: as the purpose and effect of the occupation is the denial of the right of self-determination, and the prevention — let’s be frank — of the solution called for by the Security Council, the General Assembly and the vast majority of States of our world, premised on the existence of the two-State solution — the occupation is illegal and must be brought to an “immediate, unconditional and total” end. The right of self-determination requires that UN Member States bring Israel’s occupation to an immediate end. No aid. No assistance. No complicity. No contribution to forcible actions. No money, no arms, no trade, no nothing. All UN Members are obliged by law to end Israel’s presence on the territory of Palestine. /n/nFor 75 years, the Palestinian people have faced attempts to push them out of geography and, indeed, out of history. And it goes on. And it will go on forever, unless and until international law is upheld. Unless and until the unlawful occupation of Palestine ends. /n/nWe call on you to confirm that Israel’s presence in the Occupied Palestinian Territory is illegal, that the presence of its occupation forces and settlers is illegal, and that its occupation must thus come to an immediate, complete and unconditional end. This occupation has served as cover for Israel’s colonial designs: the acquisition of Palestinian territory by force. /n/nMr President, Members of the Court, based on the United Nations record, you should have no difficulty arriving at the conclusion that the occupation is prolonged, that Palestinian territory has been annexed, that our self-determination has been denied, and that the people of Palestine have been subjected to systematic racial discrimination."
    },
    {
        "voto": 1,
        "juez": "Palestine",
        "pregunta": "Israel is under an obligation to make reparation for al1 damage caused by the construction of the wall in the Occupied Palestinian Territory,including in and around East Jerusalem",
        "texto": "In closing, honourable judges, the State of Palestine appeals to this Court: to guide the international community in upholding international law, ending injustice and achieving a just and lasting peace. /n/nTo guide us towards a future in which Palestinian children are treated as children, not as a demographic threat. In which the identity of the group to which we belong does not diminish the human rights to which we are all entitled. /n/nA future in which no Palestinian and no Israeli is killed. A future in which two States live side by side in peace and security. The Palestinian people only demand respect for their rights. They ask for nothing more; they cannot accept nothing less and nothing else. /n/nThe future of freedom, justice and peace can begin here and now. It is within your power to give the clearest statement possible on what the law is, what it requires and what it means in practice, for all Members of the United Nations. We trust in your wisdom, your fairness and your dedication to justice and the rule of law and I thank you very much Mr President."
    },
    {
        "voto": 1,
        "juez": "Palestine",
        "pregunta": "All States are under an obligation not to recognize the illegal situation resulting from the construction of the wall and not to render aid or assistance in maintaining the situation created by such construction; all States parties to the Fourth Geneva Convention relative to the Protection of Civilian Persons in Time of War of 12 August 1949 have in addition the obligation, while respecting the United Nations Charter and international law, to ensure compliance by Israel with international humanitarian law as embodied in that Convention",
        "texto": "There can be no justification for these injustices and indignities. Allowing them to continue is unacceptable and inexcusable. Acquisition of territory by force; persecution, racial discrimination and apartheid against a people; denial of self-determination are all grave violations of the most fundamental norms of international law. There is a legal and moral obligation to bring them to a prompt end. /n/nWithout accountability there is no justice, and without justice there can be no peace. Israel must be made to bear the consequences of its illegal conduct rather than reap the benefits. /n/nA finding from this distinguished Court that the occupation is illegal and drawing the legal consequences from this determination would contribute to bringing it to an immediate end, paving the way to a just and lasting peace."
    }
]