[
    {
        "voto": 0,
        "juez": "Republic of Fiji",
        "pregunta": "Decides to comply with the request for an advisory opinion",
        "texto": "Mr President and esteemed Members of the International Court of Justice, it is my great honour to appear before you today on behalf of the Republic of Fiji.\n\nMr President, for many decades Fiji has built a tradition of peacekeeping. Our commitment to world peace is unwavering and we are resolute in our efforts to contribute to global stability. I have personally had the privilege of leading peacekeeping operations in the Middle East over a period of more than 20 years.\n\nMr President, Members of the Court, Fiji supports all efforts to establish a comprehensive, just and lasting peace for both Israelis and Palestinians. Efforts that recognize the right of the Palestinian people to self-determination and the right of the Jewish State of Israel to exist as a sovereign State with secure borders. Efforts that emphasize the need for the parties to engage in constructive negotiations, as envisaged by the Security Council and the General Assembly.\n\nFiji affirms the important role of this Court as the highest judicial organ of the United Nations in resolving disputes between States and assisting United Nations organs in their activities.\n\nIn so doing, the Court must promote the purposes and principles of the United Nations Charter. According to Article 1 of the United Nations Charter, one of the main purposes of the United Nations is “to develop friendly relations among nations based on respect for the principle of equal rights and self-determination of peoples”. Fiji strongly believes that the only way to achieve truly sustainable peace between Israel and the Palestinian people  indeed between any neighbours  is through mutual respect.\n\nAs reflected in our Written Statement, Fiji considers it essential to maintain and uphold the legal framework agreed between the parties and sanctioned by the Security Council to resolve the Israeli–Palestinian dispute. That framework is founded on the understanding that Jews and Arabs must coexist in a small piece of territory. This requires direct negotiations between the parties for an agreed outcome.\n\nMr President, Members of the Court, the General Assembly has requested the Court to answer certain questions that focus on the legal consequences of the policies and practices of only one party to this dispute.\n\nTo answer these questions, the Court would need to carry out an independent judicial assessment of both the law and the facts, on virtually every aspect of the Israel–Palestine dispute, taking account of the relevant context. This is not an easy task. As Judge Higgins noted in her separate opinion in the Wall Advisory Opinion: “[t]he law, history and politics of the Israel-Palestine dispute is immensely complex”. Further, “[c]ontext is usually important in legal determinations”.\n\nIn Fiji’s view, this Court has unfortunately been presented in these proceedings with a distinctly one-sided narrative. This fails to take account of the complexity of this dispute and misrepresents the legal, historical and political context.\n\nIn its Written Statement, Fiji has provided several reasons why the Court should exercise its judicial discretion not to render an advisory opinion on the questions that have been posed by the General Assembly:\nfirst, the request is a legal manoeuvre to circumvent the existing internationally sanctioned and legally binding framework for resolution of the Israel-Palestine dispute;\nsecond, to give an opinion in this case “would have the effect of circumventing the principle that a State is not obliged to allow its disputes to be submitted to judicial settlement without its consent”; and  third, due to the one-sided formulation of the questions posed in resolution 77/247, the Court does not have before it the accurate and reliable information that it would need to render an opinion on the questions posed.\n\nMr President, Members of the Court, in this oral presentation I will address the first and third of these issues.\n\nI turn to the existing framework.\n\nIn these proceedings, the Court has been asked to render an advisory opinion that may well mean, in effect, the “immediate”, “unconditional” and “total” end to the occupation  that is, withdrawal of all Israeli military and civilians from the entirety of the West Bank, East Jerusalem and Gaza. This withdrawal must not only be complete, but it must also be unconditional  in other words, Israel may not impose or require any limitations or conditions. This unconditionality is supposedly necessary in order that the Palestinian people have a sovereign State on such territory, which they assert is the only way to achieve justice and therefore peace.\n\nFiji respectfully submits that this demand of a complete and unconditional withdrawal circumvents the peace process and the agreements that have been made in pursuit of that process.\n\nMr President, the fact is that, from 1993, Israel and Palestine entered into the series of agreements known collectively as the “Oslo Accords”. The parties expressed the intention to “put an end to decades of confrontation and to live in peaceful coexistence, mutual dignity and security, while recognizing their mutual legitimate and political rights”. To that end, they agreed on a wide range of interim measures, pending the achievement of a final agreement through permanent status negotiations.\n\nSome of those interim measures include:\n\nThe Palestinian Authority was established.\n\nPowers and responsibilities were transferred from the Israeli military government and its civil administration to the Palestinian Authority, while Israel continued to exercise powers and responsibilities not so transferred.\n\nDirect, free and general political elections were to be held by the Palestinians.\n\nThe West Bank was divided into three areas: A, B and C. The Palestinians would obtain exclusive control over Area A; Area B would be under joint Israeli/Palestinian control; and Area C would be under exclusive Israeli control.\n\nLastly, the parties would enter negotiations on the permanent status to resolve the remaining issues, which included “settlements”, “borders”, “Jerusalem” and “security”.\n\nIn addition, the Oslo Accords contain a specific dispute resolution mechanism, and do not permit either party unilaterally to commence or ask others to commence external legal proceedings.\n\nSince 1993, an extensive set of arrangements has been put in place to operationalize the agreements.\n\nIn 2003, the General Assembly endorsed the Oslo Accords and the Security Council has “[e]ndorsed the Quartet Performance-based Roadmap to a Permanent Two-State Solution to the Israeli-Palestinian Conflict”. This Court itself confirmed the importance of the Oslo Accords and the Roadmap in the Wall Advisory Opinion in 2004.\n\nAccording to the Roadmap,\n“a two state solution to the Israeli-Palestinian conflict will only be achieved through an end to violence and terrorism, when the Palestinian people have a leadership acting decisively against terror and willing and able to build a practicing democracy based on tolerance and liberty, and through Israel’s readiness to do what is necessary for a democratic Palestinian state to be established, and a clear, unambiguous acceptance by both parties of the goal of a negotiated settlement”.\n\nThe thrust of the Oslo Accords and the Roadmap is mutual performance and good faith negotiation, leading to a consensual outcome.\n\nThe Oslo Accords are legally binding. Remarkably, the Palestinians do not refer to these agreements in their Written Statement, while less than 12 months ago both Israel and Palestine reaffirmed their “unwavering commitment to all previous agreements between them” and “to address all outstanding issues through direct dialogue”.\n\nMr President, it is our submission that the request to this Court to opine on questions that address the legal obligations of only one party to this dispute conflicts with the clear rights and obligations of both parties in the Oslo Accords and the Roadmap, and which exclude recourse to this Court.\n\nFor this reason, Fiji respectfully submits that the Court should exercise its discretion not to render an opinion on those questions.\n\nMr President, Members of this honourable Court, I now turn to the issue of legal and factual evidence.\n\nAs stated, in Fiji’s view, the Court should decline to answer the questions posed. But were it to do so, it would need to gather and independently assess the probative value of evidence on issues raised within the established legal framework of the dispute.\n\nThis Court would have to decide, as it has previously explained,\n“whether [it] has before it sufficient information and evidence to enable it to arrive at a judicial conclusion upon any disputed questions of fact the determination of which is necessary for it to give an opinion in conditions compatible with its judicial character”.\n\nIn Fiji’s view the Court cannot simply defer to the reports of United Nations bodies. In order to fulfil its judicial function, the Court must reach its own independent findings of fact.\n\nFurther, Fiji submits that, due to the selective and one-sided formulations of the questions, the Court does not have before it all the evidence it would need to exercise its judicial function.\n\nMr President and esteemed Members of the Court, the point here is that the Court is being asked to focus solely on the policies and practices of one of the parties to this dispute, to the exclusion of the policies and practices of the other. This is highly problematic. If the Court would limit itself to consideration of the questions asked, it would be unable to consider the relevant broader context, and it will also not have before it sufficient information and evidence to enable it to arrive at a judicial conclusion upon questions of fact that are in dispute, all of which would be necessary to give an opinion compatible with its judicial character.\n\nWe will illustrate this by looking briefly at three of the issues raised by the questions that have been posed to the Court, and these are: withdrawal and security, territorial sovereignty, and the right to self-determination."
    },
    {
        "voto": 0,
        "juez": "Republic of Fiji",
        "pregunta": "The construction of the wall being built by Israel, the occupying Power, in the Occupied Palestinian Territory, including in and around East Jerusalem, and its associated régime, are contrary to international law",
        "texto": "Mr President and Members of the Court, the General Assembly’s request speaks of Israel’s “prolonged occupation, settlement and annexation of the Palestinian territory occupied since 1967”. This asks the Court to presuppose that all the territories held during the Jordanian and Egyptian occupation within the 1949 Armistice Lines are “Palestinian” that is, that they are sovereign territories of Palestine and thus not of Israel.\n\nA precise definition of the scope of territorial claims is important because “[t]erritorial sovereignty is a fundamental principle of the international political and legal order. It ‘serves to divide between nations the space upon which human activities are employed, in order to assure them at all points the minimum of protection of which international law is the guardian.’”\n\nIn the context of the questions put to this Court, territorial sovereignty is critical because without clarifying the respective claims of Israel and the Palestinians concerning the sovereign status of the territory, it would be impossible to answer the questions of territorial scope of the Palestinian self-determination claim or the occupation.\n\nFiji notes that the question of territorial scope both of the State of Israel and of the self-determination claim of the Palestinian people is in dispute between the parties.\n\nAnd yet the way the questions are drafted excludes the possibility of the Court considering Israel’s claims to the sovereignty over the territory and asks the Court to assume without further investigation that these territories are somehow “Palestinian”.\n\nFurthermore, the Court would need to assess whether the Palestinians have sovereignty and, if so, over which territory. This would include an examination, among other things, of the history of Palestinian assertions of claims and of whether Palestinians make different assertions of sovereignty in different fora.\n\nPalestine asserts that the provisions in the Mandate for Palestine concerning the establishment of a Jewish homeland as envisaged in the Balfour Declaration were illegitimate and in contravention of the Covenant of the League of Nations. It appears to claim that all the territory of Mandate Palestine  even including what is generally accepted to be the territory of the State of Israel belongs to the Palestinian people.\n\nMr President, Israel asserts, and Fiji agrees, that the Mandate for Palestine, including its provisions concerning the establishment of the Jewish homeland, such as the right of the Jewish people to live in and closely settle the land, was a binding instrument of international law. Israel also argues that the relevance of the rights conferred by the Mandate for Palestine was affirmed in Article 80 of the United Nations Charter, the so-called “Palestinian clause”.\n\nThere is thus a dispute about territorial sovereignty. Fiji submits that this dispute cannot and should not be resolved through means of the requested advisory opinion, for two reasons.\n\nThe first reason is that the question of “borders” and therefore the scope of territorial sovereignty was expressly agreed to be resolved through the permanent status negotiations to which the parties have committed themselves in the Oslo Accords. For the reasons set out earlier, this precludes the matter being adjudicated via an advisory opinion procedure.\n\nThe second reason is that, in any event, because of the way the questions to the Court have been formulated, the Court simply does not have before it sufficient information and evidence to enable it to arrive at a judicial conclusion on the disputed issue of the geographic limits of the territorial sovereignty of Palestine and Israel.\n\nI now turn to self-determination.\n\nThe questions before the Court ask it to assume that Israel is violating “the right of the Palestinian people to self-determination”.\n\nThe question of self-determination raises the question of territorial scope. This raises the evidentiary concerns I have just expressed.\n\nMoreover, Fiji notes that the right to self-determination is a relative right. It should not involve changes to existing frontiers. In the context of Israel/Palestine, this means that the Court would need to ascertain whether the Palestinians’ exercise of their right to self-determination has infringed the territorial integrity, political inviolability or legitimate security needs of the State of Israel.\n\nBy asking the Court to look only at the policies and practices of Israel, resolution 77/247 shields from the Court’s purview the policies and practices of Palestine. The result, in Fiji’s submission, is that the Court simply does not have before it sufficient information concerning the policies and practices of Palestine, and thus is unable to make a judicial determination on whether, in exercise of their right to self-determination, Palestine has infringed the sovereignty of the State of Israel."
    },
    {
        "voto": 0,
        "juez": "Republic of Fiji",
        "pregunta": "Israel is under an obligation to terminate its breaches of international law; it is under an obligation to cease forthwith the works of construction of the wall being built in the Occupied Palestinian Territory, including in and around East Jerusalem, to dismantle forthwith the structure therein situated, and to repeal or render ineffective forthwith all legislative and regulatory acts relating thereto, in accordance with paragraph 151 of this Opinion",
        "texto": "First, withdrawal and security. Palestine argues that the occupation is illegal and the legal consequence is that Israel must withdraw from the occupied territories. As highlighted earlier, any assessment of the questions posed would require the Court to consider the legal rights and obligations of both parties under the Oslo Accords.\n\nThe Oslo Accords were built upon Security Council resolutions 242 and 338, which were adopted following the 1967 and 1973 Arab-Israeli Wars. They recognize the legitimate security needs of Israel to prevent further attack.\n\nResolutions 242 and 338, and thus the Oslo Accords, do not oblige Israel to withdraw from all the territories.\n\nFurther, resolutions 242 and 338 refer to peace being established by the application of two mutually dependent principles: “(i) Withdrawal of Israeli armed forces from territories occupied in the recent conflict; and (ii) Termination of all claims or states of belligerency and respect for and acknowledgment of the sovereignty, territorial integrity and political independence of every State in the area and their right to live in peace within secure and recognized boundaries free from threats or acts of force.”\n\nBy incorporating these resolutions into the Oslo Accords, the parties recognize that Israel’s withdrawal and the creation of conditions providing security to Israel are interdependent. As Judge Higgins stated in the Wall Opinion, both “Israel and Palestine [need] to move in parallel to secure the necessary conditions for Israel to withdraw from Arab occupied territory and for Palestine to provide the conditions to allow Israel to feel secure in so doing”.\n\nIn other words, if the Court is to consider the legal consequences of the alleged Israeli refusal to withdraw from territory, it should also look at what Palestine must do to ensure Israel’s security.\n\nMr President and Members of this honourable Court, the events of 7 October 2023 have shown us what could happen if there were a complete and unconditional withdrawal without the necessary arrangements in place to guarantee the security of Israel and its population. At the very least, the Court would need to examine and evaluate evidence concerning the question whether the in turn would require examination of the threats facing Israel emanating from the occupied territories and the broader region."
    }
]
