[
    {
        "voto": 1,
        "juez": "Spain",
        "pregunta": "Finds that it has jurisdiction to give the advisory opinion requested",
        "texto": "The competence of the Court to give the advisory opinion requested by the General Assembly in its resolution 77/247 is based on Article 65, paragraph 1, of its Statute. The General Assembly, which seeks the advisory opinion, is authorized to do so by Article 96, paragraph 1, of the Charter.\n\nThe questions are directed to the legal consequences arising from a given factual situation considering international law. It is indeed a question of legal character. Therefore, Spain is of the view that the Court has jurisdiction to give the advisory opinion requested by resolution 77/247 of the General Assembly.\n\nThe lack of consent to the Court’s contentious jurisdiction by an interested State has no bearing on the Court’s jurisdiction to give an advisory opinion.\n\nThe goal of the request before the Court is to obtain from it an advisory opinion which the General Assembly deems of assistance to it for the proper exercise of its functions and responsibilities."
    },
    {
        "voto": 1,
        "juez": "Spain",
        "pregunta": "The construction of the wall being built by Israel, the occupying Power, in the Occupied Palestinian Territory, including in and around East Jerusalem, and its associated régime, are contrary to international law",
        "texto": "Mr President, distinguished Members of the Court, the International Law Commission, in the report of its seventy-third session, has referred to the basic rules of international humanitarian law as having the status of a peremptory norm of general international law (ius cogens), with the legal consequences that that status may entail.\n\nThe provisions of the Hague Regulations, annexed to the Fourth Hague Convention of 1907, to which Israel is not a party, have become nevertheless part of customary international law. Particularly pertinent in the present case is Section III of those Regulations, which concerns “Military authority over the territory of the hostile State”. Furthermore, the Fourth Geneva Convention, to which Israel is a party, is applicable in any occupied territory in the event of an armed conflict and, as the Court has assessed, it is applicable to the territories occupied by Israel since 1967, including East Jerusalem.\n\nRegarding Israeli settlements, Article 49, paragraph 6, of the Fourth Geneva Convention provides that “[t]he Occupying Power shall not deport or transfer parts of its own civilian population into the territory it occupies”. It prohibits also any measure taken by an occupying Power in order to organize or encourage transfer of parts of its own population into the occupied territory. Since 1977, Israel has conducted a policy and developed practices involving the establishment of settlements in the occupied Palestinian territories which are in contravention of the aforementioned Article 49, paragraph 6. Therefore, the Israeli settlements in the occupied Palestinian territories, including East Jerusalem, have no legal validity and constitute a flagrant violation of international law and a major obstacle to the achievement of the two-State solution, as stated repeatedly by relevant United Nations Security Council resolutions. The establishment of the Israeli settlements in the occupied Palestinian territories is tending to alter the demographic composition of that territory, contributing to demographic changes, all in contravention of Article 49, paragraph 6, of the Fourth Geneva Convention.\n\nThe practice of demolitions results in the forcible transfer or forced eviction of Palestinians and impedes a de facto return of Palestinian families and communities to their original dwellings, all in contravention of international humanitarian law.\n\nFurthermore, in 2004 the Court considered that the construction of the wall and its associated régime create a “fait accompli” on the ground that could well become permanent, in which case it would be tantamount to a de facto annexation, as well as a contribution to further alterations of the demographic composition of the occupied Palestinian territories.\n\nArticles 47, 49, 52, 53 and 59 of the Fourth Geneva Convention remain applicable to the occupied Palestinian territories and are to be taken into account in this case.\nSpain is of the view that neither Article 51 of the United Nations Charter, nor the state of necessity, have any relevance in this case in order to preclude the wrongfulness of those actions."
    },
    {
        "voto": 1,
        "juez": "Spain",
        "pregunta": "Israel is under an obligation to terminate its breaches of international law; it is under an obligation to cease forthwith the works of construction of the wall being built in the Occupied Palestinian Territory, including in and around East Jerusalem, to dismantle forthwith the structure therein situated, and to repeal or render ineffective forthwith all legislative and regulatory acts relating thereto, in accordance with paragraph 151 of this Opinion",
        "texto": "Mr President, distinguished Members of the Court, both Israel and Palestine are under the obligation to observe the rules of international law.\n\nProhibition of the use of force, illegal territorial acquisition and principle of self-determination\n\nIn the 1967 armed conflict, Israeli forces occupied all the territories that had constituted Palestine under the British Mandate (including those known as the West Bank) located east of the Green Line. This occupation was immediately and unanimously condemned by Security Council resolution 242 (1967), which underlined that “all Member States, in accepting the Charter of the United Nations, have undertaken to act in accordance with Article 2 of the Charter”.\n\nThe principle of prohibition of the use of armed force is one of the fundamental principles of international law and, as formulated in General Assembly resolution 2625 (XXV), is accompanied by the following corollary: “No territorial acquisition resulting from the threat or use of force shall be recognized as legal”. The Court, which has on several occasions affirmed the importance of this principle has not hesitated to apply this principle to the Israeli occupation of the Palestinian territories. In the Advisory Opinion on the Legal Consequences of the Construction of a Wall in the Occupied Palestinian Territories (2004), the Court has recalled the principle of the inadmissibility of the acquisition of territory by war. The Court concluded: “Under customary international law, these were therefore occupied territories in which Israel had the status of an occupying Power”.\n\nFinally, the Court added: “Subsequent events in these territories have done nothing to alter this situation. All these territories (including East Jerusalem) remain occupied territories and Israel has continued to have the status of occupying Power”. Although Israel finally withdrew its civilian and military presence from the Gaza Strip in 2005, it has maintained full control of its borders, coastline and airspace ever since. Consequently, as the Security Council has affirmed, the Gaza Strip constitutes an integral part of the territory occupied in 1967.\n\nThe Court concluded that Israel’s settlement policies in the Occupied Palestinian Territory, the measures taken with regard to Jerusalem and the construction of the wall have been established in violation of international law, not only because they are contrary to the Fourth Geneva Convention, but also because they prevent the exercise by the Palestinian people of their right to self-determination. In its construction, the Court points out that the wall, the temporary nature of which is open to doubt, is accompanied by a regulatory régime aimed at annexing the occupied territories. This aim constitutes a serious violation of the rules of international humanitarian law incumbent upon Israel as the occupying Power, has the effect of violating the right to self-determination of the Palestinian people, and the human rights of the inhabitants of these territories. These statements are also applicable to the Gaza Strip. Israel’s withdrawal from Gaza in 2005 has not meant that the occupation of the territory came to an end, as Israel has retained effective control over the territory through its control of airspace, territorial sea and external land boundaries.\n\nThe extensive documentation submitted to this advisory procedure demonstrates that, 20 years after the Court’s Opinion, Israel continues to implement its policies, prolonging the very serious violations of international law found by the Court.\n\nMr President, distinguished Members of the Court, on 3 October 1991, Israel ratified both the International Covenant on Economic, Social and Cultural Rights and the International Covenant on Civil and Political Rights, as well as the United Nations Convention on the Rights of the Child. As stated by the Court, the protection offered by human rights conventions does not cease in case of armed conflict.\n\nRegarding the territorial scope of those instruments, they are applicable in respect of acts executed by a State in the exercise of its jurisdiction outside its own territory, that is, that they apply both to territories over which a State party has sovereignty and to those over which that State exercises territorial jurisdiction.\n\nThose elements concur in this case; therefore, Spain considers that those instruments are applicable within the Occupied Palestinian Territory.\n\nAs stated by the Court in its Advisory Opinion of 2004, the territories occupied by Israel have been now, for over 50 years, subject to its territorial jurisdiction as the occupying Power. In the exercise of the powers available to it on this basis, Israel is bound by the provisions of human rights law and, furthermore, it is under an obligation not to raise any obstacle to the exercise of such rights in those fields where competence has been transferred to Palestinian authorities.\n\nHaving determined the applicability of human rights law within the Occupied Palestinian Territory, it is time to seek whether Israeli policies and practices referred to in paragraph 18 of General Assembly resolution 77/247 have violated those rules and, therefore, have infringed the human rights of Palestinians living in the territory occupied by Israel. Among those rights that are being violated are those of Articles 17 and 12 of the International Covenant on Civil and Political Rights.\n\nAlso, the Special Rapporteur on the situation of human rights in the Palestinian territories occupied since 1967 has underlined in her latest report to the Human Rights Council that Israeli forces often detain individuals without charge or trial, in what has been denominated “administrative detention”. Administrative detention is permissible only under very strict circumstances and must always be carried out in line with the protection afforded under international law.\n\nPalestinians in the occupied Palestinian territories are subject to a system of jurisdictional fragmentation in the context of a structure of institutionalized discrimination. Israeli military courts enforce military law upon Palestinians, while Israeli courts apply Israeli civil law to Israelis, including settlers.\n\nRegarding the International Covenant on Economic, Social and Cultural Rights, there are several provisions affected by Israel’s policies and practices in the occupied Palestinian territories, for example: the right to work (Articles 6 and 7); protection and assistance accorded to the family and to children and young persons (Article 10); the right to an adequate standard of living, including adequate food, clothing and housing, and the right “to be free from hunger” (Article 11); the right to health (Article 12) and the right to education (Articles 13 and 14). Similar provisions can be found in Articles 14, 16, 27 and 28 of the United Nations Convention on the Rights of the Child.\n\nState parties to the Convention on the Rights of the Child, according to its Article 2, shall respect and ensure the rights set forth in it to each child within their jurisdiction. Of particular concern are the detention, interrogation, prosecution and imprisonment of numerous Palestinian children by Israeli occupation forces, practice that is contrary to Article 37 of that Convention.\n\nCertain policies and practices of Israel in the occupied Palestinian territories impose restrictions on the freedom of movement of the inhabitants of the occupied Palestinian territories, and deprive a significant number of Palestinians of their freedom to choose their residence and have, as well, repercussions for agricultural production, through the confiscation and destruction of agricultural assets. On the other hand, the population of the occupied Palestinian territories is experiencing increasing difficulties regarding access to health services, educational facilities and sources of water, impeding the exercise by the persons concerned of the right to health, to education, to water, to sanitation and to an adequate standard of living. All these difficulties and restrictions infringe a number of rights of Palestinians residing in the territory occupied by Israel which cannot be justified neither by military exigencies, nor by the requirements of national security or public order.\n\nMr President, distinguished Members of the Court, what are the legal consequences arising from the repeated, permanent and aggravated non-compliance of core rules of international law? This is the question the General Assembly requested to the Court. When this question is examined from the perspective of the law of State responsibility, the importance of the advisory opinion becomes critical.\n\nArticles 40 and 41 of the 2001 Draft Articles on Responsibility of States for Internationally Wrongful Acts answer this question.\nAccording to these Articles, a serious breach of an obligation established for the protection of the interests of the international community as a whole entails the legal consequences stipulated for all breaches of international law and some particular consequences.\nTherefore, the responsible State is obliged to cease the wrongful act, to give, if appropriate, guarantees and assurances of non-repetition, and to make reparation.\nMoreover, the responsible State is bound to continue performance of the international obligation.\n\nOn the other hand, failure to comply with international obligations gives also rise to the right for the injured State to seek redress or take countermeasures.\nHowever, it has been said, Article 41 states that, besides these “ordinary” consequences, serious breaches of ius cogens rules gives rise to some additional particular consequences, which, generally speaking, imply certain obligations for all other States to respond to the wrongful act: namely obligation to co-operate with and bring to an end the alleged violation, obligation not to recognize the illegal situation and obligation not to render aid or assistance in maintaining the situation.\n\nMr President, my intervention will focus on these particular obligations of all States (other than the injured State). In its 2004 Advisory Opinion on the Wall, the Court briefly referred to these additional consequences.\n\nTwenty years later, with the worsening of the situation in the Occupied Palestinian Territory, the Court is called upon to set out in greater detail these obligations.\n\nMr President, distinguished Members of the Court, the duty to co-operate to bring to an end remains the first obligation of States, according to Article 41 of the Draft Articles. This obligation to co-operate shall be carried out by all States.\nIn the Israeli-Palestinian conflict, co-operation among all States has been organized in the framework of the United Nations.\nOnce again, 20 years after the Advisory Opinion on the Wall was passed, it is an indisputable reality that the situation in Palestine has worsened; and that resolutions of the Security Council and the General Assembly have repeatedly condemned the actions of the parties and repeatedly demanded the cessation of the violations of international law. However, such resolutions have failed to establish redress and sanction measures.\n\nTherefore, the reference of Article 41 to the action of all States becomes critical. In some way paragraph 159 of the Advisory Opinion on the Wall underlines this when this paragraph establishes that “it is also for all States” to take measures to end the breach. Moreover, in the comments to Conclusion 19 of the Draft conclusions on identification and legal consequences of peremptory norms of general international law (ius cogens), we can read that this statement suggests “that, over and above collective action, there is an obligation on individual States to make efforts to bring situations created by the breach to an end”.\n\nIn the current circumstances, maybe the Court could determine what such an obligation to co-operate might consist of in this case.\nIn doing so, the Court may take into consideration the numerous resolutions of the Security Council and the General Assembly, especially those resolutions stating that States are obliged not to take measures that would imply changes in the status of the occupied territories, including East Jerusalem and the Gaza Strip. The corollary is clear: “establishing diplomatic missions in the Holy City” is a serious threat to the stability of peace in the region and the world.\n\nComing back to the co-operation of all States within the bodies of the United Nations, the Court could determine whether the obligation of all States to co-operate to bring to an end any serious violations of peremptory norms entails, within the Security Council in particular, the duty to not prevent, hinder or delay collective action in favour of the peaceful resolution of the conflict.\n6. Mr President, let me move on now to consider the two particular duties included in Article 41, paragraph 2, of the 2001 Draft Articles: namely the duty not to recognize the illegal situation and the duty not to render aid or assistance in maintaining this situation.\n\nWhat situation?\n\nThe last resolutions adopted by the Security Council and the General Assembly on the IsraeliPalestinian conflict update the scope of the current situation that should not be legally recognized.\nCertainly, resolution 74/88 of the General Assembly, the first one including this formula, “[c]alls upon all States... not to recognize, and not to render aid or assistance in maintaining, the situation created by measures that are illegal under international law, including those aimed at advancing annexation in the Occupied Palestinian Territory”.\nSince these two obligations have been reiterated by the Court and other United Nations bodies in this, but also in other situations, they are to be considered as customary law (something that by the way the International Law Commission has already affirmed).\n\nFinally, let me, Mr President, refer briefly to paragraph 3 of Article 41 of the Draft Articles, which states that international law may recognize additional legal consequences deriving from the legal régime to which the primary rule that has been violated belongs.\nThese particular obligations can be found either in the foundation of the legal régime particular or in Security Council resolutions.\n\nArticles 47 and 146 of the Fourth Geneva Convention are good examples of obligations provided for in the foundational treaties of a concrete, a particular legal régime, like international humanitarian law. While Article 47 establishes the inviolability of the rights of persons in occupied territories, Article 146 refers to the obligation of the States parties to the Convention to prosecute and condemn persons who commit or order to be committed any of the grave breaches of the Geneva Convention.\n\nThat said, these obligations linked to a particular legal régime sometimes are specified by the Security Council itself. This is the case of resolution 2334 (2016) which requires a State to distinguish in their relevant dealings between the territory of the State of Israel and the territories occupied since 1967.\n\nMr President, distinguished Members of the Court, Spain formulates these considerations within the framework of a consultative procedure, aware that the Court  guardian of international legality can offer the United Nations arguments to adopt decisions to address the situation and, at the same time, contribute to the clarification and development of the international legal order."
    },
    {
        "voto": 1,
        "juez": "Spain",
        "pregunta": "Israel is under an obligation to make reparation for all damage caused by the construction of the wall in the Occupied Palestinian Territory, including in and around East Jerusalem",
        "texto": "Mr President, distinguished Members of the Court, what are the legal consequences arising from the repeated, permanent and aggravated non-compliance of core rules of international law? This is the question the General Assembly requested to the Court. When this question is examined from the perspective of the law of State responsibility, the importance of the advisory opinion becomes critical.\n\nArticles 40 and 41 of the 2001 Draft Articles on Responsibility of States for Internationally Wrongful Acts answer this question. According to these Articles, a serious breach of an obligation established for the protection of the interests of the international community as a whole entails the legal consequences stipulated for all breaches of international law and some particular consequences. Therefore, the responsible State is obliged to cease the wrongful act, to give, if appropriate, guarantees and assurances of non-repetition, and to make reparation. Moreover, the responsible State is bound to continue performance of the international obligation.\n\nOn the other hand, failure to comply with international obligations gives also rise to the right for the injured State to seek redress or take countermeasures. However, it has been said, Article 41 states that, besides these “ordinary” consequences, serious breaches of ius cogens rules gives rise to some additional particular consequences, which, generally speaking, imply certain obligations for all other States to respond to the wrongful act: namely obligation to co-operate with and bring to an end the alleged violation, obligation not to recognize the illegal situation and obligation not to render aid or assistance in maintaining the situation.\n\nMr President, my intervention will focus on these particular obligations of all States (other than the injured State). In its 2004 Advisory Opinion on the Wall, the Court briefly referred to these additional consequences.\n\nTwenty years later, with the worsening of the situation in the Occupied Palestinian Territory, the Court is called upon to set out in greater detail these obligations.\n\nMr President, distinguished Members of the Court, the duty to co-operate to bring to an end remains the first obligation of States, according to Article 41 of the Draft Articles. This obligation to co-operate shall be carried out by all States. In the Israeli-Palestinian conflict, co-operation among all States has been organized in the framework of the United Nations. Once again, 20 years after the Advisory Opinion on the Wall was passed, it is an indisputable reality that the situation in Palestine has worsened; and that resolutions of the Security Council and the General Assembly have repeatedly condemned the actions of the parties and repeatedly demanded the cessation of the violations of international law. However, such resolutions have failed to establish redress and sanction measures.\n\nTherefore, the reference of Article 41 to the action of all States becomes critical. In some way paragraph 159 of the Advisory Opinion on the Wall underlines this when this paragraph establishes that “it is also for all States” to take measures to end the breach. Moreover, in the comments to Conclusion 19 of the Draft conclusions on identification and legal consequences of peremptory norms of general international law (ius cogens), we can read that this statement suggests “that, over and above collective action, there is an obligation on individual States to make efforts to bring situations created by the breach to an end”.\n\nIn the current circumstances, maybe the Court could determine what such an obligation to co-operate might consist of in this case. In doing so, the Court may take into consideration the numerous resolutions of the Security Council and the General Assembly, especially those resolutions stating that States are obliged not to take measures that would imply changes in the status of the occupied territories, including East Jerusalem and the Gaza Strip. The corollary is clear: “establishing diplomatic missions in the Holy City” is a serious threat to the stability of peace in the region and the world.\n\nComing back to the co-operation of all States within the bodies of the United Nations, the Court could determine whether the obligation of all States to co-operate to bring to an end any serious violations of peremptory norms entails, within the Security Council in particular, the duty to not prevent, hinder or delay collective action in favour of the peaceful resolution of the conflict. 6. Mr President, let me move on now to consider the two particular duties included in Article 41, paragraph 2, of the 2001 Draft Articles: namely the duty not to recognize the illegal situation and the duty not to render aid or assistance in maintaining this situation.\n\nWhat situation?\n\nThe last resolutions adopted by the Security Council and the General Assembly on the Israeli-Palestinian conflict update the scope of the current situation that should not be legally recognized. Certainly, resolution 74/88 of the General Assembly, the first one including this formula, “[c]alls upon all States... not to recognize, and not to render aid or assistance in maintaining, the situation created by measures that are illegal under international law, including those aimed at advancing annexation in the Occupied Palestinian Territory”. Since these two obligations have been reiterated by the Court and other United Nations bodies in this, but also in other situations, they are to be considered as customary law (something that by the way the International Law Commission has already affirmed).\n\nFinally, let me, Mr President, refer briefly to paragraph 3 of Article 41 of the Draft Articles, which states that international law may recognize additional legal consequences deriving from the legal régime to which the primary rule that has been violated belongs. These particular obligations can be found either in the foundation of the legal régime particular or in Security Council resolutions.\n\nArticles 47 and 146 of the Fourth Geneva Convention are good examples of obligations provided for in the foundational treaties of a concrete, a particular legal régime, like international humanitarian law. While Article 47 establishes the inviolability of the rights of persons in occupied territories, Article 146 refers to the obligation of the States parties to the Convention to prosecute and condemn persons who commit or order to be committed any of the grave breaches of the Geneva Convention.\n\nThat said, these obligations linked to a particular legal régime sometimes are specified by the Security Council itself. This is the case of resolution 2334 (2016) which requires a State to distinguish in their relevant dealings between the territory of the State of Israel and the territories occupied since 1967.\n\nMr President, distinguished Members of the Court, Spain formulates these considerations within the framework of a consultative procedure, aware that the Court guardian of international legality can offer the United Nations arguments to adopt decisions to address the situation and, at the same time, contribute to the clarification and development of the international legal order."
    },
    {
        "voto": 1,
        "juez": "Spain",
        "pregunta": "All States are under an obligation not to recognize the illegal situation resulting from the construction of the wall and not to render aid or assistance in maintaining the situation created by such construction; all States parties to the Fourth Geneva Convention relative to the Protection of Civilian Persons in Time of War of 12 August 1949 have in addition the obligation, while respecting the United Nations Charter and international law, to ensure compliance by Israel with international humanitarian law as embodied in that Convention",
        "texto": "Mr President, distinguished Members of the Court, what are the legal consequences arising from the repeated, permanent and aggravated non-compliance of core rules of international law? This is the question the General Assembly requested to the Court. When this question is examined from the perspective of the law of State responsibility, the importance of the advisory opinion becomes critical.\n\nArticles 40 and 41 of the 2001 Draft Articles on Responsibility of States for Internationally Wrongful Acts answer this question. According to these Articles, a serious breach of an obligation established for the protection of the interests of the international community as a whole entails the legal consequences stipulated for all breaches of international law and some particular consequences. Therefore, the responsible State is obliged to cease the wrongful act, to give, if appropriate, guarantees and assurances of non-repetition, and to make reparation. Moreover, the responsible State is bound to continue performance of the international obligation.\n\nOn the other hand, failure to comply with international obligations gives also rise to the right for the injured State to seek redress or take countermeasures. However, it has been said, Article 41 states that, besides these “ordinary” consequences, serious breaches of ius cogens rules gives rise to some additional particular consequences, which, generally speaking, imply certain obligations for all other States to respond to the wrongful act: namely obligation to co-operate with and bring to an end the alleged violation, obligation not to recognize the illegal situation and obligation not to render aid or assistance in maintaining the situation.\n\nMr President, my intervention will focus on these particular obligations of all States (other than the injured State). In its 2004 Advisory Opinion on the Wall, the Court briefly referred to these additional consequences.\n\nTwenty years later, with the worsening of the situation in the Occupied Palestinian Territory, the Court is called upon to set out in greater detail these obligations.\n\nMr President, distinguished Members of the Court, the duty to co-operate to bring to an end remains the first obligation of States, according to Article 41 of the Draft Articles. This obligation to co-operate shall be carried out by all States. In the Israeli-Palestinian conflict, co-operation among all States has been organized in the framework of the United Nations. Once again, 20 years after the Advisory Opinion on the Wall was passed, it is an indisputable reality that the situation in Palestine has worsened; and that resolutions of the Security Council and the General Assembly have repeatedly condemned the actions of the parties and repeatedly demanded the cessation of the violations of international law. However, such resolutions have failed to establish redress and sanction measures.\n\nTherefore, the reference of Article 41 to the action of all States becomes critical. In some way paragraph 159 of the Advisory Opinion on the Wall underlines this when this paragraph establishes that “it is also for all States” to take measures to end the breach. Moreover, in the comments to Conclusion 19 of the Draft conclusions on identification and legal consequences of peremptory norms of general international law (ius cogens), we can read that this statement suggests “that, over and above collective action, there is an obligation on individual States to make efforts to bring situations created by the breach to an end”.\n\nIn the current circumstances, maybe the Court could determine what such an obligation to co-operate might consist of in this case. In doing so, the Court may take into consideration the numerous resolutions of the Security Council and the General Assembly, especially those resolutions stating that States are obliged not to take measures that would imply changes in the status of the occupied territories, including East Jerusalem and the Gaza Strip. The corollary is clear: “establishing diplomatic missions in the Holy City” is a serious threat to the stability of peace in the region and the world.\n\nComing back to the co-operation of all States within the bodies of the United Nations, the Court could determine whether the obligation of all States to co-operate to bring to an end any serious violations of peremptory norms entails, within the Security Council in particular, the duty to not prevent, hinder or delay collective action in favour of the peaceful resolution of the conflict. 6. Mr President, let me move on now to consider the two particular duties included in Article 41, paragraph 2, of the 2001 Draft Articles: namely the duty not to recognize the illegal situation and the duty not to render aid or assistance in maintaining this situation.\n\nWhat situation?\n\nThe last resolutions adopted by the Security Council and the General Assembly on the IsraeliPalestinian conflict update the scope of the current situation that should not be legally recognized. Certainly, resolution 74/88 of the General Assembly, the first one including this formula, “[c]alls upon all States... not to recognize, and not to render aid or assistance in maintaining, the situation created by measures that are illegal under international law, including those aimed at advancing annexation in the Occupied Palestinian Territory”. Since these two obligations have been reiterated by the Court and other United Nations bodies in this, but also in other situations, they are to be considered as customary law (something that by the way the International Law Commission has already affirmed).\n\nFinally, let me, Mr President, refer briefly to paragraph 3 of Article 41 of the Draft Articles, which states that international law may recognize additional legal consequences deriving from the legal régime to which the primary rule that has been violated belongs. These particular obligations can be found either in the foundation of the legal régime particular or in Security Council resolutions.\n\nArticles 47 and 146 of the Fourth Geneva Convention are good examples of obligations provided for in the foundational treaties of a concrete, a particular legal régime, like international humanitarian law. While Article 47 establishes the inviolability of the rights of persons in occupied territories, Article 146 refers to the obligation of the States parties to the Convention to prosecute and condemn persons who commit or order to be committed any of the grave breaches of the Geneva Convention.\n\nThat said, these obligations linked to a particular legal régime sometimes are specified by the Security Council itself. This is the case of resolution 2334 (2016) which requires a State to distinguish in their relevant dealings between the territory of the State of Israel and the territories occupied since 1967.\n\nMr President, distinguished Members of the Court, Spain formulates these considerations within the framework of a consultative procedure, aware that the Court  guardian of international legality can offer the United Nations arguments to adopt decisions to address the situation and, at the same time, contribute to the clarification and development of the international legal order."
    }
]


