[
    {
        "voto": 1,
        "juez": "Palestine",
        "pregunta": "Finds that it has jurisdiction to give the advisory opinion requested",
        "texto": "With regard to the Quartet, it has expressed its concerns about the Wall. Moreover, despite the implication in one Statement to the Court that the members of the Quartet are in agreement that an advisory opinion would likely hinder the peace process, it should be clarified that there is no agreement among the Quartet with regard to asking the Court not to render the requested advisory opinion. The Statement of the Russian Federation does not ask the Court to refuse to give an opinion. The Statement of the United Nations does not do so. Nor does the European Union Statement. Ireland’s Minister for Foreign Affairs affirmed this in the Irish Senate on 4 February 2004, stating that “Contrary to some press reports, the EU has not asked the ICJ to refrain from issuing an Advisory Opinion. There would have been no consensus to adopt such a position.”4 Indeed, we even doubt whether the Statement of the United States could be characterized as such. Some States have said that an advisory opinion could harm the final status issues that should be left to the parties for negotiation. It is clearly Israeli actions in the Occupied Palestinian Territory, and not any Court opinion, that will constitute illegal facts on the ground in relation to final status issues. Nevertheless, we do agree that the Court is not being asked to advise on solutions for the final status, although it will undoubtedly be necessary to make some reference to final status issues due to the intricate relationship between the Wall and the settlements and the character and route of the Wall in and around East Jerusalem. First, Israel objects that: “the request is ultra vires the competence of the 10th Emergency Special Session and/or the General Assembly... [as] there was no failure by the Security Council to act”. There is an initial and simple answer to this. The General Assembly’s request for this opinion was made in a validly adopted resolution. In the Namibia case, you said: “A resolution of a properly constituted organ of the United Nations which is passed in accordance with that organ’s rules of procedure, and is declared by its President to have been so passed, must be presumed to have been validly adopted.”10 I stress that this is not a matter of fundamental competence but of internal procedure, to use the distinction you drew in the Use of Nuclear Weapons11 Advisory Opinion. But if it is necessary to go beyond this, the answer is still quite clear. Ambassador Al-Kidwa has outlined the circumstances surrounding the General Assembly’s request. In the light of what he has said, nothing in the Uniting For Peace Resolution prevented the Assembly’s adoption of this request. The request does not of course require the Court to take “action” within the meaning of Article 11, paragraph 2, of the Charter, nor did it involve such “action” by the General Assembly. No question involving the Charter distribution of authority between the General Assembly and the Security Council is raised. Again, I quote your words: “The Court considers that the kind of action referred to in Article 11, paragraph 2, is coercive or enforcement action... The word ‘action’ must mean such action as is solely within the province of the Security Council.”12 Requesting this advisory opinion is not solely within the province of the Security Council13. It is as simple as that. I turn to the other general objections. The starting point here is that the Court “should not, in principle, refuse to give an advisory opinion”, as you have many times said. As you recalled in Threat or Use of Nuclear Weapons: “In accordance with the... jurisprudence of the Court, only ‘compelling reasons’ could lead it to such a refusal... There has been no refusal, based on the discretionary power of the Court, to act upon a request for an advisory opinion in the history of the present Court...” This position applies even more powerfully to the General Assembly, which the Charter expressly authorizes to request “an advisory opinion upon any legal question”15. And there can be no doubt that the question asked of the Court is a legal question, as you have consistently defined that term. Then it is said that the opinion is not useful. According to one statement: “there is a striking degree of consensus amongst those most closely involved in promoting the peace process in the Middle East that an advisory opinion would be of no assistance and would be likely to be unhelpful”. The first point to note is that this conclusory statement is untrue. Ambassador Al-Kidwa has shown that there was no consensus within the European Union or among the Quartet that the Court should decline to give an advisory opinion. Furthermore the Court gives an advisory opinion to the organ which requests it, not to a self-appointed group of States. You made this point in the Peace Treaties Opinion23, and you have repeated it frequently since24. And as you said in Threat or Use of Nuclear Weapons: “it is not for the Court itself to purport to decide whether or not an advisory opinion is needed by the Assembly for the performance of its functions. The General Assembly has the right to decide for itself on the usefulness of an opinion in the light of its own needs.” The first of these issues is that of consent. Australia objects that: “The effect of the request is to bring key elements of the Israeli-Palestinian conflict before the Court for determination without the consent of Israel.” But South Africa did not consent to the Namibia request, Spain did not consent to the Western Sahara request, Romania did not consent to the Mazilu request, Malaysia did not consent to the Cumaraswamy request. All those requests involved the responsibility of a particular State. Yet you gave the Opinions. As you said in Western Sahara: “In the present case, Spain is a Member of the United Nations and has accepted the provisions of the Charter and Statute; it has thereby in general given its consent to the exercise by the Court of its advisory jurisdiction.”26 Moreover Israel cannot object, any more than could Spain, to the exercise by the General Assembly of its competence in the field of self-determination. It cannot object to the General Assembly dealing with the situation of Palestine. These competences of the General Assembly were exercised even before Israel came into existence, notably in the passage of the Partition Resolution, General Assembly resolution 181(II) which signalled the wish of the international community that Israel come into existence. The General Assembly has always had a vitally important role in relation to Palestine — as it had in relation to the other former mandated territory left over after 1945, South West Africa. This is a key aspect of the role it has consistently exercised with respect to dependent and colonized peoples ever since 1945. Israel and Palestine are not two States Members of the United Nations and the dispute over the Wall is not a pre-existing bilateral dispute on a matter falling in principle within Israel’s domestic jurisdiction. That was the situation in the Eastern Carelia case. It is not the situation here. There is no pre-existing bilateral dispute arising between Israel and Palestine, no dispute which (to use your words in Western Sahara) arose “independently in bilateral relations”27. There is no trace in the record of such a prior, independent bilateral dispute. Rather the Wall is an attempt by Israel to impose a unilateral settlement in relation to a multilateral conflict and to do so in violation of fundamental obligations, obligations erga omnes. These relate to humanitarian law and human rights, including self-determination. The people of Palestine have an unfulfilled right to self-determination. Israel cannot veto or negate the interest of the General Assembly in having a legal answer to the question asked. Indeed that interest, and the General Assembly’s long-standing and legitimate institutional role, is a compelling reason for answering the question — as it was in Western Sahara, on a much more abstract question. This brings me to my final point, which is the impact of the request on the Road Map and on future status negotiations. The United States expresses the point in the following way: “The United States... and the other members of the Quartet are deeply involved in efforts to advance those negotiations, with the support and encouragement of the Security Council and the General Assembly. It would be extremely damaging to future negotiating efforts if the Court were to set forth, even on a non-binding advisory basis, legal conclusions with respect to permanent status issues.” Now formulated in these terms this is not an objection to your giving the request at all. It is a cautionary note as to the permanent status issues. In this moderate formulation (certain Written Statements were more extreme), it goes to the content of the Opinion, not to the question whether you should give it at all. And this recalls an answer you gave to an analogous objection in Threat or Use of Nuclear Weapons. You said: “It has also been submitted that a reply from the Court in this case might adversely affect disarmament negotiations... The Court is aware that, no matter what might be its conclusions... they... would present an additional element in the negotiations on the matter. Beyond that, the effect of the opinion is a matter of appreciation... The Court cannot regard this factor as a compelling reason to decline to exercise its jurisdiction.” In the present case the relationship between the Road Map and the Wall can be put in a couple of sentences. The Road Map is a project for the final settlement to be reached by agreement of interested parties, including Palestine. Substantively it has its origins in United Nations resolutions going back to Security Council resolution 242. The Wall is not in the Road Map. Indeed it is the Wall itself which is inconsistent with the Road Map, and the Wall, if allowed to be completed, will destroy the Road Map. The request, and the Court’s opinion, can only support the multilateral process presently embodied in the Road Map. There is a further point, equally fundamental. The question you are asked relates to the present situation, not the future. You are not asked what the content of the final settlement should be. You are not asked to determine the boundaries of a future Palestinian State. It is sufficient for the purposes of this opinion that the Wall is being constructed for the most part, and indisputably, in the Occupied Palestinian Territory. That is not a negative point, it is a positive point. In determining the present legality of the Wall in relation to the powers of Israel over the Occupied Palestinian Territory, you will be helping to elucidate and thereby to preserve the legal status quo pending the final status negotiations. You are asked to give an authoritative legal opinion on the legal consequences of the construction of the Wall now. Your answer will be relevant to existing questions of legal status and its consequences. This will help to secure the foundations for a future agreement — unlike the Wall, which undermines those foundations."
    },
    {
        "voto": 1,
        "juez": "Palestine",
        "pregunta": "Decides to comply with the request for an advisory opinion",
        "texto": "Mr. President, Members of the Court, on behalf of Palestine, the Palestinian people and their leadership, I respectfully request the Court to give full consideration to the gravity of this situation and to the importance of an advisory opinion at this critical moment. In your most recent address before the General Assembly, Mr. President, you underlined the role of the Court as the “guardian of international law” and you assured the Assembly “that the Court will pursue its efforts to respond to the hopes placed in it”. The Palestinian people have great hopes for this proceeding and have full confidence that the Court will help the General Assembly to carry out its functions by rendering the advisory opinion. This would allow the Assembly to make its own substantial contribution in response to Israel’s continued construction of the Wall and the ensuing threats to the prospects for peace between the two peoples. It is our firm belief that such an advisory opinion can lead to positive developments and perhaps even a chain of events similar to that resulting from the Court’s Advisory Opinion on Namibia.\n\nThen it is objected that the request “politicizes the Court” and that the Court should therefore refuse to give the opinion17. But as you said in Threat or Use of Nuclear Weapons: “Whatever its political aspects, the Court cannot refuse to admit the legal character of a question which invites it to discharge an essentially judicial task, namely, an assessment of the legality of the possible conduct of States with regard to the obligations imposed upon them by international law.”\n\nIndeed, as you noted in the WHO Regional Headquarters Advisory Opinion: “in situations in which political considerations are prominent it may be particularly necessary for an international organization to obtain an advisory opinion from the Court as to the legal principles applicable to the matter under debate...” particularly.\n\nThen it is objected that the General Assembly has already made up its mind and so you should remain silent. According to one statement: “An opinion by the Court would provide no guidance to the General Assembly, as that body has already pronounced itself on the issue.”20 But the General Assembly had already pronounced itself on the underlying issue in earlier cases — in Namibia, both the General Assembly and the Security Council had done so. Here, as in Namibia, you are asked to look at the legal consequences of a given situation in the light of certain resolutions; here, as there, you need to look at the legal position underlying those resolutions.\n\nEven more fundamentally what this objection ignores is that you do not give just another political opinion. You give a reasoned judicial opinion as the principal judicial organ of the United Nations. In giving the opinion the Court remains “faithful to the requirements of its judicial character”21. The result is a judicial decision: it is not just a repetition of something the Assembly has already done. And if ever a situation needed a recent judicial opinion, it is this one.\n\nThen secondly, it is objected that the request is inadmissible because there is insufficient evidence before the Court to enable it to make the findings of fact required. According to Israel: “the Court has received no evidence from Israel bearing on the substantive question, and evidence received from others, including the United Nations Secretariat, cannot be regarded as authoritative or reliable”\n\nBut in all the Opinions you have given, you have used the information publicly available, where organizations could help you, you have asked them to help. You have used the information before you as best you could. It is true that in Eastern Carelia the Permanent Court gave as a subsidiary reason for not answering the question an issue of fact — the intention of Russia in making a declaration during the negotiation of a bilateral treaty29 that had nothing whatever to do with the League of Nations. The position is quite different here. This is not a matter within Israel’s domestic jurisdiction and not a matter on which it has a sovereign privilege to act.\n\nMuch more relevant is the approach of the Permanent Court in European Commission of the Danube. That was a dispute under a regional multilateral treaty between Romania and four other States. The Court referred to the findings of a Special Committee whose report had been adopted by an Advisory and Technical Committee of the League of Nations. It said: “The Court is fully aware that the Romanian Government has refused to accept the facts established by the Committee... but the Court is of opinion that, for the purposes of the present procedure, it must accept the findings of the Committee on issues of fact unless in the records submitted to the Court there is evidence to refute them.”\n\nIn the present case there is not one report but many, the reports of competent bodies including the International Committee of the Red Cross, the Human Rights Committee, the Special Rapporteur of the Commission on Human Rights and so on. They are in the Secretary-General’s dossier and have been supplemented by others. They tell a concordant story. The Court is perfectly well informed.\n\nIf Israel wished to challenge the circumstances and facts set out in these reports it could have done so, as Romania did in European Commission of the Danube. Israel cannot plead lack of facts as a ground to have the Court refuse to decide, when any deficiency in the facts could have been corrected by Israel itself. Israel does not have a veto, any more than Spain did in Western Sahara — and if a veto in principle does not exist then it cannot be created by the back door of refusing to present substantive arguments.\n\nAnyway the basic facts are perfectly clear. The dominant fact is the US$2billion fact of the Wall, growing daily and dividing Palestinian communities from each other and from their lands and water. That is the essential fact, this US$2billion so-called “temporary” edifice. So much is now known about the Wall, and what is not known can be deduced from its route, its size, its cost, its régime, its effects and the avowed intentions of those who are building it to impose a unilateral settlement."
    },
    {
        "voto":1,
        "juez":"Palestine",
        "pregunta":"The construction of the wall being built by Israel, the occupying Power, in the Occupied Palestinian Territory, including in and around East Jerusalem, and its associated régime, are contrary to international law",
        "texto":"Mr. President, Members of the Court, it is my honour to address you on behalf of Palestine. I wish to thank the International Court of Justice for granting Palestine the opportunity to participate in these advisory proceedings on the “Legal Consequences of the Construction of a Wall in the Occupied Palestinian Territory”.\n\nI stand before you as a representative of the Palestinian people, the indigenous people of the land, who for too long have been denied the right to self-determination and sovereignty over their land and half of whom remain refugees. The Palestinian people have been subject to a military occupation for almost 37 years. They have been dehumanized and demonized, humiliated and demeaned, dispossessed and dispersed, and brutally punished by their occupier. The occupation has systematically denied them their basic rights and freedoms and has controlled almost every single aspect of their lives.\n\nThis case, however, is not about the whole of the Israeli-Palestinian conflict — it is about the Wall. This Wall is being constructed almost entirely in the Occupied Palestinian Territory. This Wall is not about security: it is about entrenching the occupation and the de facto annexation of large areas of Palestinian land. This Wall, if completed, will leave the Palestinian people with only half of the West Bank within isolated, non-contiguous, walled enclaves. It will render the two-State solution to the Israeli-Palestinian conflict practically impossible.\n\nThe Wall is not just a physical structure; it is a whole régime. It encircles entire communities in walled enclaves and, if completed, will wall-in most of the Palestinian population. It is already causing the displacement of Palestinian civilians and has imprisoned thousands of Palestinians between it and the Armistice Line of 1949, the Green Line. There is, moreover, without a doubt, a correlation between the route of the Wall and the illegal Israeli settlements in the Occupied Palestinian Territory and the water resources in the area.\n\nThere is also, of course, a correlation between the route of the Wall and Israel’s long-standing illegal policies and practices with regard to Jerusalem. East Jerusalem is occupied territory. The international community has never recognized Israel’s illegal annexation of East Jerusalem. The route of the Wall will clearly entrench this annexation. It will compound the humanitarian hardships being faced by the Palestinian inhabitants of the city. Moreover, it will isolate the city from the rest of the Palestinian population, obstructing their access to the city and its Holy Places.\n\nMr. President, Members of the Court, there has been no shortage of peace initiatives on the Middle East and the Israeli-Palestinian conflict. Yet, since the adoption of Security Council resolution 242 (1967), and throughout every one of the subsequent initiatives, Israel has simultaneously been engaged in the intensive colonization of our land. It has transferred 400,000 illegal settlers to the Occupied Palestinian Territory, including East Jerusalem. It is continuously attempting to change the status, physical character, nature and demographic composition of that territory, most recently through its construction of the Wall. Actually, since the signing in 1993 of the Declaration of Principles between the Government of Israel and the Palestine Liberation Organization, Israel not only continued its illegal settlement activities and expansion but actually doubled the number of its settlers in the Occupied Palestinian Territory, including East Jerusalem. Doubled. How can it be expected that the Palestinian people would continue to believe that peace was imminent under such circumstances?\n\nThere is near unanimity among the States in the world that building this Wall is unacceptable. The overwhelming majority of Member States believe that it is in contradiction to international law. The same overwhelming majority believes, as one group, the European Union, has officially declared, that the Wall renders “the two-State solution physically impossible”. Saving the Road Map thus and the prospects for peace requires a cessation of the construction of this Wall, its removal and non-recognition by States of any of its consequences.\n\nMr. President, Members of the Court, I wish now to address the issue of the suicide bombings, the security situation and Israel’s policies and practices in the Occupied Palestinian Territory. Israel claims that the construction of the Wall is a temporary defensive measure to prevent suicide bombings and provide security for Israel. This is not true, and the proof is simple. If this were in fact the case, then Israel would have constructed the Wall on its territory along the Armistice Line of 1949 and not in departure of the Armistice Line and almost entirely in the Occupied Palestinian Territory. If Israel wanted a Wall for security, it could construct it on its territory and raise it to 80 m rather than 8 m if it wished. This would not bode well for mutual coexistence of course, but no one would challenge its legality in principle.\n\nThe suicide bombings have led to the death of 438 Israelis in Israel. Four hundred and ninety Israelis, mostly soldiers and settlers, have also been killed by other kinds of violence. In contrast, since September 2000 and as of 18 February 2004, the Israeli occupying forces have directly killed, including many by extrajudicial execution, a total of 2,770 Palestinian civilians, including children, women and men. Of those killed, more than 1,200 Palestinians have been killed by the Israeli occupying forces in the Gaza Strip, even though Israel has already built another kind of wall surrounding the Gaza Strip. The question that must be asked is: how then will this Wall being built by Israel solve the security problem? If anything, its route and the illegal measures entailed in its construction ensure that it will actually exacerbate the security situation. It is more than obvious that when you deprive an entire people of their rights, expropriate their land and property and wall them into enclaves and ghettos, you are not solving the security problem but creating an untenable situation that will combust.\n\nAt this time, I wish to make our position vis-à-vis the suicide bombings very clear. We have consistently, repeatedly and unequivocally condemned these bombings. We condemn any violence directed at civilians in this conflict, whether Israeli or Palestinian. We consider the suicide bombings to be unlawful. They are also harmful to the just and honourable cause of the Palestinian people.\n\nThat said, I draw attention to the fact that the first suicide bombing occurred nearly 27 years after the onset of this oppressive military occupation of the Palestinian people. This phenomenon is the result of Israeli policies and measures, including the relentless colonization of our land. It is not the cause of those policies and measures. It is also imperative that a distinction be made between such unlawful acts of violence against Israeli civilians in Israel and acts of Palestinian resistance to the Israeli occupation and to military attacks by the occupying forces, consistent with international law. Nevertheless, Palestine reaffirms its commitment to a peaceful, negotiated solution to end this occupation and end this conflict.\n\nThere is a humanitarian crisis in the Occupied Palestinian Territory. Serious violations and grave breaches of international humanitarian and human rights law are being committed. The Wall, part and parcel of these violations and breaches, is severely exacerbating this situation. How can the Road Map truly succeed under such circumstances? It cannot. How can Israel expect the Palestinian side to be able to act effectively when it has destroyed Palestinian security capabilities and has confined the leader of the Palestinian people and elected President of the Palestinian Authority, Yasser Arafat, for more than two years, undermining the leadership’s ability to properly function? It cannot. How can Israel’s construction of this Wall and its continued confiscation and colonization of the Palestinian land lead to peace and security for both peoples? It cannot.\n\nThe colonization by Israel of the Palestinian land under its occupation and the attempts to change its legal status are not new phenomena. What is new, however, is the magnitude of Israel’s attempt to change the legal status and to effect the de facto annexation of large parts of the Occupied Territory by means of the Wall. The Wall will be the culmination of all previous illegal measures and practices carried out by Israel since 1967 towards that end. It will destroy the hopes of the Palestinian people for the realization of their inalienable rights, including the right to self-determination, and destroy their faith in the rule of international law and the international community’s ability to uphold it in the face of such grievous violations. It will destroy the hopes of the international community for implementation of the Road Map and the “two-State” solution of Israel and Palestine, both living side by side within secure and recognized boundaries. Such a lamentable outcome must be avoided at all costs.\n\nMr. President, Members of the Court, this factual presentation is in two parts. I will describe the nature and route of the Wall. Then, I will outline its effects at the local, regional and national levels. This presentation is based on reports included in the United Nations dossier before you. I am joined by Professor Jarat Chopra of Brown University.\n\nThe nature and route of the wall\n\nNow, let me turn to the nature and route of the Wall. The Wall complex varies in width between 30 m and 100 m, with closed military zones on either side. As the slide indicates, the Wall complex includes a number of components: stacks of coils of barbed and razor wire, trenches, an electrified fence with automatic sensors, a paved road for Israeli patrols, a sand trace path to detect footprints, a dirt area, and surveillance cameras.\n\nIn some places, the Wall is made of concrete and is 8 m high, including around Occupied East Jerusalem. In Qalqilya, the concrete Wall is lined with watch towers approximately 300 m apart.\n\nGates are also one of the features of the Wall. According to the United Nations, there are 37 gates built into the Wall. Approximately half of these gates are not operating. Some gates open for short 15-minute intervals only two or three times a day. However, the opening times change unpredictably and Palestinians have to wait for soldiers to open the locks. A number of gates have never been opened, like the one shown on this slide.\n\nThe United Nations Secretary-General’s reports divide construction of the Wall into four phases. A fifth phase of construction is projected, as noted by the United Nations Special Rapporteur and the Commission on Human Rights. On this map, the blue represents Israeli settlements. Phase A of the Wall is completed and is illustrated by the solid red line. This phase extends from Salem to the Israeli settlement of “Elkana”. Phase A also includes two sections of the Wall north and south of Jerusalem. Phase B extends from the Jordan River and south to Tayasir. This latter portion is the beginning of an Eastern Wall. A majority of Phase B has been completed, and the broken red lines indicate areas either approved or under construction. Phase C of the Wall extends from the settlement of “Elkana” to Jerusalem. Much of the current construction is occurring in this phase. Phase D has been approved and will extend from the Israeli settlement of “Gilo” to the south-east of Hebron. A fifth phase in the east is projected to extend along the entire Jordan Valley.\n\nIf completed, the total length of the Wall will be between 700 km and 800 km, and it will enclose some 56.5 per cent of the West Bank inside the Wall.\n\nThis slide illustrates how the Wall significantly deviates from the Green Line in Occupied East Jerusalem. It weaves in and around the Palestinian population, residing in areas indicated in grey, separating Palestinian from Palestinian. It also creates enclaves of Palestinian populated areas and isolates East Jerusalem from the remainder of the West Bank. The Wall denies worshippers access to holy sites in Jerusalem’s Old City. You can also see how the Wall extends around Israeli settlements, which are shown in blue on the map.\n\nThe relationship between the route of the Wall and settlement expansion is clearly illustrated in the Qalqilya area. The Wall has been routed around the planned expansion areas of the “Zufin” and “Alfe Menashe” settlements, as shown by the light blue. The Wall is also routed around the roads that link the settlements with each other and to Israel, as shown by the light blue lines. The result of this pattern is the enclosure of Qalqilya.\n\nNot only in Qalqilya, but throughout the West Bank, the route of the Wall corresponds to Israeli settlements. The dark blue represents existing settlements. The light blue represents planned settlement expansion areas. The grey represents the jurisdictional areas of settlements, which are reserved for future settlement expansion and other settlement activities. The route of the Wall, in red, corresponds to these Israeli settlement areas.\n\nThe effects of the Wall\n\nMr. President, Members of the Court, I would now like to draw your attention to the effects of the Wall at the local, regional, and national levels.\n\nAt the local level, Palestinians are being separated from their land and deprived of their water resources. On this map, the Green Line is indicated. The yellow line represents Palestinian village boundaries. The brown areas are agricultural areas. The blue circles are water wells. And the red line is the Wall weaving its way through the West Bank. The blue areas are Israeli settlements and the dotted blue lines again represent planned settlement expansion.\n\nJayyus is a village of approximately 3,000 people, the majority of whom depend on farming. Approximately two thirds of the village land is now situated to the west of the Wall, separating villagers from their land and water wells. Consequently, these farmers of Jayyus are no longer investing in their land. The picture on the right is a view from Jayyus of its land on the other side of the Wall.\n\nAt the regional level, the Wall has also had a serious impact. For instance, due to the complete enclosure of Qalqilya by the Wall and a gate, some one third of the shops have closed and unemployment rates have increased. The impact on the villages dependent upon Qalqilya has also been severe. People’s access to basic services has declined dramatically. For example, a United Nations hospital in Qalqilya has experienced a 40 per cent decrease in caseloads since the enclosure of Qalqilya and the surrounding areas. Both Qalqilya and the neighbouring villages are separated from almost all of their agricultural land in what is considered to be part of the “Bread basket” of the West Bank. Because of these conditions, Palestinians are leaving the area.\n\nThe Wall is also disrupting access to education. These photographs illustrate students at gates waiting for Israeli soldiers to open the locks and allow them through.\n\nAt the national level, a significant portion of the water fields will be situated outside of the Wall, as shown by the shaded areas on the left map. Consequently, Palestinian capacity to develop the national economy and agricultural base will be significantly curtailed.\n\nAs shown by the map on the right, main urban centres throughout the West Bank are being isolated by the construction of the Wall. As in the case of Qalqilya, the capacity of these main centres to provide regional services and to drive economic development is being extensively eroded by the Wall. The Wall is also rerouteing the movement of goods and people, significantly increasing travel times.\n\nExacerbating the existing effects caused by the Wall, Israel has issued military orders declaring the area between the Wall and the Green Line a “Closed Zone”. According to these military orders, Palestinian residents over the age of 12 within the Closed Zone must apply for a permit to live in their own homes and remain on their land. In addition, Palestinians living inside the Wall wishing to access their land, to work or visit relatives in the Closed Zone must obtain access permits. Israeli citizens are exempt from this permit system. Significantly, obtaining a permit to enter the Closed Zone does not guarantee access because of gate closures. Altogether these procedures are causing Palestinians to leave their homes. Thank you, Mr. President, Members of the Court.\n\nThe Assembly has determined in resolution ES 10/13 that the Wall is “in departure of the Armistice Line of 1949 and is in contradiction to relevant provisions of international law”. That resolution does not, however, answer all questions; it leaves open important questions. For example, in what respects, and under which rules of international law, is the Wall illegal? What must be done to restore the situation to legality? And what are the duties of States in the meantime?\n\nI have three main points to put before the Court:\n\nfirst, that Israel has, in the Occupied Palestinian Territory, only the rights of an Occupying Power, which are conferred by and limited by international law, and that the construction and operation of the Wall does not fall within those rights;\n\nsecond, that Israel, as the Occupying Power, is legally bound to ensure the rights prescribed by international law for those persons lawfully resident in Palestine, and that the Wall violates those rights; and\n\nthird, that the effect of the Wall is to change the status of the Territory in a manner tantamount to annexation, in violation of international law.\n\nLet me begin with the underlying question of the legality of the Wall. The issue here is not whether Israel has the right to build a wall: it is whether it has the right to build the Wall in the Occupied Palestinian Territory. Palestine’s main point is that whatever security effects the Wall might have could be secured by building the Wall along the Green Line, on Israeli territory, so that there is no legal justification for building it in the Occupied Palestinian Territory.\n\nAs you have already seen, the construction of the Wall has involved both the taking of land and the destruction of Palestinian property in the Occupied Palestinian Territory. Under international law the requisitioning of land and the destruction of property are permissible only within narrow and closely defined limits.\n\nRequisitioning of land is governed by Article 52 of the 1907 Hague Regulations, which stipulates that “requisitions in kind and services shall not be demanded from municipalities or inhabitants except for the needs of the army of occupation”.\n\nIsrael admits that the route of the Wall is designed to protect Israeli civilian settlements which have been built in the Occupied Palestinian Territory, including East Jerusalem. It has explicitly said so, for example in the confiscation notice which is quoted beneath photograph 9 in Volume 1 of the Annex to our Written Statement. In any event, the map speaks for itself. The Wall departs from the Green Line in order to fix the settlements on what is no doubt thought of as the “Israeli” side of the line. Perhaps the most striking examples are in the areas around Qalqilya and the Israeli settlement “Ariel”, and in and around East Jerusalem.\n\nThose settlements were themselves created in violation of international law. Article 49 (6) of the Fourth Geneva Convention prohibits the transfer by an Occupying Power of parts of its own civilian population into the occupied territory. As a Legal Adviser to the United States State Department said, in relation to Israeli settlement policy, that prohibition “extends clearly to reach such involvements of the occupying power as determining the location of settlements, making land available and financing of settlements, as well as other kinds of assistance and participation in their creation” (paras. 464 and 465 of Palestine’s Written Statement). He concluded that Israel was in breach of that prohibition. Numerous Security Council and General Assembly resolutions have determined that the settlement activities breach international law.\n\nNow the breach is a serious matter. It is declared to be a “grave breach” of international law by Article 85 of Additional Protocol I to the Geneva Conventions.\n\nThe logic is inescapable. The civilian settlements are unlawful. Therefore there is no right to divert the Wall from the Green Line in order to protect those unlawful settlements. Therefore the confiscations of Palestinian land for that purpose violate international humanitarian law. The Wall, away from the Green Line, has been constructed, and Palestinian property has been taken, for a legally impermissible purpose. There is no need to examine security concerns and arguments in depth in order to appraise the legality of those diversions.\n\nSimilarly, the destruction of Palestinian property for the purpose of constructing the Wall is far removed from anything that is, in the words of Article 53 of the Fourth Geneva Convention, “rendered absolutely necessary by military operations”. There are no such military operations, in the sense in which Article 53 of the Convention uses the term. Indeed the route of the Wall sometimes seems to have been devised with a view to the infliction of wanton damage. The photograph is of the former market of Nazlat Issa, on which the livelihood of hundreds of Palestinian families depended. It was destroyed by the Israeli army “out of necessity to protect Israeli settlements in the area”. The nearest Israeli settlement is 4 km away.\n\nOn this point, Palestine accordingly respectfully suggests that the Court should advise the General Assembly that the building and operation of the Wall in the Occupied Palestinian Territory, including in and around East Jerusalem, violates international law.\n\nThe impact of the Wall on the basic human rights of the men, women and children in the Occupied Palestinian Territory is graphically illustrated in the United Nations reports, and by the reports of B’Tselem, the Israeli human rights organization.\n\nThere are two broad categories of violations. First, there are the direct seizures of land and destruction of property that the construction of the Wall entails. And those I have addressed already. Second, there are the rights that are violated as a result of the restrictions on the movement and residence of the Palestinian population that are imposed under the régime of the Wall. These violations affect the entire population of the Occupied Palestinian Territory, not simply those whose property is taken or those who have been walled in by the Israeli Government.\n\nThe scale of those violations must be understood. This is not a technical squabble over Israeli trespass on Palestinian land. Three of the United Nations reports within the last year (the Bertini37, Dugard38 and Ziegler39 reports) concluded that there is a humanitarian crisis their words, not mine in the Occupied Palestinian Territory, and one that is man-made.\n\nWe had intended to take the Court to passages in those reports that epitomise conduct in clear violation of international humanitarian law and international human rights law. We understand, however, the Court’s desire to focus at this stage on law rather than facts; and last Wednesday the International Committee of the Red Cross issued a statement which captures the essence of what we, and the various United Nations and other reports, are trying to communicate and fixes it precisely in its legal context. It states the following:\n\n“The ICRC is increasingly concerned about the humanitarian impact of the West Bank Barrier on many Palestinians living in occupied territory. Where it deviates from the ‘Green Line’ into occupied territory, the Barrier deprives thousands of Palestinian residents of adequate access to basic services such as water, health care and education, as well as sources of income such as agriculture and other forms of employment. The Palestinian communities situated between the ‘Green Line’ and the Barrier are effectively cut off from the Palestinian society to which they belong. The construction of the West Bank Barrier continues to give rise to widespread appropriation of Palestinian property and extensive damage to or destruction of buildings and farmland. The ICRC has repeatedly condemned deliberate attacks against Israeli civilians and stressed that all acts intended to spread terror among the civilian population are in clear violation of international humanitarian law (IHL). It recognizes Israel’s right to take measures to ensure the security of its population. However, these measures must respect the relevant rules of IHL. The ICRC’s opinion is that the West Bank Barrier, in as far as its route deviates from the ‘Green Line’ into occupied territory, is contrary to IHL. The problems affecting the Palestinian population in their daily lives clearly demonstrate that it runs counter to Israel’s obligation under IHL to ensure the humane treatment and well-being of the civilian population living under its occupation. The measures taken by the Israeli authorities linked to the construction of the Barrier in occupied territory go far beyond what is permissible for an occupying power under IHL. These findings are based on the ICRC’s monitoring of the living conditions of the Palestinian population and on its analysis of the applicable IHL provisions. The Israeli authorities have been regularly informed about the ICRC’s humanitarian and legal concerns. The ICRC therefore calls upon Israel not to plan, construct or maintain this Barrier within occupied territory.”\n\nI would respectfully direct the Court’s attention to the Written Statement submitted in this case by the Swiss Government, which has a particular position as the official depository of the Geneva Conventions. It is helpful to read the words of the ICRC alongside that statement.\n\nPalestine’s Written Statement identifies the main provisions of international humanitarian law and international human rights law that are applicable in this context. It identifies breaches of several provisions of the International Covenant on Civil and Political Rights, which Israel has ratified. They include Articles 12, on freedom of movement, and 17 on the right to family life. There are breaches of the International Covenant on Economic, Social and Cultural Rights, also ratified by Israel, including Articles 11 and 12, on the right to food and to medical care, and Article 13 on the right to education. There are also breaches of the Convention on the Rights of the Child, again, ratified by Israel. Palestine attaches particular importance to this. Children constitute over half of the Palestinian population. The Written Statement identifies breaches of Articles 24 and 27, on the right to food and medical care, Article 28 on the right to education, and Article 16 on the right to family life.\n\nThe response of many Israeli officials has been: the Wall is the price that supporters of terrorism must pay; the solution lies in the hands of the Palestinian Authority. That is an unacceptable response, and not only because of Israel’s repeated incursions into the territory, its destruction of the Palestinian security apparatus and institutions, its imposition of curfews and roadblocks, and its construction of the Wall all of which steps have undermined the Palestinian Authority.\n\nThe response is unacceptable first, because Israel, as Occupying Power, carries the legal responsibility to ensure basic human rights in the Occupied Palestinian Territory. It cannot claim the rights of a military occupant without accepting the corresponding responsibilities.\n\nSecond, that response is tantamount to the imposition of a collective punishment. The Palestinian Authority has consistently condemned terrorist attacks on Israeli civilians; and it is as absurd as it is offensive to imply that all Palestinians are engaged in a murderous conspiracy to attack Israel. To impose the Wall, and all the consequent restrictions on movement and access to property, jobs, welfare, education and families, as a punishment on the whole Palestinian population is unfair, unprincipled, and illegal. It appears to be, as was noted in one of the United Nations reports, a form of collective punishment in retribution for attacks on Israel40. Collective punishments are specifically prohibited by the Laws of War, under Article 147 of the Fourth Geneva Convention and Article 75 of Additional Protocol I.\n\nThird, it is evident that the Wall, in so far as it departs from the Green Line and is built in Occupied Palestinian Territory, cannot be justified by appeals to Israel’s security interests. Israel’s legitimate interests can, as we have explained in our Written Statement, be protected by building the Wall on Israel’s soil; Israel has no legal right to take Palestinian land and destroy Palestinian property in order to protect unlawful settlements in the Occupied Palestinian Territory. Palestine accepts the right of every State to take protective measures. But those measures must be lawful. States cannot cast off all legal and moral constraints by merely calling on the name of “security interests”.\n\nThe question before the Court is whether the Wall, as described in the Secretary-General’s report, violates international humanitarian law and international human rights law. Our Written Statement sets out detailed submissions on this issue; but the point is a simple one. Having read the Secretary-General’s report and the reports that are appended to it, can the Court realistically say that it doubts whether Israel is violating international law in the Occupied Palestinian Territory? Having read through the supporting documents put before it in response to its request to States to provide relevant information, can it say that there is no reason to believe that, as the ICRC put it, “the measures taken by the Israeli authorities linked to the construction of the Barrier in occupied territory go far beyond what is permissible for an occupying power”?\n\nPalestine respectfully suggests that the Court should advise the General Assembly that Israel is obliged to ensure for the residents of the Occupied Palestinian Territory the rights to which they are entitled under international humanitarian law and international human rights law; that those rights include the rights listed in paragraphs C, D, and E of the Order of the Court of 10 July 2004; that the Wall that Israel is building in the Occupied Palestinian Territory violates those rights; and that Israel is obliged to cease forthwith the construction of the Wall, to dismantle forthwith the structure therein situated, to repeal or render ineffective forthwith all legislative and regulatory acts relating thereto, and to make reparation for all damage caused by the construction of the Wall, in accordance with international law."
    },
    {
        "voto": 1,
        "juez": "Palestine",
        "pregunta": "Israel is under an obligation to terminate its breaches of international law; it is under an obligation to cease forthwith the works of construction of the wall being built in the Occupied Palestinian Territory, including in and around East Jerusalem, to dismantle forthwith the structure therein situated, and to repeal or render ineffective forthwith all legislative and regulatory acts relating thereto, in accordance with paragraph 151 of this Opinion",
        "texto": "Three specific elements of that resolution should be highlighted: First, it demanded that Israel stop and reverse the construction of the wall in the Occupied Palestinian Territory, including in and around East Jerusalem, which is in departure of the Armistice Line of 1949 and is in contradiction to relevant provisions of international law. Second, it requested the Secretary-General to report on compliance. And, third, it expressly stated that upon receipt of the first report further actions should be considered, if necessary, within the United Nations system. The wording of that third element reflected a compromise on the means of following up the issue, including the possibility of a request for an advisory opinion from this Court on the legal consequences in case of non-compliance. The phrase could not have meant anything other than a reference to the Court, and, regardless of the claim made in one Written Statement of a different understanding, it is indisputable that the idea for requesting an advisory opinion was widely discussed and debated.\n\nFollowing the resolution's adoption, Israel not only continued but accelerated its construction of the Wall on Palestinian territory. The Secretary-General, pursuant to the resolution, presented a report containing a clear factual presentation about the Wall. It concluded that Israel is not in compliance with the Assembly's demand that it stop and reverse the construction of the wall in the Occupied Palestinian Territory.\n\nAccordingly, the emergency special session resumed again on 8 December 2003, and adopted by a large majority resolution ES-10/14 requesting this Court to urgently render an advisory opinion on the legal consequences arising from Israel's construction of the Wall.\n\nMr. President, Members of the Court, Israel's Written Statement to the Court claims that it does not deal with the merits of the case. We beg to differ. The Israeli statement is rife with attempts to justify the construction of the Wall through the presentation of a detailed case on terror attacks and through political arguments, including on the Road Map. Israel repeatedly refers to the Road Map and to Security Council resolution 1515 (2003). This is ironic. The Government of Israel has never wanted this Road Map, it has never wanted the Security Council's endorsement of it and has repeatedly caused the delay of both. After the Road Map was formally presented in April 2003, the Israeli Government would not say that it accepted the Road Map itself but only what it called \"the steps set out in the Roadmap\". Even then, in accordance with the Israeli Cabinet Statement of 25 May 2003, 14 reservations were attached to it.\n\nIsrael later vehemently objected to the Russian Federation initiative to bring the Road Map to the Security Council for endorsement. When Security Council resolution 1515 (2003) was finally adopted on 19 November 2003, the Council held no debate. This was due to Israel's opposition. Then, on 17 December 2003, Israel undermined the traditional consensus on a General Assembly resolution on \"Assistance to the Palestinian People\" specifically because the European Union, co-sponsoring the resolution, added a paragraph welcoming the endorsement by the Council of the Road Map in resolution 1515. Israel made its adherence to consensus on that resolution conditional upon the removal of the reference to resolution 1515, which did not occur."
    },
    {
        "voto": 1,
        "juez": "Palestine",
        "pregunta": "Israel is under an obligation to make reparation for al1 damage caused by the construction of the wall in the Occupied Palestinian Territory,including in and around East Jerusalem",
        "texto": "Mr. President, Members of the Court, it is my privilege and pleasure to stand before you again today, on behalf of Palestine, to address the issue of the applicable law to the Occupied Palestinian Territory.\n\nThis issue is treated at some length in Palestine’s Written Statement, so I shall limit myself to highlighting and elaborating further only on some salient points. The question put to the Court by the General Assembly focuses mainly on international humanitarian law via the reference to the Fourth Geneva Convention and by characterizing the Territory as “occupied” by reference to that law. But the rules and principles of international laws that have a bearing on the situation have a much wider scope than that. In the first place, closest to the rules and principles of international humanitarian law, and increasingly intertwined with them are those of the international law of human rights.\n\nBut there are also the general rules of international law, particularly two of its cardinal, constitutive, principles Professor Crawford has just been referring to. One of them, namely, the prohibition of the individual use of force and its corollary, the prohibition of conquest or the taking of territory by force, and the principle of equal rights of peoples and their right to self-determination. But as my colleagues Professors Vaughan Lowe and Jean Salmon will be dealing with aspects of the latter two categories and given the limitations of time, I shall concentrate my remarks on international humanitarian law, or the jus in bello.\n\nUp to the Geneva Conventions of 1949, the instruments codifying these rules did not explicitly define the circumstances triggering their application. By contrast, the Geneva Conventions instructed by the experiences of the Second World War in Article 2 common to the four Conventions, state in paragraph 1: “the present Convention shall apply to all cases of declared war or of any other armed conflict which may arise between two or more of the High Contracting Parties, even if the state of war is not recognized by one of them”.\n\nThe Hague Regulations, for their part, define, in Article 42, the circumstances under which “a territory is considered occupied” and these circumstances are, again according to that Article, “when it is actually placed under the authority of the hostile army”.\n\nThat is exactly what happened in 1967. In the course of an armed conflict between several States, Israel invaded and occupied militarily, inter alia, the West Bank and Gaza, formerly part of the British mandated territory of Palestine, which had never been before under Israeli jurisdiction or administration. In other words, an armed conflict as provided for in Article 2, paragraph 1, of the Geneva Convention, brought about a situation falling under Article 42 of the Hague Regulations. A typical case of belligerent occupation.\n\nThese are clear texts that dispose clearly of the matter. But Israel contests this conclusion on the basis of the second paragraph of Article 2 of the Fourth Convention, which provides: “The Convention shall also apply” so this is a second case “to all cases of partial or total occupation of the territory of a High Contracting Party, even if the said occupation meets with no armed resistance.”\n\nThis provision was added ex abundante cautela in 1949 to cover the case of occupatio pacifica, that meets with no armed resistance, like the occupation of the Suddeten in 1938. Even that is considered an occupation, and triggers the application of the Convention. But in such cases, as there is no visible armed conflict, there is a need for another criterion which explains the reference to the legal status or title to the territory thus occupied, a title which does not belong to the occupant.\n\nBut in cases of belligerent occupation, covered by the first paragraph of Article 2, what matters is the taking of control over the territory in the course of an international armed conflict, and maintaining it by military force; not the title of the entity that was peacefully administering the territory before the occupation, or any other entity that may have a claim on this. This particularly applies to claims laid by the belligerent occupant on the occupied territory. It would make a mockery of the law if an invader could evade the application of the jus in bello by merely formulating a claim on the territory it occupies by force. It would be tantamount to an invitation to annex the territory.\n\nThis rule also applies, regardless of the characterization of the use of force by the belligerent occupant, that is whether it is an alleged aggressor or allegedly exercising self-defence. For it is a cardinal principle of jus in bello that its rules apply equally to all parties, irrespective of their rights and wrongs under the jus ad bellum.\n\nI shall not go into the specific arguments of Israel relating to the non-incorporation of the Hague Rules and the Fourth Geneva Convention into its municipal law, nor on the alleged application de facto of only the humanitarian components of the Fourth Geneva Convention. After all, are there any non-humanitarian components in the Geneva Conventions? Even the procedural aspects provide guarantees for the observance of the substantive protective rules. And can one apply only de facto instruments and rules by which one is legally bound? Indeed, this august Court itself has found that both the Hague Regulations and the Geneva Conventions have passed into general international law (Legality of the Threat or Use of Nuclear Weapons, I.C.J. Reports 1996, para. 79) and even characterize them as being intransgressable not to use jus cogens. As such they are universally binding, regardless of the conventional limitations that may be attached to them as treaties.\n\nThe same can be said of most of the provisions of Additional Protocol I to the Geneva Conventions, in any case those provisions that may be relevant here, such as Article 75 on Fundamental Guarantees.\n\nMr. President, Members of the Court, I have been addressing the legal rationale of the applicability of the law of belligerent occupation to the Occupied Palestinian Territory. But this rationale, moreover, has been endorsed by almost the unanimity of the international community apart from Israel.\n\nI need not recapitulate here all the resolutions of the General Assembly and the Security Council, or of the Conference of the Contracting Parties to the Fourth Geneva Convention or the declarations of the International Committee of the Red Cross, the latest being on the 18th of this month and the ICRC is the institutional guardian of the Conventions or of the different States or groups of States. All these declarations assert the applicability de jure of the Fourth Convention to the Occupied Palestinian Territory (Palestine Written Statement, paras. 387-392). I would like simply in this respect to make a short remark on the status and role of the General Assembly and Security Council resolutions which are specifically referred to in the request for the advisory opinion.\n\nThe Israeli statement in these proceedings, in an attempt to undermine the basic role of the General Assembly, which has just been described by Professor Crawford, declares: “Resolution ES-10/13, which purports to determine illegality, cannot properly be relied upon as an authoritative determination of legality. It is not binding.” (P. 116, para. 9.9.) The Statement contrasts that resolution with Security Council Resolution 276 (1970) (ibid., para. 9.10), which was referred to in the request for an advisory opinion in the Namibia case (I.C.J. Reports 1971). However, in that very Advisory Opinion on Namibia the Court has said: “it would not be correct to assume that, because the General Assembly is in principle vested with recommendatory powers, it is debarred from adopting, in specific cases within the framework of its competence, resolutions which make determinations or have operative designs”\n\nMaking determinations is part and parcel of the functions of the General Assembly and the Security Council. It is only on the basis of such determinations that they can envisage further action, on items they deal with, within the limits of their powers under the Charter. This is the quasi-judicial role of these two organs, as has been already described by the regretted Professor Oskar Scharffer already in 1964.\n\nThe Court has, on numerous occasions, particularly in advisory proceedings, recognized and acted upon such determinations by the General Assembly and the Security Council, and has never, to my knowledge at least, ignored or set aside such a determination.\n\nOf particular significance to the question put to the Court are the resolutions of the General Assembly and the Security Council relating to settlements and the annexation of East Jerusalem and its surroundings. These resolutions, particularly several resolutions of the Security Council, adopted unanimously with the positive vote of the United States, determine I am quoting from the dispositif of such resolutions the illegality of the settlements (see Palestine Statement, paras. 165-167), and of the annexation of Jerusalem, characterizing this annexation as a flagrant violation of the Fourth Geneva Convention, that does not affect the continued applicability of that Convention to Jerusalem and the rest of the Occupied Territory (ibid., paras. 168, 361-364). Resolution 478 goes even further and determines that “all legislative and administrative measures taken by Israel, the occupying Power, which have altered or purport to alter the status and character of the Holy City of Jerusalem... are null and void... and must be rescinded forthwith...”\n\nMr. President, I turn now very briefly to the content of international humanitarian law inasmuch as it regulates belligerent occupation.\n\nArticle 42 of the Hague Regulations defines belligerent occupation as a de facto status arising from the effective control of the territory by a hostile army, and extending only as far as this effective control (or “authority” as it calls it) “has been established and can be exercised”. International humanitarian law takes cognizance of this de facto status, to which it attaches legal consequences or a régime. This legal régime is guided by two major principles:\n\nThe first is that occupation is a temporary (or transient) state of affairs. It is an abnormal or emergency situation, and the law of occupation tries to strike a balance between, on the one hand, accommodating the military needs of the Occupying Power in prosecuting the war and its war aims and, on the other hand, protecting the rights, freedoms and welfare of the population of the occupied territory, as well as their normal way and train of life from being excessively disturbed and affected by the occupation.\n\nIn this respect, international humanitarian law, while recognizing to the Occupying Power the prerogatives of government over the occupied territory, imposes on it the positive obligations of government in terms of restoring and ensuring “public order and safety” (Article 43 of the Hague Regulations), as well as ensuring food and medical supplies and services for the population to the fullest extent possible (Articles 55 and 56 of the Fourth Geneva Convention) as well as respecting their human rights and dignity and so forth.\n\nThe second governing principle of the law of occupation is that occupation, being a temporary, transient régime, cannot affect nor transfer sovereignty to the Occupying Power. In this respect, the régime of occupation operates to a large extent as an interim measure (une mesure conservatoire), by freezing the status juris of the occupied territory for as long and as far as occupation remains effective; so that it cannot be changed by any unilateral act or action on the part of the Occupying Power.\n\nThe legal effects of this principle are reflected in Article 47 of the Fourth Convention which provides: \n\n“Protected persons who are in occupied territory shall not be deprived, in any case or in any manner whatsoever, of the benefits of the present Convention by any change introduced, as the result of the occupation of a territory, into the institutions or government of the said territory, nor by any agreement concluded between the authorities of the occupied territories and the Occupying Power, nor by any annexation by the latter of the whole or part of the occupied territory.”\n\nBut the law of occupation goes even further. It enjoins the Occupying Power to leave things as they were before the occupation to the fullest extent possible; for example, “not [to] alter the status of public officials and judges” in Article 54 of the Geneva Convention. In the same vein, Article 43, which I have just referred to, of the Hague Regulations directs the Occupying Power to “take all measures in his power to restore and to ensure, as far as possible, public order and safety” and here is a clause I want to underline “while respecting, unless absolutely not necessarily absolutely prevented, the laws in force in the country” (and the same about criminal laws in Article 64 of the same Convention).\n\nReferring to Article 43, the ICRC Commentary on the Fourth Geneva Convention says the following: “This provision of the Hague Regulations is not applicable only to the inhabitants of the occupied territory, it also protects the separate existence of the State, its institutions and its laws.”\n\nIndeed, the protection of the separate status and corporate existence of the occupied territory is reflected in the Hague Regulations by the protection they provide not only to private property (Arts. 46 and 47), but also to the commons and to public property in the form of “public buildings, real estate, forests and agricultural estates” of which “the occupying power shall be regarded only as administrator and usufructuary” and “must safeguard the capital of these properties and administer them in accordance with the rules of usufruct”.\n\nThe prohibition of effecting durable changes by the unilateral act or action of the Occupying Power is not limited to the formal legal status of the territory (through a purported change of sovereignty). It extends also to such changes in the human and material components of the occupied territorial entity whence the prohibition, in Article 49 of the Fourth Convention, of demographic changes through “individual or mass forcible transfer as well as deportation” of civilians outside the occupied territory; as well as the deportation or transfer by the Occupying Power of “parts of its own civilian population into the territory it occupies”.\n\nThese prohibited acts constitute, under the Geneva Conventions and Article 147 particularly of the Fourth Convention, as well as Article 85 of Protocol I and Article 8 of the recent Rome Statute, grave breaches of international law which entail individual criminal responsibility.\n\nMr. President, it is by the standards of this legal régime that the legality of the Wall has to be assessed, and the justifications provided by Israel for its construction have to be weighted.\n\nOne of these justifications, self-defence, does not belong to international humanitarian law or the jus in bello, but to the jus ad bellum. Israel makes here an impermissible confusion between the two branches of the law of war that have to be kept radically apart. Once an armed conflict is brought into being, the jus in bello (or international humanitarian law) comes into play, as the lex specialis governing the ensuing situation regardless of the rules of the jus ad bellum.\n\nMoreover, logically, how can one say that a State exercises self-defence against a territory under its own military occupation, that is under its effective control, and in which it has the authority and even the obligation to “ensure public order and safety” according to Article 43 of the Hague Regulations? Can the Wall be then be justified as a military necessity? One of the great advances of international humanitarian law is that it has moved away from Clausewitz’s concept of military necessity as Kriegsraison, i.e. the idea that the aims of war justify using any means considered necessary to achieve them.\n\nThat concept of military necessity is ultimately negatory of international humanitarian law. Fortunately, at least since the Hague Regulations of 1899, it has been replaced by the modern and much narrower concept of military necessity, strictly limited to the contexts in which it is expressly recognized and under the conditions set by the provision in the relevant instruments that recognizes it.\n\nThose conditions include, in particular, specificity and proportionality. It is in this sense that the Declaration of the Contracting Parties to the Fourth Geneva Convention states in paragraph 5 that “the Fourth Geneva Convention, which takes fully into account imperative military necessity, has to be respected in all circumstances”\n\nThen we have to look in the Geneva Convention or the Hague Regulations. Where can we find in them a recognition of a military necessity (or even of a legitimate military need) that can be invoked to justify the Wall?\n\nIn my submission, the only possible justification for the Wall is as a safety measure taken by Israel in the exercise of its authority as an Occupying Power under Article 43 of the Hague Regulations and Article 27 of the Fourth Geneva Convention.\n\nAs my colleague Professor Vaughan Lowe will explain, neither provision justify the building of a Wall to protect civilian citizens of the Occupying Power implanted in the occupied territory. The argument that a similar barrier around Gaza has proved effective in reducing the attacks while debatable, as Ambassador Al-Kidwa has mentioned in his introductory speech still this argument, even if it were true, intentionally ignores the fact that the wall around Gaza had for purpose had for avowed purpose to seal it off hermetically; and that is what Israel is emphatically denying being the purpose and effect of the Wall in the West Bank. Why? Because if it admits that the purpose is for it to hermetically seal what is within the Wall, that will confirm all its flagrant features violative of international humanitarian law.\n\nThe Wall also starkly fails the test of necessity and proportionality as a security measure, because of the hundreds of thousands of Palestinians who remain unchecked on the other side of the Wall, on the western side for example. Unless of course they are made, directly or indirectly, to leave that area; which would constitute another flagrant grave breach of Article 49 of the Geneva Convention. Not much for possible justification.\n\nFinally, Mr. President, may I say in conclusion, that arguing on the basis of the law of occupation does not mean recognition or acceptance of the legality of this occupation, particularly when it turns into prolonged occupation that borders on annexation. Thank you, Mr. President."
    },
    {
        "voto": 1,
        "juez": "Palestine",
        "pregunta": "All States are under an obligation not to recognize the illegal situation resulting from the construction of the wall and not to render aid or assistance in maintaining the situation created by such construction; all States parties to the Fourth Geneva Convention relative to the Protection of Civilian Persons in Time of War of 12 August 1949 have in addition the obligation, while respecting the United Nations Charter and international law, to ensure compliance by Israel with international humanitarian law as embodied in that Convention",
        "texto": "We are here because the United Nations has a permanent responsibility—legally, politically and morally—for the question of Palestine until the question is resolved in all its aspects. The General Assembly has reaffirmed this in at least 25 resolutions. It is, after all, the General Assembly that, in accordance with the Charter of the United Nations, dealt with mandated Palestine, deciding on 29 November 1947, in resolution 181 (II), to partition Palestine into two States, one Jewish and one Arab. The Arab State has, of course, not yet been realized; and thus the Palestinian people have been unable to exercise their right to self-determination. Indeed, Palestine is still not a Member State of the United Nations, but remains an observer. Since 1947, however, the General Assembly has never ceased dealing with the question of Palestine or its aspects.\n\nOver the years, in light of the Council’s inaction, the General Assembly has tried to discharge its own responsibilities in line with General Assembly resolution 377 (V) of 1950. Four of its ten emergency special sessions have been on Palestine and the Middle East situation. In reaction to the last veto, the tenth emergency special session was resumed to consider the situation. Like the Security Council, the Assembly conducted a serious debate on the issue and two draft resolutions were submitted. One requested the International Court of Justice to issue an advisory opinion on the Wall. After intensive consultation and negotiations, however, the Members of the European Union introduced a draft resolution, with the understanding that the co-sponsors of the original two drafts would not insist on a vote on those drafts. The European Union co-sponsored draft resolution was adopted by an overwhelming majority, on 21 October 2003, as resolution ES-10/13."
    },
    {
        "voto": 1,
        "juez": "Palestine",
        "pregunta": "The United Nations, and especially the General Assembly and the Security Council, should consider what further action is required to bring to an end the illegal situation resulting from the construction of the wall and the associated régime, taking due account of the present Advisory Opinion",
        "texto": "The Road Map could be different; and we hope that it will be. It is rooted in the principles of resolution 242 (1967) and in the vision affirmed by the Security Council in resolution 1397 (2002) of “a region where two States, Israel and Palestine, live side by side within secure and recognized borders”. This initiative deserves a chance — we want it to succeed. But Israel cannot once again be permitted to continue its ceaseless taking of Palestinian property and rights, under the cover of the peace process or the semblance of a peace initiative. The legal rights of the Palestinian people cannot simply be ignored or suspended whenever there is a peace process under way. That plays into the hands of extremists on both sides. One of our chief hopes is that the Court will make it clear that the Palestinian people have rights and that international law is not irrelevant to the situation in the Occupied Palestinian Territory."
    },
    {
        "voto": 0,
        "juez": "Kingdom of Saudi Arabia",
        "pregunta": "Finds that it has jurisdiction to give the advisory opinion requested",
        "texto": "As the Court is aware, the Kingdom of Saudi Arabia has presented a Written Statement on the question before the Court. We are mindful of our duty not to simply repeat what is said there. We are also cognizant of the time pressure the Court is under and the fact that the position of many of the parties that are here touch upon similar points. Thus, in using my time today, I will not make a comprehensive statement that responds to all of the points that have been raised with which we disagree. We will let our Written Statement stand and reflect our comprehensive point of view. Rather, I propose to address one specific argument that has been raised. That argument concerns the discretion of the Court. The argument is that an advisory opinion on the question is at cross purposes to the negotiating effort, designed to bring peace in the Middle East, which is today called the Road Map. We strongly disagree with this argument. We believe it is a false argument that if accepted leads only to further disintegration of the peace process. It is hoped that by responding to this one argument we will provide the Court with “information”, as called for by Article 66 of the Statute of the Court. That is our responsibility here; it is not to argue as if this is a contentious case.\n\nBefore I proceed, however, I wish to make three preliminary observations.\n\nFirst, we take note of the highly unusual posture of the pleadings that have been presented to the Court.\n\nOn the one hand, no State or other party appearing in this matter has sought to justify in law the separation Wall that Israel is building. On the other hand, some of us that are before the Court have made the case in law that there are legal consequences of the separation Wall, or barrier, or fence, whatever it may be called and from here forward I will simply refer to it as the Wall and that those consequences arise from the conclusion that the Wall is unlawful. Since no party has argued to the contrary, we believe our conclusion is sound.\n\nOf course, a group of States argues that the Court should not render an advisory opinion on the question as the General Assembly has requested. The argument they present is similar to arguments made in other advisory opinion cases to the effect that the question is vague, or that the Court will be in danger of prejudicing negotiations or of departing from its judicial function. Such arguments have failed in the past before this Court. It is notable, however, that in the cases where such arguments are made, one often at the same time finds those same States arguing in the alternative: that is, they argue their view that the Court should not render an opinion, but they then go on to argue their position on the substance of the matter in the event that the Court proceeds to render an opinion. This is not the case here.\n\nFor instance, in the Nuclear Weapons case, seven States argued in their Written Statements that the Court should not give its opinion; of those States, six presented the alternative argument. In the present matter, these same six States provided the Court with Written Statements again arguing that the Court should not render an advisory opinion, but this time in doing so they presented no alternative argument. The copy of my prepared remarks given to the Registry contains the relevant citations.\n\nThus, the alternative argument is not presented here. The States that argue that the Court should not exercise its power to render an advisory opinion on the question before it do not argue in the alternative that if the Court does, it should find that there is a legal basis for the Wall and thus no adverse legal consequences. The question may be asked, why not? The answer, simply, is that the Wall is indefensible as a matter of law.\n\nMany States that have taken the position in their Written Statements that the Court should not render an advisory opinion on the question before it have elsewhere condemned the Wall. They have done so by their affirmative vote for General Assembly resolution ES-10/13 of October 2003, which demands that Israel stop and reverse the construction of the Wall and states it is in contradiction with international law.\n\nTherefore, the Court is in a curious position. Almost all States making written appearances before the Court hold the position that the Wall is illegal. Nonetheless, some of those States believe that the Court should not render an advisory opinion on the question before it because they say it will inhibit a negotiating process.\n\nIn our view, that is a sad commentary on the state of things. There is an internationally supported negotiating process. One side in the negotiations — that is, the Israeli side — has been and continues to deliberately enhance its position and change the territorial status quo to its benefit. It has been doing so since 1967; the Wall is the most recent manifestation. Nothing is being done about it, although almost all States say it is wrong. Whatever rhetorical exhortations may be made by the Quartet have done nothing to make Israel believe that there is an adverse consequence to taking more Palestinian land. Yet the argument is made that the General Assembly should be denied the Court’s opinion on the legal consequences of the Wall — a wall that in our view denies a viable Palestinian State, denies the right of self-determination, and exacerbates the hatred that leads to increased violence.\n\nMr. President, Members of the Court, this attitude that the Court should not speak on this question does not make sense to us. If the Court, the highest international judicial body, cannot take a clear position on the law to guide the General Assembly on a specific request by that body as negotiations progress, it is not hard to understand the further descent into chaos and procrastination."
    },
    {
        "voto": 0,
        "juez": "Kingdom of Saudi Arabia",
        "pregunta": "Decides to comply with the request for an advisory opinion",
        "texto": "I now turn to our response to the argument that has been made that the Court’s advisory opinion on the question of the legal consequences of the Wall would prejudice or hinder or be at cross-purposes to the Road Map, and thus the Court should refrain from giving its opinion. I will respond by looking at the argument from five different points of view.\n\nTo begin, the argument may be examined from what might be said to be a logical point of view. It is hard for us to understand how an advisory opinion from this Court that could inform the General Assembly and that is non-binding would truly hinder negotiations between two parties as claimed by Israel and several other States. The advisory opinion is an opinion of law, and the General Assembly believes it will be useful to its deliberations. We cannot lose sight of the fact that the purpose of the General Assembly’s request for this position is to advise it in the conduct of its work, such work including the concern for human rights and self-determination, not to mention international peace and security. It is a fact that the Palestinian people have been denied the exercise of the right of self-determination for many decades, and this is a legitimate concern of the General Assembly.\n\nThe negotiations that are mandated by the Road Map do not take place in a vacuum. The interest of the General Assembly is not new. Resolution after resolution of both the General Assembly and the Security Council have been disregarded by the Occupying Power in the Occupied Palestinian Territory, including in and around Jerusalem. It is the Security Council th\n\nbeginning with resolution 242 in 1967 and, later, resolution 338 of 1973 requires \n\nwithdrawal of Israel from the territory it occupied in the 1967 W\n\nbeginning with resolution 252 in 1968 considers that all legislative and administrat\n\nmeasures and actions taken by Israel, including expropriation of land and properties there\n\nwhich purport to change the legal status of Jerusalem are invalid and cannot change t\n\nstat\n\nin resolution 446 in 1979 determined that the policy and practices of Israel in establish\n\nsettlements in Palestine and other Arab territories occupied since 1967 have no legal valid\n\nand constitute a serious obstruction to achieving a comprehensive, just and lasting peace\n\ndetermined in resolution 452 of 1979 that Israel’s settlement policy constitutes a violation\n\nthe Fourth Geneva Convention of 1949.\n\nThe list goes on and on, and includes Security Council resolution 465 of 1980, which specifica\n\nreferred to Israel’s settlement policies as a flagrant violation of the Fourth Geneva Convention.\n\nIt remains for the parties to negotiate their own solution, but it is perfectly legitimate \n\nthe General Assembly to request the Court for an advisory opinion on the legal consequences of \n\nWall in the context of those resolutions and other principles of international law, and for the Co\n\nto exercise its mandate and to give its opinion.\n\nThe second point of view that I offer looks at this question chronologically over the l\n\ntwo years in light of the argument made in the Israeli Written Statement that the Gene\n\nAssembly’s request is improper in light of the Security Council’s endorsement of the Road Map\n\nits resolution 1515. A chronological review of the last two years shows that the Gene\n\nAssembly’s request for an advisory opinion is consistent with its responsibilities and does \n\ninfringe upon those of the Security Council. The Israeli Written Statement, at paragraph 3.2, sta\n\nthat Security Council resolution 1397 of 12 March 2002 “sets the agenda for the Quartet initiativ\n\nIt is, of course, that initiative, which arose from the Madrid process, that resulted in the plan \n\ncalled the Road Map. According to paragraph 1.16 of the Israeli Written Statement, \n\nGovernment of Israel approved the construction of the Wall the very next month. Act\n\nconstruction began in June that same year.\n\nDuring 2002 and 2003 the Quartet issued communiqués following its meetings record\n\nits progress15. In the communiqué of the Quartet dated 17 September 2002, one can see \n\ncomplete Road Map16. It is true that it was not formally presented to Israel and to the Palestin\n\nAuthority until 30 April 2003, and it was not until 19 November 2003 that the Security Coun\n\npassed a resolution in which it “endorsed” the Road Map17. That is the operative w\n\n“endorsed” that is all. Throughout 2002 and 2003 the Road Map was promoted, acted up\n\ncalled upon and interpreted. Thus, leading up to the end of 2003, the Road Map was the centre\n\nthe diplomacy on this subject; but even before the Security Council endorsed it in November 20\n\nits viability had become open to question.\n\n“Determines that all measures taken by Israel to change the physical character, demographic\n\ncomposition, institutional structure or status of the Palestinian and other Arab territories occupied since\n\n1967, including Jerusalem, or any part thereof have no legal validity and that Israel’s policy and practices\n\nof settling parts of its population and new immigrants in those territories constitute a flagrant violation of\n\nthe Geneva Convention relative to the Protection of Civilian Persons in Time of War and also constitute a\n\nserious obstruction to achieving a comprehensive, just and lasting peace in the Middle East.”\n\nThe Israeli Written Statement portrays the scene as if on 19 November 2003 the Secur\n\nCouncil took a momentous action as if it had just discovered the Road Map rather t\n\nsimply endorsing something that had already been the focus of diplomacy for more than one year\n\nThe Israeli Written Statement goes further to cast the General Assembly in the role of a villain\n\ncalling for this advisory opinion a few weeks later: as if the General Assembly sought to pre-e\n\nthe powers of the Security Council making, as Israel asserts, the call for this advisory opin\n\nultra vires to the General Assembly19.\n\nMr. President, Members of the Court, the genesis the date of the beginning of \n\nRoad Map is not 19 November 2003. If so, the Road Map is itself internally inconsistent as\n\ncalls for a three-year process to be completed by 2005. The Road Map is a negotiating effort t\n\ndates from early 2002, receiving the endorsement (a rather modest word after all) of the Secur\n\nCouncil only recently.\n\nIn light of Israel’s arguments that the actions of the General Assembly are ultra vires,\n\nis useful to note what occurred in respect of the Wall in 2002 and 2003.\n\nFrom the date of approval of the Wall by the Israeli Government to the adoption by \n\nSecurity Council on 19 November 2003 of resolution 1515, the Quartet issued six communiqu\n\nOnly the last of these referred to the Wall, which was by then well along in its construction, \n\nthen only expressed general concern. Nonetheless, throughout the period there was mount\n\nevidence of the humanitarian crisis created by the Wall, the growing realization that new de fa\n\nterritorial annexation by Israel was occurring, and the increasing concern that the Wall would m\n\nnegotiations impossible. However, the Security Council did not act nor did the Quartet act\n\nconvince Israel to reverse the situation.\n\nIn light of these growing concerns, however, on 14 October 2003 the Security Coun\n\nconsidered a draft resolution20. A preambular paragraph of that draft resolution condemned “\n\nacts of violence, terror and destruction”, while an operative paragraph decided “that \n\nconstruction by Israel, the occupying Power, of a wall in the Occupied Territories departing f\n\nthe armistice line of 1949 is illegal under relevant provisions of international law and must\n\nceased and reversed”.\n\nThe draft resolution was not adopted by the Security Council but in the debate no \n\nsaid that the legal conclusion of the defeated resolution was wrong21.\n\nIt is in this context of the failure to comment on the legality of the Wall, and thus\n\nprotect the Road Map, that the Emergency Special Session was called, which resulted in a requ\n\nfor this advisory opinion. Thus, this review of recent events shows that the General Assembl\n\naction is not precipitous, it is not irresponsible, and that it is focused on the Wall, which\n\ndestructive of peace. There is no evidence in the chronology that suggests that the Road Map w\n\nbe harmed if an advisory opinion is given.\n\nWe now turn to a third point of view on the argument that an advisory opinion will h\n\nnegative consequences for the Road Map. This viewpoint looks at the issue from a practical \n\nhistorical point of view. Let us be clear, the Road Map is simply a negotiating process. It is w\n\nsupported by the international community, and that is good. However, one cannot avoid the f\n\nthat there have been other well-supported negotiating initiatives on this problem over the l\n\n40 years. I say this not to cast doubt on our commitment to the Road Map but simply to ensure t\n\nthe Road Map is seen for what it is.\n\nThe Court has been faced before with the argument that an advisory opinion o\n\nquestion before it would prejudice sensitive negotiations. It was confronted in particular with \n\nsame argument ten years ago in the Nuclear Weapons case. At paragraph 17 of that Judgment \n\nCourt said, and I quote:\n\n“The Court is aware that, no matter what might be its conclusions in \n\nopinion it might give, they would have relevance for the continuing debate on \n\nmatter in the General Assembly and would present an additional element in \n\nnegotiations on the matter. Beyond that, the effect of the opinion is a matter\n\nappreciation. The Court has heard contrary positions advanced and there are\n\nevident criteria by which it can prefer one assessment to another. That being so, \n\nCourt cannot regard this factor as a compelling reason to decline to exercise \n\njurisdiction.”\n\nThe Kingdom of Saudi Arabia respectfully submits that those same reasons apply here.\n\nMr. President, Members of the Court, the argument that doing something today mi\n\nprejudice something tomorrow is a feature of diplomatic life. It probably would be hard to find\n\nexperienced international diplomat who has not made that argument. As is the case here, it\n\nnormally made when we want to avoid putting the spotlight on what is happening now.\n\nWhat is happening now is that the Road Map is in trouble. We recognize that some\n\nthe Quartet come to the Court and say: do not shine the spotlight on the problem. We supp\n\nthese members’ work, but we believe they have seriously misread the situation. Fortunat\n\nanother member, the United Nations, and one of its organs a competent organ the Gene\n\nAssembly wants to put the spotlight on the problem and be informed of the legal consequen\n\nof Israel’s actions the legal consequences in light of the humanitarian crisis, the le\n\nconsequences for self-determination, and indeed, the legal consequences for international pe\n\nand security, not just for Palestine and Israel but for all States and international institutions.\n\nWhy should the spotlight be put on the problem? The spotlight should be put on \n\nproblem because the Wall is so provocative, so overreaching, so aggressive, and\n\ndisproportionate, that we believe it will be the death knell of the Road Map if it is not immediat\n\nreversed.\n\nThe Quartet knows this. Their last joint communiqué entitled “Final Quartet Stateme\n\nand dated 26 September 2003 indicated that they regarded the implementation of the Road Map\n\nstalled. The Quartet also said the settlement activity must stop, and then expressed great conc\n\nover the Wall and its effect on the Road Map23. That was the position of the Quartet in Septem\n\nof last year. What has happened since then? Since then, the Security Council did endorse the R\n\nMap, but the Wall continued to be built. The “fabric of life”, as the Israeli Written Statement ca\n\nit, has become even more intolerable for the Palestinian people, and, yes, the cycle of viole\n\ncontinues.\n\n“The Quartet members view with great concern the situation in Israel, the West Bank, and G\n\nwhich has stalled implementation of the roadmap. The Quartet members reaffirm that, in accordance with the roadmap, settlement activity m\n\nstop, and note with great concern the actual and proposed route of Israel’s West Bank fence, particula\n\nas it results in the confiscation of Palestinian land, cuts off the movement of people and goods, \n\nundermines Palestinians’ trust in the roadmap process as it appears to prejudge final borders of a fut\n\nPalestinian state.”\n\nMr. President, Members of the Court, the fact that there was an Advisory Opinion\n\nSouth West Africa24 may have informed the views of some States and international organizatio\n\nIn spite of South Africa’s arguments that an opinion in that matter should not be issued, that did \n\ndeter the Court. The fact that the Court concluded that South Africa’s occupation was illegal \n\nactually have helped the process and left South Africa to conclude that its only option was to\n\nwhat was right: withdraw. Today, Namibia is an independent State.\n\nThe concerns of Spain in Western Sahara25 and those of a number of States in \n\nNuclear Weapons case26 concerning the impact of an advisory opinion on sensitive issues i\n\nsensitive process proved not to be true.\n\nThus, the argument that an advisory opinion on this question is counterproductive to \n\nRoad Map cannot be sustained. This is an advisory opinion. It is not binding, but it will inform \n\nGeneral Assembly that, by virtue of its request, has sought the Court’s opinion on the quest\n\nposed.\n\nBefore moving on I must say one thing about Israel’s portrayal of the Road Map. To\n\nsure, stage one of the Road Map concerns terrorism directed at Israel, but it also concerns Isra\n\nprovocations against Palestine. The Road Map is not as Israel repeatedly states a document that\n\nbold letters says the first step is to eliminate all terrorist acts. What the Road Map says is that at \n\noutset of stage one, I quote: “All official Palestinian institutions end incitement against Israel”, \n\nfollowing thereafter and again I quote: “All official Israeli institutions end incitement agai\n\nPalestinians”27. The Palestinian obligation appears first on the page, but that is not an indicat\n\nthat Israel is free to continue its provocations, including the construction of the Wall, until it jud\n\nit is satisfied that official Palestinian institutions have utterly succeeded in winning the war agai\n\nterrorism.\n\nThe fourth point of view about this argument that the Road Map could be prejudiced\n\nthere is an advisory opinion is to note the vacuum of silence that accompanies the argument.\n\nThe silence I refer to is that no one says why the Road Map will be prejudiced if \n\nCourt gives an advisory opinion. Indeed, if one examines closely the words used, one finds that \n\nargument is generally hedged with phrases such as “could potentially prejudice” or “co\n\nundermine”. Thus, there is simply the qualified assertion without any reasoned support for \n\nassertion. This is all the more surprising in that such assertions are normally accompanied b\n\nreference to the Road Map as something that needs to be restarted not as something that is act\n\nand vibrant and moving along. That the Road Map needs to be “relaunched,” the term used by \n\nEuropean Union28, there is no doubt; that this is a difficult and sensitive and long-stand\n\nproblem, there is no doubt; but no reason is given as to why an advisory opinion would make it \n\nmore difficult.\n\nWe agree that the Road Map needs to be reinvigorated, but there is no basis \n\nconcluding that an advisory opinion on the legal consequences of the Wall hinders that possibility.\n\nThe fifth and final point of view concerning the argument that the Court should \n\npronounce upon matters that are the subject of negotiations considers the argument in light of \n\nlegal context.\n\nMr. President and Members of the Court, this Israeli position needs to be carefu\n\nconsidered because it is particularly counter-productive and not in accord with international l\n\nIn fact, what Israel is saying is that the Court should not examine the Wall in the context of \n\nmany resolutions of the Security Council and the General Assembly of the United Nations \n\nshould it examine treaties to which Israel is a party based upon facts supplied by the Uni\n\nNations or the Conference of the Parties to that treaty.\n\nThe fact is that the Security Council and the General Assembly, and the Conference\n\nthe Parties to the Fourth Geneva Convention29, have spoken to some of the core issues at the he\n\nof this matter. In any objective sense it is not prejudicial to the Road Map if the Court exami\n\nthe Wall against those resolutions and treaty obligations. If Israel believes the Road Map will\n\nprejudiced if the Court does no more than review a fact namely, the Wall and this is no\n\ncomplex factual question in light of the resolutions of the United Nations, custom\n\ninternational law and Israel’s treaty obligations, that is a serious problem. That is a seri\n\nproblem for the peace process. It is a serious problem because what it means is that so much t\n\nhas gone before is in Israel’s view irrelevant. Israel would prefer to live in a world where \n\nInternational Court of Justice has not spoken on these same questions.\n\nIsrael occupied the West Bank, Gaza and East Jerusalem by force in 1967. The use\n\nforce is illegal under the United Nations Charter. The Security Council called for withdrawal\n\nIsrael in resolutions 242 of 1967 and 338 of 1973, but it has not occurred. Into the territory\n\noccupied by force Israel moved its settlers. That is fundamentally illegal under international law\n\nmatter what the justification for the occupation might be; it was confirmed by the Security Coun\n\nto apply in this instance; but Israel argues to the contrary.\n\nFurther, while it holds Palestinian territory by force, Israel denies the Palestinian peo\n\ntheir human rights and denies it is an Occupying Power subject to international humanitarian l\n\nand denies that it has obligations under the Fourth Geneva Convention, notwithstanding decisi\n\nof the Security Council and the General Assembly and the Conference of the Parties to the Fou\n\nGeneva Convention to the contrary. Israel even takes issue in its Written Statement with the f\n\nthat the question before the Court uses the phrase “Occupied Palestinian Territory, including in \n\naround East Jerusalem”30.\n\nMr. President, Members of the Court, the international community through the politi\n\ninstitutions of the United Nations and through the bodies that govern international humanitar\n\nlaw have spoken and they have spoken to Israel. There is not a word in the Written Statement\n\nsuggest that the Advisory Opinion is unnecessary because the Wall and the Settlements are \n\nin violation of international law, and there is not a word in the Written Statement to suggest t\n\nthe Advisory Opinion is unnecessary because Israel respects the resolutions of the Security Coun\n\nand the General Assembly and the Treaty obligations of Israel.\n\nIn conclusion, the fact that there are negotiations on the Road Map does not mean that \n\nCourt should not act. The Court is an organ of the United Nations. The General Assembly is\n\norgan of the United Nations. It is perfectly legitimate for the General Assembly to ask the Court \n\nits opinion on the legal consequences of the Wall in light of the situation of the Territor\n\noccupied by Israel. It is perfectly legitimate for the Court to give an opinion on the le\n\nconsequences of the Wall in light of the applicable international law, including the applica\n\nUnited Nations resolutions and the applicable treaties. If there are negotiations underway that\n\nall the more reason for the Court to act. If the negotiations are to have any chance of success, it\n\nessential that they proceed on the basis of an accurate understanding of the law. The Court is\n\norgan that has as its very purpose the giving of legal advice to the General Assembly and ot\n\norgans of the United Nations. It should give its advice when asked to do so and do so in light\n\nthe relevant facts and the relevant law. That is what is being asked of it in this case, and that\n\nwhat it should do."
    },
    {
        "voto": 0,
        "juez": "Kingdom of Saudi Arabia",
        "pregunta": "Israel is under an obligation to terminate its breaches of international law; it is under an obligation to cease forthwith the works of construction of the wall being built in the Occupied Palestinian Territory, including in and around East Jerusalem, to dismantle forthwith the structure therein situated, and to repeal or render ineffective forthwith all legislative and regulatory acts relating thereto, in accordance with paragraph 151 of this Opinion",
        "texto": "It is important that the record show that Saudi Arabia condemns terrorism in all of its forms. We are committed to the fight against terrorism. We are a party to relevant multilateral and regional conventions and have embraced Security Council resolution 1373 of 2001. However, as we have said in many fora, it is not enough just to condemn terrorism and fight terrorism. If one wishes to defeat terrorism, one needs also to address the motivation and the provocation that lead to terrorism. As our Foreign Minister, His Royal Highness Prince Saud al-Faisal said last year during the General Debate at the General Assembly:/n/n“[T]his international effort directed against terrorism will not eradicate this phenomenon if handled without addressing its roots./n/nThe deteriorating situation of peoples who are suffering oppression, injustice and persecution, or who are overburdened by occupation, and the inability of the international community, for one reason or another, to find just solutions for these problems, is what creates the environment that is exploited by evildoers...” This is part of the issue of terrorism./n/nA third preliminary point is to emphasize the constructive role and the interest of Saudi Arabia in the success of the Road Map. Indeed, the Road Map refers specifically to the initiative of His Royal Highness Crown Prince Abdullah which was endorsed by the Beirut Arab League Summit of March 20026 that calls for acceptance of Israel as a neighbour living in peace and security, in the context of a just and equitable settlement. The Road Map refers to the Saudi initiative as “a vital element of international efforts to promote a comprehensive peace on all tracks”. Any student of this conflict will recognize that this initiative constitutes a major stride towards peace. We accept two States living side by side in harmony based upon a negotiated settlement./n/nSaudi Arabia is party to a number of multilateral conventions against terrorism including: Convention of the Organization of the Islamic Conference on Combating International Terrorism, adopted at Ouagadougou (1 July 1999); Arab Convention on the Suppression of Terrorism, signed at a meeting held at the General Secretariat of the League of Arab States in Cairo (22 April 1998); Convention on the Marking of Plastic Explosives for the Purpose of Detection, signed at Montreal (1 March 1991); Protocol on the Suppression of Unlawful Acts of Violence at Airports Serving International Civil Aviation, supplementary to the Convention for the Suppression of Unlawful Acts against the Safety of Civil Aviation, signed at Montreal (24 February 1988); International Convention against the Taking of Hostages, adopted by the General Assembly of the United Nations (17 December 1979); Convention for the Suppression of Unlawful Acts against the Safety of Civil Aviation, signed at Montreal (23 September 1971); Convention for the Suppression of Unlawful Seizure of Aircraft, signed at the Hague (16 December 1970); and Convention on Offences and Certain Other Acts Committed on Board Aircraft, signed at Tokyo (14 September 1963)/n/nThus, Mr. President and Members of the Court, our criticism of the Wall cannot be viewed as supporting terrorism or as undermining the Road Map. To the contrary, we believe an advisory opinion on the question presented will contribute to the objective of eliminating terrorism and to bringing about a just and lasting peace in the region./n/nBefore continuing, however, in the light of the importance that has been attached to the Road Map in the presentations made to the Court, and given the importance of the Saudi initiative to the Road Map, it is important to be very clear about what was decided at the Beirut Summit. The Saudi Arabian proposal, formulated in a speech by His Royal Highness Crown Prince Abdullah, said:/n/n“The only acceptable objective of the peace process is the full Israeli withdrawal from all the occupied Arab territories, the establishment of an independent Palestinian state with [East Jerusalem] as its capital, and the return of refugees. Without moving towards this objective, the peace process is an exercise in futility and a play on words and a squandering of time which perpetuates the cycle of violence.”/n/nThus it was proposed, and again I quote: “Normal relations and security for Israel in exchange for a full withdrawal from all occupied Arab territories, recognition of an independent Palestinian state with [East Jerusalem] as its capital, and the return of refugees.” This proposal was adopted unanimously; and as noted, it is referred to as “a vital element” of the Road Map."
    },
    {
        "voto": 1,
        "juez": "Republic of South Africa",
        "pregunta": "Finds that it has jurisdiction to give the advisory opinion requested",
        "texto": "A matter that has been raised by all those that contest the jurisdiction of the Court is the fact that the Court has a discretion to decide whether or not to give an advisory opinion. This fact cannot be contested as Article 65, paragraph 1, clearly states that the Court may give an advisory opinion on any legal question at the request of whatever body that may, in accordance with the Charter of the United Nations, make such a request.\n\nIn this regard, the position of the Court in the case concerning the Interpretation of Peace Treaties with Bulgaria, Hungary and Romania, First Phase, Advisory Opinion (I.C.J. Reports 1950, p. 72) is noted. The discretion therefore undoubtedly exists. The question that begs answering, though, is how the Court should exercise this discretion in such a manner that it remains faithful to the requirements of its judicial character.\n\nOne of the main issues raised by the opponents of the Court’s jurisdiction, is the lack of the judicial propriety for the Court if it accedes to the request to give an advisory opinion. This position appears to be based on a number of grounds, inter alia, the following:\n\nthe lack of consent to the jurisdiction of the Court by Israel;\nthe question relates to a substantive dispute between the parties;\nthe fact that this is a political and not a legal question;\nthe alleged ultra vires nature of the request;\nthe assumption that any opinion on this matter will serve no purpose, and will be harmful to achieving a settlement of the conflict;\nthe lack of facts before the Court due to the withdrawal by Israel to participate in the hearing.\n\n“Propriety” is defined in the Oxford Dictionary as “correctness concerning standards of behaviour or morals; the details or rules of conventionally accepted behaviour; appropriateness; rightness”. Based on the reasons that follow, we immediately conclude that there can be no doubt that it is correct and appropriate for the Court to give an advisory opinion in this case. If the arguments against the Court’s jurisdiction are weighed one by one, the only logical conclusion is the unquestionable jurisdiction of the Court to issue an advisory opinion in the present case. We will now deal with some of these arguments individually.\n\nThe lack of consent to the jurisdiction of the Court by Israel\n\nBy virtue of being a Member of the United Nations, a State and, in this particular case Israel, accepts the possibility of the General Assembly requesting an advisory opinion from the Court in accordance with the relevant provisions of the Charter and the Statute of the Court on a legal question.\n\nThe Court, in the Namibia case, emphasized the aforementioned principle by stating:\n\n“South Africa, as a Member of the United Nations, is bound by Article 96 of the Charter, which empowers the Security Council to request advisory opinions on any legal question” (Legal Consequences for States of the Continued Presence of South Africa in Namibia (South West Africa) notwithstanding Security Council Resolution 276 (1970), Advisory Opinion, I.C.J. Reports 1971, p. 23, para. 31).\n\nA number of States, in their written opinions or submissions, have used the Eastern Carelia case as authority that “no State can, without its consent, be compelled to submit its disputes with other States either to mediation or arbitration, or to any other kind of pacific settlement” (Status of Eastern Carelia, Advisory Opinion, 1923, P.C.I.J., Series B, No. 5, p. 27). However, this case needs to be distinguished from the present, as all Member States of the United Nations by virtue of acceding to the Charter have accepted the competence of the United Nations organs to refer matters to the Court for advisory opinions.\n\nFurthermore, Article 65, paragraph 1, of the Statute of the Court provides that: “The Court may give an advisory opinion on any legal question at the request of whatever body may be authorized by or in accordance with the Charter of the United Nations to make such a request.”\n\nArticle 96, paragraph 1, of the United Nations Charter stipulates that: “The General Assembly or the Security Council may request the International Court of Justice to give an advisory opinion on any legal question.”\n\nThese two provisions establish the competence of the General Assembly to request an advisory opinion from the Court and also the competence of the Court to give the requested opinion on any legal question. The choice of “any” in both Articles makes the Court’s jurisdiction quite expansive and circumscribed by whether the issue at hand is a legal question.\n\nThe advisory opinion has been requested by the General Assembly in line with Article 96, paragraph 1, of the United Nations Charter. This provision does not require the General Assembly to obtain the consent of any party before it requests an advisory opinion from the Court.\n\nThe Court, in the Western Sahara case (I.C.J. Reports 1975) affirmed that its competence to give an opinion did not depend on the consent of the interested States, even when the case concerned a legal question actually pending between them. An instance where the Court would refuse to render an opinion is when the circumstances disclose that to give a reply would have the effect of circumventing the principle that a State is not obliged to allow its disputes to be submitted to judicial settlement without its consent.\n\nThe lack of consent to the giving of an advisory opinion from any particular State is not relevant to the jurisdiction of the Court to provide the requested opinion. As the Court said in its Advisory Opinion on the Applicability of Article VI, Section 22, of the Convention on the Privileges and Immunities of the United Nations:\n\n“The jurisdiction of the Court... to give advisory opinions on legal questions, enables United Nations entities to seek guidance from the Court in order to conduct their activities in accordance with law. These opinions are advisory, not binding. As the opinions are intended for the guidance of the United Nations, the consent of States is not a condition precedent to the competence of the Court to give them.” (I.C.J. Reports 1989, pp. 188-189, para. 31; emphasis added.)\n\nSimilar views were expressed in the earlier case of the Interpretation of Peace Treaties with Bulgaria, Hungary and Romania case (I.C.J. Reports 1950, p. 71). A clear distinction has always been maintained between contentious cases on the one hand and advisory opinions on the other. In the Legality of the Threat or Use of Nuclear Weapons case this Court has gone even further to say that:\n\n“[I]t is not for the Court itself to purport to decide whether or not an advisory opinion is needed by the Assembly for the performance of its functions. The General Assembly has the right to decide for itself on the usefulness of an opinion in the light of its own needs.” (Legality of the Threat or Use of Nuclear Weapons, Advisory Opinion, I.C.J. Reports 1996[I], p. 237, para. 16.)\n\nFurthermore, this Court has found in the Interpretation of Peace Treaties with Bulgaria, Hungary and Romania case, that an opinion cannot be refused solely because the General Assembly might act ultra vires, as the General Assembly has the right to request opinions which it believes will be useful to it in the exercise of its functions. The competence of the General Assembly to request an advisory opinion, therefore, cannot be doubted on the ground that the opinion sought will not contribute to the performance of its functions.\n\nThis Court finds that the lack of consent to the giving of an advisory opinion by any particular State cannot in any way restrict the jurisdiction of the Court to give the requested advisory opinion. The Court finds that the criteria for giving an advisory opinion are clearly stated in Article 65, paragraph 1, of the Statute of the Court and Article 96, paragraph 1, of the United Nations Charter and that the General Assembly in requesting an opinion from the Court is well within its competence as provided for by these Articles."
    },
    {
        "voto": 1,
        "juez": "Republic of South Africa",
        "pregunta": "Decides to comply with the request for an advisory opinion",
        "texto": "In answering this question, it is instructive to recall and to reflect on the Court’s own views on this matter. The main aspect arising from the Court’s earlier consideration of how it should exercise its jurisdiction is the fact that the Court should in principle not refuse to give an advisory opinion. This the Court stated in the Interpretation of Peace Treaties case. The Court expressed itself thus.\n\n“[t]he Court has constantly been mindful of its responsibilities as ‘the principal judicial organ of the United Nations’... When considering each request, it is mindful that it should not, in principle, refuse to give an advisory opinion. In accordance with the consistent jurisprudence of the Court, only ‘compelling reasons’ could lead it to such a refusal.” (Legality of the Threat or Use of Nuclear Weapons, I.C.J. Reports 1996(I), p. 235, para. 140.)\n\nThe Court then declared that there has been no refusal in the history of the present Court, based on the discretionary power of the Court, to act upon a request for an advisory opinion. In fact, the Court has never refused to give an advisory opinion whenever all the other requirements for the exercise of this jurisdiction have been met. In sum, the Court asserted quite strongly that it will not take lightly a decision to refuse to give an advisory opinion.\n\nThe question should then be what are the “compelling reasons” that need to exist in order for the Court to decide not to issue an advisory opinion?\n\nOne may here indicate that perhaps being able to tease out examples of these “compelling” reasons may be made somewhat difficult by the very fact that there has been no refusal of an exercise of discretion on this ground. That notwithstanding, what is positive therefrom is that this fact underscores the very point that the Court has made repeatedly, which is that it will not lightly or readily refuse to exercise this jurisdiction.\n\nThe Court should not shy away from its obligation where an opportunity presents itself to provide advice, based on solid legal principles, especially when faced with a unique situation of international concern like the one we have here today, in respect of which there have been clear indications of the horrendous effects that the Wall has on the Palestinian people.\n\nThe lack of facts before the Court\n\nWith regard to the argument that there is a lack of facts before the Court, the Court needs to determine “whether it has before it sufficient information and evidence to enable it to arrive at a judicial conclusion upon any disputed questions of fact, the determination of which is necessary for it to give an opinion in conditions compatible with its judicial character” (Western Sahara, Advisory Opinion, I.C.J. Reports 1975, pp. 28–29, para. 46).\n\nIn the present case there are no disputed facts that we must emphasize. The Court has before it the two reports: that of the Secretary-General of the United Nations and that of the Special Rapporteur of the Commission on Human Rights on the Situation of Human Rights in the Palestinian Territories occupied by Israel. The existence of the Wall is an undisputed fact that is bound to have legal consequences in terms of the rules and principles of international law as provided for in the question put to the Court and on which the Court should pronounce itself.\n\nIn the Namibia case, the Government of South Africa argued that: “Since the Court may only give an Advisory Opinion on a legal question, it may consequently be doubted whether it is entitled to furnish an Opinion if, in order to do so, it also has to make findings as to primary facts.” (Statement submitted by the Government of the Republic of South Africa, Vol. 1, p. 143, para. 45). The Court rejected this argument completely (I.C.J. Reports 1971, p. 27, para. 40).\n\nAs a matter of policy a Member State should not be allowed to undermine the judicial function of the Court by refusing to place facts it considers essential before the Court, and then benefit from this situation by seeking to use it as a means of denying the Court jurisdiction. Such a stratagem is, in our view, so simple and transparent that it falls to be rejected out of hand by the Court."
    },
    {
        "voto": 1,
        "juez": "Republic of South Africa",
        "pregunta": "The construction of the wall being built by Israel, the occupying Power, in the Occupied Palestinian Territory, including in and around East Jerusalem, and its associated régime, are contrary to international law",
        "texto": "Human rights violations\n\nFurther consequences of the separation Wall have been grave infringements of recognized human rights principles as enshrined in the International Covenant on Civil and Political Rights (ICCPR) and the International Covenant on Economic, Social and Cultural Rights (ICESCR) of 16 December 1966, which Covenants have both been ratified by Israel. The grave human rights situation resulting from the construction of the separation Wall is well documented in both the report of the Secretary-General and also the report of the Special Rapporteur, which documents are in the Court’s possession.\n\nArticle 2 of the International Covenant on Civil and Political Rights provides clearly that “each State Party to the present Covenant undertakes to respect and to ensure to all individuals within its territory and subject to its jurisdiction the rights recognised by the Covenant, without distinction of any kind, such as race, color, sex, language, religion, political or other opinion, national or social origin, property, birth or other status”.\n\nThese rights are universal and inalienable rights of all members of the human family, and it is incorrect in law and even amoral to suggest that the residents of the Occupied Palestinian Territory are not entitled to these rights."
    },
    {
        "voto": 1,
        "juez": "Republic of South Africa",
        "pregunta": "Israel is under an obligation to terminate its breaches of international law; it is under an obligation to cease forthwith the works of construction of the wall being built in the Occupied Palestinian Territory, including in and around East Jerusalem, to dismantle forthwith the structure therein situated, and to repeal or render ineffective forthwith all legislative and regulatory acts relating thereto, in accordance with paragraph 151 of this Opinion",
        "texto": "The right to self-determination\n\nThe separation Wall violates two of the most fundamental principles of contemporary international law, namely the prohibition on the forcible acquisition of territory and of the right to self-determination.\n\nThe right to self-determination and the concept of territory are intrinsically linked. The right of the Palestinian people to self-determination is unquestionable, has been reaffirmed by the United Nations on numerous occasions and forms the underlying principle of the two-State solution.\n\nAs the Special Rapporteur of the Commission on Human Rights has correctly pointed out in his report,\n\n“A people can only exercise their right to self-determination within a territory. The amputation of Palestinian territory by the construction of the Separation Wall seriously interferes with the right of self-determination of the Palestinian people as it substantially reduces the size of the self-determination unit.”"
    },
    {
        "voto": 1,
        "juez": "Republic of South Africa",
        "pregunta": "All States are under an obligation not to recognize the illegal situation resulting from the construction of the wall and not to render aid or assistance in maintaining the situation created by such construction; all States parties to the Fourth Geneva Convention relative to the Protection of Civilian Persons in Time of War of 12 August 1949 have in addition the obligation, while respecting the United Nations Charter and international law, to ensure compliance by Israel with international humanitarian law as embodied in that Convention",
        "texto": "Applicability of international humanitarian law\n\nThere is no doubt that the Geneva Conventions apply to the 1967 armed conflict. Israel’s obligations as an Occupying Power in the Palestinian Territory are governed by rules and principles of international law, international humanitarian law and international human rights law. The general framework of international law governing occupation as contained in the Hague Regulations of 1907 and the Fourth Geneva Convention, is applicable to the Occupied Palestinian Territory and to Israel as the Occupying Power. Israel is a party to the four Geneva Conventions and it is widely accepted that the Hague Regulations of 1907 are declaratory of general international law, as confirmed by the Court in its Nuclear Weapons Advisory Opinion.\nFurthermore, the United Nations General Assembly reaffirmed the applicability of the Fourth Geneva Convention relative to the Protection of Civilian Persons in Time of War, of 12 August 1949, to the Occupied Palestinian Territory, including Jerusalem, and the other occupied Arab territories, in its resolution A/RES/56/60 of 14 February 2002.\n\nDe facto annexation\n\nThe de facto consequence of the construction of the separation Wall, which deviates from the Green Line, which represents the actual boundary between Israel and Palestine, is that that area will be annexed and incorporated within the territory of Israel. This de facto annexation is an attempt to create facts on the ground that will be difficult to change. Such a construction not only violates various Security Council resolutions, but is also in direct breach of the rule of customary international law against the acquisition of territory by force or annexation. In international law, annexation of this kind is tantamount to conquest, which was banned by the prohibition of the use of force contained in Article 2, paragraph 4, of the Charter. Furthermore, the construction of the separation Wall violates one of the fundamental rules of international humanitarian law as laid out in Article 47 of the Fourth Geneva Convention, under which the rights of persons living in occupied territories are fully protected by international law. The Occupying Power, in this case Israel, may not alter their legal situation by either a unilateral act or annexation of the territory, for they remain protected persons.\n\nJustification of self-defence and military necessity\n\nThe principle of self-defence cannot be employed as a justification for the construction of the separation Wall. It is established international law that the right to self-defence is a temporary right. In the present case however, the permanent structure of the separation Wall suggests the opposite. The principles of necessity and proportionality, which form part of the doctrine of self-defence, enshrined in Article 51 of the Charter, have been violated by Israel through the construction and the severe consequences of the separation Wall. These consequences have been the unwarranted restrictions of movement, isolation of civilians from their farmlands, destruction of crops and impairment of access to essential social services as described in the report of the Secretary-General prepared pursuant to General Assembly resolution ES-10/13 (A/ES-10/248 dated 3 December 2003) which is before the Court. These consequences are totally disproportionate and unnecessary, bearing in mind that the focus of Israeli defence is occasional and irregular attacks by lone operators.\n\nA question of fact that begs the Court’s consideration is why, if the separation Wall as a measure of self-defence is intended to protect Israeli citizens and territory, it is not being constructed on undisputed Israeli territory? Is the logical explanation for the chosen route of the separation Wall cutting across occupied territory not an attempt of de facto annexation? The answer in our view is obvious and in the affirmative.\n\nThe justification that has consistently been advanced by the Israeli Government for the construction of the separation Wall, is that it is necessary to ensure the security of Israel. They maintain that the destruction and seizure of Palestinian property and the violation of human rights of the Palestinian population are demanded by the necessities of war, as permitted by Article 23 of the Hague Regulations of 1907. In this regard the Court should take note that the Israeli Government in this instance is relying for protection on the very same Hague Regulations that they have always maintained do not bind them. Nonetheless, it is submitted that the concept of “military necessity” does not release a State from the obligations of complying with international humanitarian law. The Geneva Conventions of 1949 and their Additional Protocols, together with the Hague Regulations, have already struck the balance between the demands made on the law of conduct of war and the requirements of humanity.\n\nThe right of Israel to security has never been denied, but this right must be exercised within recognized norms of international law."
    },
    {
        "voto": 1,
        "juez": "Republic of Bangladesh",
        "pregunta": "Finds that it has jurisdiction to give the advisory opinion requested",
        "texto": "The overriding importance and universal applicability of the advisory opinion to be rendered by the International Court of Justice.\n\nUnder the first heading Bangladesh would like to submit that the request for an advisory opinion made in resolution ES-10/16 is well founded in international law and is timely and appropriate in the context of the prevailing conditions in the Occupied Palestinian Territory. The basis of this submission is the persistent and continuing Israeli disregard of resolutions adopted by the United Nations Security Council, principally resolutions 242 and 348 and relevant resolutions of the United Nations General Assembly, the provisions of the Geneva Conventions and Additional Protocols and general international law. This persisting pattern of disregard over the decades threatens to undermine the authority and application of fundamental and peremptory norms of the United Nations Charter and international law.\n\nBangladesh considers that for the above reasons the advisory opinion to be rendered by the International Court of Justice will have significance beyond the Middle East and to future situations of conflict in different parts of the world. Since in the view of Bangladesh, the International Court of Justice will deliberate on fundamental principles of the Charter of the United Nations and international law, the Court’s pronouncement, will be timely, appropriate and likely to make a most valuable contribution to the establishment of peace not only in the Middle East but all over the world.\n\nIn this connection Bangladesh would like to recall the observations of the distinguished South African delegations in the debate of 8 December 2003 at the 10th Emergency Special Session of the General Assembly, in reference to the request for an advisory opinion as follows:\n“a clear precedent already exists for such an approach. In 1971 the United Nations Security Council called for an advisory opinion from International Court of Justice on the legal consequences for States of the occupation of Namibia. That opinion proved to be a turning point in the long struggle for independence of that country. We believe that Palestinians and Israelis alike would similarly benefit from a ruling of the International Court of Justice.”\n\nBangladesh fully concurs with this view. We also fully concur with the positions strongly stated in the previous presentations highlighting how the advisory opinion of this esteemed court will be in full consonance with positions taken by it in the past, the objective dictates of moral and legal compulsions and the overarching imperative to take all necessary steps to establish enduring peace in Palestine.\n\nBangladesh expresses its conviction that the advisory opinion to be rendered by the International Court of Justice will strengthen the application of the basic principles enshrined in the United Nations Charter and in general international law and would reaffirm that a just and lasting peace in the Middle East can only be established on the basis of these principles."
    },
    {
        "voto": 1,
        "juez": "Republic of Bangladesh",
        "pregunta": "Decides to comply with the request for an advisory opinion",
        "texto": "The overriding importance and universal applicability of the advisory opinion to be rendered by the International Court of Justice.\n\nUnder the first heading Bangladesh would like to submit that the request for an advisory opinion made in resolution ES-10/16 is well founded in international law and is timely and appropriate in the context of the prevailing conditions in the Occupied Palestinian Territory. The basis of this submission is the persistent and continuing Israeli disregard of resolutions adopted by the United Nations Security Council, principally resolutions 242 and 348 and relevant resolutions of the United Nations General Assembly, the provisions of the Geneva Conventions and Additional Protocols and general international law. This persisting pattern of disregard over the decades threatens to undermine the authority and application of fundamental and peremptory norms of the United Nations Charter and international law.\n\nBangladesh considers that for the above reasons the advisory opinion to be rendered by the International Court of Justice will have significance beyond the Middle East and to future situations of conflict in different parts of the world. Since in the view of Bangladesh, the International Court of Justice will deliberate on fundamental principles of the Charter of the United Nations and international law, the Court’s pronouncement, will be timely, appropriate and likely to make a most valuable contribution to the establishment of peace not only in the Middle East but all over the world.\n\nIn this connection Bangladesh would like to recall the observations of the distinguished South African delegations in the debate of 8 December 2003 at the 10th Emergency Special Session of the General Assembly, in reference to the request for an advisory opinion as follows:\n“a clear precedent already exists for such an approach. In 1971 the United Nations Security Council called for an advisory opinion from International Court of Justice on the legal consequences for States of the occupation of Namibia. That opinion proved to be a turning point in the long struggle for independence of that country. We believe that Palestinians and Israelis alike would similarly benefit from a ruling of the International Court of Justice.”\n\nBangladesh fully concurs with this view. We also fully concur with the positions strongly stated in the previous presentations highlighting how the advisory opinion of this esteemed court will be in full consonance with positions taken by it in the past, the objective dictates of moral and legal compulsions and the overarching imperative to take all necessary steps to establish enduring peace in Palestine.\n\nBangladesh expresses its conviction that the advisory opinion to be rendered by the International Court of Justice will strengthen the application of the basic principles enshrined in the United Nations Charter and in general international law and would reaffirm that a just and lasting peace in the Middle East can only be established on the basis of these principles."
    },
    {
        "voto": 1,
        "juez": "Republic of Bangladesh",
        "pregunta": "The construction of the wall being built by Israel, the occupying Power, in the Occupied Palestinian Territory, including in and around East Jerusalem, and its associated régime, are contrary to international law",
        "texto": "The application of the principles of the United Nations Charter, the resolutions of United Nations Security Council and United Nations General Assembly, for a just and lasting peace in the Middle East based on the termination of the illegal occupation of Palestinian territory and the self-determination of the people of Palestine.\n\nWe would like to submit that a just and lasting peace in the Middle East is based on the fundamental principle of the United Nations Charter and general international law that forcible occupation of Palestinian territory is illegal and attempted annexation of territory through use of force is also illegal. This principle underlines the relevant Untied Nations Security Council resolutions including resolutions 242, 338, 1397 and 1402. It also informs the peace process, and the recommendations of the Mitchell Report, the Tenet Work Plan and the Road Map endorsed by the Quartet. This fundamental principle requires the withdrawal of Israeli forces from the occupied territories and the declaration of Israeli settlements illegal and an obstacle to peace and calls for the complete cessation of settlement activities. The construction of the Wall operates to frustrate and undermine the application of this fundamental principle and represents a move to annex and permanently occupy the territory of Palestine and alter the ground realities to the detriment of the people of Palestine. A series of United Nations General Assembly resolutions have reaffirmed the inalienable right of the Palestinian people to self-determination including their right to have an independent State of their own while recognizing that all States in the region have the right to live in peace within secure and internationally recognized boundaries. The ongoing construction of the Wall effectively denies the right of the people of Palestine to self-determination. The construction also negates the inalienable right to return of the Palestinian people.\n\nThe application of international humanitarian law and in particular the Fourth Geneva Convention.\n\nThe Fourth Geneva Convention of 1949 prohibits the occupying power from depriving protected persons from the benefit of the Convention in any case or in any manner whatsoever including annexation of the whole or part of the occupied territory (Art. 47). This provision has been described as having “an absolute character”. The provision also incorporates a universally recognized rule endorsed by jurists and confirmed by numerous rulings of national and international courts, namely, “As long as hostilities continue the Occupying Power cannot therefore annex the occupied territory, even if it occupies the whole of the territory concerned. A decision on the point can only be reached in the peace treaty.” The construction of the Wall violates and breaches this basic rule, which has been declared applicable to the Occupied Territory of Palestine by resolutions of the United Nations Security Council and the United Nations General Assembly. The construction of the Wall also breaches Articles 9, 39, 51 of the Fourth Geneva Convention. It effectively deprives the Palestinian people from enjoyment of their property, access to employment and means of livelihood, access to natural resources necessary for human survival.\nFor these reasons it is our submission that the construction of the Wall constitutes a grave breach of the Geneva Conventions of 1949.\n\nThe four Geneva Conventions of 1949 and the Additional Protocols of 1977 enjoy universal acceptance and have passed into customary international law. These instruments constitute the central pillars of international humanitarian law. In the hierarchy of norms, the Geneva Conventions enjoy precedence. The Israeli claim that the Wall constructed in the Occupied Palestine Territory as a security barrier is not tenable. The location of the Wall itself raises grave questions of legality and the actual motive behind the construction of the Wall in the Occupied Territories. As was made amply clear in the Palestinian presentation this morning, the security needs could very well have been addressed by Israel without fundamentally altering the character of the Occupied Territories and segmenting it into small parcels with the presence of Israeli settlements. Bangladesh respectfully submits that the International Court of Justice reaffirms the sanctity of the Geneva Conventions and their application to the situation now obtaining in Palestine. It is necessary that this be so for the maintenance of international peace and security and that an affirmation of fundamental points of law is essential to uphold the rule of law amongst nations. The International Court of Justice, we hope, will adjudge and declare the construction of the Wall as illegal and contrary to general international law. We also hope that the esteemed Court will spell out in clear terms the legal consequences of the construction of this Wall.\n\nThe legal consequences of the construction of the Wall\n\nThe construction of the Wall in Palestine territory by the Occupying Power represents the culmination of a long-standing policy of permanent occupation and annexation of territory. The construction engenders crimes against humanity and in particular the following:; Intentionally directing attacks against the civilian population as such or against individual civilians not taking a direct part in hostilities,; Intentionally directing attacks against civilian objects, that is, objects which are not military objectives,; Intentionally directing attacks against personnel, installations, materials, units or vehicles involved in a humanitarian assistance or peace-keeping mission in accordance with the United Nations Charter, as long as they are entitled to the protection given to civilians or civilian objects under the international law of armed conflicts,; The transfer, directly or indirectly, by the Occupying Power of parts of its own civilian population into the territory it occupies, or the deportation or transfer of all or parts of the population of the Occupied Territory within or outside this Territory,; Intentionally directing attacks against buildings dedicated to religion, education, art, science or charitable purposes, historic monuments, hospitals and places where the sick and wounded are collected, provided they are not military objectives,; Destroying or seizing the enemy’s property unless such destruction or seizure be imperatively demanded by the necessities of war,; Declaring abolished, suspended or inadmissible in a court of law the rights and actions of the nationals of the hostile party,; Committing outrages upon personal dignity, in particular humiliating and degrading treatment,; Intentionally directing attacks against building, materials, medical units and transport and personnel using the distinctive emblems of the Geneva Conventions in conformity with international law; Intentionally using starvation of civilians as a method of warfare by depriving them of objects indispensable to their survival, including wilfully impeding relief supplies as provided for under the Geneva Convention.\n\nBangladesh submits that the impact of the construction of the Wall in and at the vicinity of Jerusalem also deserves special consideration by the International Court of Justice, as it alters or purports to alter the special status of the Holy City sacred to three great faiths. Bangladesh believes that the solution of the problem of Jerusalem and abandoning the construction of the Wall in the vicinity of the Holy City is a key to the achievement of just and durable peace in the Middle East."
    },
    {
        "voto": 1,
        "juez": "Republic of Bangladesh",
        "pregunta": "Israel is under an obligation to make reparation for all damage caused by the construction of the wall in the Occupied Palestinian Territory,including in and around East Jerusalem",
        "texto": "The application of the principles of the United Nations Charter, the resolutions of United Nations Security Council and United Nations General Assembly, for a just and lasting peace in the Middle East based on the termination of the illegal occupation of Palestinian territory and the self-determination of the people of Palestine.\n\nWe would like to submit that a just and lasting peace in the Middle East is based on the fundamental principle of the United Nations Charter and general international law that forcible occupation of Palestinian territory is illegal and attempted annexation of territory through use of force is also illegal. This principle underlines the relevant Untied Nations Security Council resolutions including resolutions 242, 338, 1397 and 1402. It also informs the peace process, and the recommendations of the Mitchell Report, the Tenet Work Plan and the Road Map endorsed by the Quartet. This fundamental principle requires the withdrawal of Israeli forces from the occupied territories and the declaration of Israeli settlements illegal and an obstacle to peace and calls for the complete cessation of settlement activities. The construction of the Wall operates to frustrate and undermine the application of this fundamental principle and represents a move to annex and permanently occupy the territory of Palestine and alter the ground realities to the detriment of the people of Palestine. A series of United Nations General Assembly resolutions have reaffirmed the inalienable right of the Palestinian people to self-determination including their right to have an independent State of their own while recognizing that all States in the region have the right to live in peace within secure and internationally recognized boundaries. The ongoing construction of the Wall effectively denies the right of the people of Palestine to self-determination. The construction also negates the inalienable right to return of the Palestinian people."
    },
    {
        "voto": 1,
        "juez": "Republic of Bangladesh",
        "pregunta": "All States are under an obligation not to recognize the illegal situation resulting from the construction of the wall and not to render aid or assistance in maintaining the situation created by such construction; all States parties to the Fourth Geneva Convention relative to the Protection of Civilian Persons in Time of War of 12 August 1949 have in addition the obligation, while respecting the United Nations Charter and international law, to ensure compliance by Israel with international humanitarian law as embodied in that Convention",
        "texto": "The application of the principles of the United Nations Charter, the resolutions of United Nations Security Council and United Nations General Assembly, for a just and lasting peace in the Middle East based on the termination of the illegal occupation of Palestinian territory and the self-determination of the people of Palestine.\n\nWe would like to submit that a just and lasting peace in the Middle East is based on the fundamental principle of the United Nations Charter and general international law that forcible occupation of Palestinian territory is illegal and attempted annexation of territory through use of force is also illegal. This principle underlines the relevant Untied Nations Security Council resolutions including resolutions 242, 338, 1397 and 1402. It also informs the peace process, and the recommendations of the Mitchell Report, the Tenet Work Plan and the Road Map endorsed by the Quartet. This fundamental principle requires the withdrawal of Israeli forces from the occupied territories and the declaration of Israeli settlements illegal and an obstacle to peace and calls for the complete cessation of settlement activities. The construction of the Wall operates to frustrate and undermine the application of this fundamental principle and represents a move to annex and permanently occupy the territory of Palestine and alter the ground realities to the detriment of the people of Palestine. A series of United Nations General Assembly resolutions have reaffirmed the inalienable right of the Palestinian people to self-determination including their right to have an independent State of their own while recognizing that all States in the region have the right to live in peace within secure and internationally recognized boundaries. The ongoing construction of the Wall effectively denies the right of the people of Palestine to self-determination. The construction also negates the inalienable right to return of the Palestinian people."
    },
    {
        "voto": 1,
        "juez": "Republic of the Sudan",
        "pregunta": "Finds that it has jurisdiction to give the advisory opinion requested",
        "texto": "On the competence of the Court\n\nOn the competence of the Court, Article 92 of the United Nations Charter designated the Court as the “principal judicial organ of the United Nations”, and Article 96, paragraph 1, stipulates that the General Assembly or the Security Council may request the International Court of Justice to give an advisory opinion on any legal question. The Statute of the Court (Article 65) further stipulates that the Court may give an advisory opinion on any legal question at the request of whatever body may be authorized by or in accordance with the Charter of the United Nations to make such a request. There are no limitations, provisos or restrictions in those Articles, once the organs are requesting opinions on a question of law.\n\n6. The General Assembly, as authorized by the United Nations Charter has made such a request to the Court via its resolution ES-10/14 adopted on 8 December 2003 to urgently render an advisory opinion on the question of:\n\n “What are the legal consequences arising from the construction of the wall being built by Israel, the Occupying Power, in the Occupied Palestinian Territory, including in and around Jerusalem, as described in the report of the Secretary-General, considering the rules and principles of international law, including the Fourth Geneva Convention of 1949, and relevant Security Council and General Assembly resolutions?”\n\nThis request has come from a duly authorized organ (the United Nations General Assembly) as stipulated by the United Nations Charter and the Statute, and on a question of law (the legal consequences of the construction of the Wall within the rules and principles of international law). Arguments to the contrary do not hold, as the Court itself has proved through time. In its Advisory Opinions of 28 May 1948 and 3 March 1950 on Admission of States to the United Nations, the Court declared that it could give an opinion on any legal question and that there was no provision which prohibited it from exercising “an interpretive function falling within the normal exercise of its judicial powers”.\n\nThe Court further pointed out in its Opinion of 3 March 1950 that it could not attribute a political character to a request “which, framed in abstract terms, invited it to undertake an essentially judicial task, the interpretation of a treaty provision”. It is also a known fact that the majority of international law issues are typically part of a wider political context.\n\nIn its Advisory Opinion on the Legal Consequences for States of the Continued Presence of South Africa in Namibia of 21 June 1971, the President of the Court declared on the question of political pressure, and as a matter of judicial propriety, that the Court as the principal judicial organ of the United Nations, and in that capacity “would act only on the basis of law, independently of all outside influences or interventions whatsoever”.\n\nThe competence of the Court was again emphasized on considering the Western Sahara Advisory Opinion request in October 1975. The Court stated that “under Article 65, paragraph 1, of the Statute, the Court may give an advisory opinion, on any legal question at the request of any duly authorized body. The Court notes that the General Assembly of the United Nations is suitably authorized by Article 96, paragraph 1, of the Charter and that the two questions submitted to it are framed in terms of law and raise problems of international law. They are in principle questions of a legal character, even if they also embody questions of fact, and even if they do not call upon the Court to pronounce on existing rights and obligations. The Court is accordingly competent to entertain the request.”\n\nThe Court also, in the WHO and Egypt Advisory Opinion of 20 December 1980, stated that “it does not have to deal with the motives, which may have inspired the request once a submitted request falls within the normal exercise of its judicial process”. The Court affirmed this position further in the Nuclear Weapons Advisory Opinion of 6 July 1996.\n\nThe Court thus has consistently taken the position, that as the principal judicial organ of the United Nations, it has to shoulder its judicial interpretive responsibilities, and only decline giving opinions when there are compelling reasons, and when the question is not of law. As a matter of fact this Court has never failed to assert its competence to give advisory opinions on cases referred to it by duly authorized organs of the United Nations, and which has competence to do so on the specified issue. In this respect the Court summarized its practice in granting advisory opinions in the case concerning the Legality of the Threat or Use of Nuclear Weapons, 1996, when it stated: “In accordance with the jurisprudence of the Court, only ‘compelling reasons’ could lead it to such a refusal... there has been no refusal, based on the discretionary power of the Court, to act upon a request for advisory opinion in the history of the present Court.”\n\n "
    },
    {
        "voto": 1,
        "juez": "Republic of the Sudan",
        "pregunta": "The construction of the wall being built by Israel, the occupying Power, in the Occupied Palestinian Territory, including in and around East Jerusalem, and its associated régime, are contrary to international law",
        "texto": "The continuous construction and the presence of the Wall along the route which it follows defy the will of the international community. The Secretary-General’s report clearly states that Israel has not complied with the demand of the United Nations General Assembly in its resolution ES-10/13 to stop or reverse the ongoing construction of the barrier. The report’s observations included the following: “In keeping with the request of the General Assembly in resolution ES-10/13, I have concluded that Israel is not in compliance with the Assembly’s demand that it ‘stop and reverse the construction of the wall in the Occupied Palestinian Territory’.”\n\nIn his recent statement to the Court of 19 January 2004, the Secretary-General further concludes that the update of the report “finds that the Government of Israel has continued with ongoing construction of the barrier along the route approved by the Israeli cabinet on 1 October 2003 in Decision 883”.\n\n16. The Wall built in Occupied Palestinian Territory complicates efforts for reaching a final settlement to the Palestinian-Israeli problem, which has remained a highly threatening issue for international peace and security. As the United Nations Secretary-General concluded in his report prepared pursuant to General Assembly resolution ES-10/13, the Wall is of serious concern and has implications for the future. As he put it,\n\n“In the midst of the roadmap process, when each party should be making good-faith confidence-building gestures, the Barrier’s construction in the West Bank cannot in this regard, be seen as anything but a deeply counterproductive act. The placing of most of the structure on Occupied Palestinian Land could impair further negotiations.”\n\nThe Wall, hence, is a contradiction to international law being built in the Occupied Territory and can only be seen as intended to prejudge and complicate the final solution. The Secretary-General’s report further concludes “the Wall could change the longer-term prospects for peace by making the creation of an independent, viable and contiguous Palestinian State more difficult, or that increases suffering among the Palestinian People”.\n\nIt is therefore our contention that an advisory opinion pronouncing the legal consequences of the construction of the Wall shall benefit the prospects for peace by clarifying the law and discouraging unilateral negative actions.\n\nIt is a breach of international obligations by a State when an act of that State is not in conformity with what is requested of it by that obligation, regardless of its origin or character: this is found in Article 12 of the Draft Law on State Responsibility adopted by the International Law Commission in 2001 and of which the United Nations General Assembly took note in resolution 56/83 of 12 December 2001.\n\nThe construction of the Wall is to be considered an internationally wrongful act, as it constitutes a breach of international law within the meaning of these Articles.\n\nIt follows that Israel should continue the duty to perform the obligation breached including termination and cessation of the wrongful act, restitution and reparation.\n\nFurthermore, the construction of the Wall and its planned route, which deviates from the Armistice Line, and consumes almost 16.6 per cent of the entire West Bank, as reported by the United Nations Secretary-General, clearly violates the status of Palestine and infringes on the right of the Palestinian people to self-determination. It also violates a fundamental principle of international law that is the inadmissibility of the acquisition of territory by force. The Court, as the guardian of international law, has the duty to give guidance when international law is violated: as the Court has stressed in its Advisory Opinion on the South Africa in Namibia case of June 1971, on the question of legal consequences, “an illegal situation can not remain without consequences”. The construction of the Wall by Israel entails undesirable consequences if left unchecked.\n\nMr. President, honourable Members of the Court, in conclusion, the Government of the Sudan is of the opinion that:\n\nthe Court is competent and has jurisdiction to grant an advisory opinion on the legal question submitted to it by the United Nations General Assembly, and that there are no compelling reasons preventing it from doing so; and that the construction of the Wall by Israel in the Occupied Palestinian Territory is in contradiction of international law, and that it should comply with the United Nations General Assembly’s resolution ES-10/13 of 21 October 2003 to stop and reverse the construction of the Wall in the Occupied Palestinian Territory including in and around East Jerusalem. It should also be obliged to make adequate reparations for the damages caused by the construction action."
    },
    {
        "voto": 1,
        "juez": "Republic of the Sudan",
        "pregunta": "All States are under an obligation not to recognize the illegal situation resulting from the construction of the wall and not to render aid or assistance in maintaining the situation created by such construction; all States parties to the Fourth Geneva Convention relative to the Protection of Civilian Persons in Time of War of 12 August 1949 have in addition the obligation, while respecting the United Nations Charter and international law, to ensure compliance by Israel with international humanitarian law as embodied in that Convention",
        "texto": "On the applicability of international law on the Israeli action Mr. President, honourable Members of the Court, once the Court ascertains its competence in dealing with the request, then we believe the question of the legal consequences of the construction of the Wall within international law entails the consideration of a number of issues. Our contribution will focus on a limited number of these issues.\n\nThe question of the occupation of Israel of Palestinian and other Arab territories is beyond contention. This is ascertained in relevant United Nations Security Council and United Nations General Assembly resolutions. For example United Nations Security Council resolution 242 of 1967, referred to “territories occupied in the recent conflict”. The Occupied Palestinian Territories terminology has been used in numerous resolutions including the recent United Nations General Assembly resolutions of which ES-10/14 requested the urgent advisory opinion from this Court. The International Committee of the Red Cross in a statement before the conference of High Contracting Parties to the Fourth Geneva Convention, convened in Geneva on 5 December 2001, stated that it has always “affirmed the de jure applicability of the Fourth Geneva Convention to the territories occupied since 1967 by the State of Israel, including East Jerusalem”. The International Committee of the Red Cross further stated:\n\n“the Convention, ratified by Israel in 1951 remains fully applicable and relevant in the current context of violence. As an occupying power, Israel is also bound by other customary rules relating to occupation expressed in the regulations annexed to the Hague Convention respecting the laws and customs of war of 18th October 1907.” The High Contracting Parties have twice affirmed the applicability of the Fourth Geneva Convention on the Occupied Palestinian Territory on 15 July 1999, and on 5 December 2001 in the Geneva special sessions, respectively. United Nations resolution A/58/155 of 15 July 2003 has affirmed the same.\n\nThe Special Rapporteur of the Commission on Human Rights on the Situation of Human Rights in the Palestinian Territories Occupied by Israel  and this is its title  since 1967, report A/57/366 dated 29 August 2002, quoted the United Nations Secretary-General, speaking to the Security Council on 12 March 2002, as calling upon Israel to end its “illegal occupation” of the Palestinian Territory.\n\nAsked why he used the term “illegal”, he replied that the Security Council and the General Assembly have both on various occasions declared aspects of Israeli occupation as illegal. The comments of the Secretary-General  stated the Special Rapporteur  “underscore the fact that it is by the law of occupation that Israel’s conduct must be judged and that many of its practices violate basic principles of that governing law”.\n\nThe applicability of the Convention and other customary rules of international humanitarian law oblige the occupying power to refrain from certain acts that are in violation of them. Common Article I of the Convention obliges the High Contracting Parties to undertake to respect and to ensure respect for the Convention in all circumstances. The construction of the Wall, as stated in resolution ES-10/13, which demanded that Israel stop and reverse its construction; this construction is in contradiction to the relevant provisions of international law. Also, the construction of the Wall and the whole régime of measures relating to the Wall entails confiscation of lands, serious hardship to the occupied population, including displacement, other demographic effects and undue restriction of movement and mobility, as enumerated in the United Nations Secretary-General’s report ES-10/248 of 24 November 2003 pursuant to United Nations General Assembly resolution ES-10/13, and in addition to prejudice to territorial status, all being in violation of international law.\n\nThe Wall also violates international human rights law. It places undue suffering on the occupied Palestinian population and infringes on their basic human rights as stipulated in the two human rights covenants and other relevant instruments, which are blinding on Israel. The Secretary-General’s report clearly establishes this fact. The Court can rely on the Secretary-General’s fact analysis in giving its opinion, as the text of the Assembly’s request makes clear. The Wall will affect the lives of some 17,000 Palestinians in the West Bank and 220,000 in East Jerusalem. As the Secretary-General put it, “Palestinians will live in enclaves, areas where the Barrier almost completely encircles communities and tracts of land. The planned route incorporates nearly 320,000 settlers, including approximately 178,000 in Occupied East Jerusalem.”\n\nThe humanitarian and socio-economic impact was further illuminated by the Secretary-General’s report. “Recent reports by the World Bank and the United Nations show that construction has dramatically increased such damage in communities along its route, primarily through the loss, or severely limited access to land, jobs, and markets.”\n\nThe Wall, as the report informs, restricts movement of the population, isolated towns, affected health services, curtailed agricultural output and increased food insecurity in the region, all in violation of human rights law."
    },
    {
        "voto": 1,
        "juez": "League of Arab States",
        "pregunta": "Finds that it has jurisdiction to give the advisory opinion requested",
        "texto": "The Court should render the requested opinion as there are no compelling reasons for the Court to refuse the request.\n\nLet me analyse some of the objections put forward against the propriety of the Court rendering the opinion.\n\nThe argument of “a pending dispute” or “circumvention”\n\nIt has been claimed by Israel, and a few other States, that the request concerns a contentious matter in respect of which Israel has not given its consent to the jurisdiction of the Court, and that it was, therefore, improper for the Court to render the requested opinion. Otherwise, the principle that a State is not obliged to allow disputes to be submitted to the Court without its consent would be circumvented.\n\nSuch consideration of propriety, however, could only apply where the essential content of a dispute was a mere bilateral matter between two States arising independently of the United Nations. But, is the problem which the Court is requested to address a dispute of an essentially bilateral character?\n\nNo it is not. The issue put before the Court has to be determined in light of the terms of the question put to it. The question relates to an enlightenment of the General Assembly on the legal consequences of a specific circumstance: the construction of the Wall.\n\nIsrael could not, validly, object to the General Assembly’s exercise of its powers to deal with, and to seek an opinion on, the violations of fundamental principles of the Charter, including the right to self-determination, the violations of international humanitarian law, where there is an obligation on all parties to the Geneva Conventions “to respect and to ensure respect” of their provisions, and the violations of fundamental human rights law, all of which constitute erga omnes obligations “owed to the international community as a whole”\n\nIn addition, many of the norms\n\nviolated by Israel constitute peremptory norms of international law: ius cogens. Thus, other States not only Palestine may “take lawful measures” against Israel “to ensure the cessation of the breach and reparation in the interest of the injured State or of the beneficiaries of the obligation breached”3 I am quoting the ILC Draft  in this case the “interest” of Palestine and the Palestinians affected by the Wall.\n\nClearly, there is in this case a controversy, but one which has its fons et origo in a larger one, which arose within the ranks of the League of Nations and was later inherited by the United Nations, and today remains in its custody. It is a controversy over matters in which the General Assembly is directly involved. There are so many United Nations resolutions on Israel’s illegal occupation of the territories in which the Wall is being constructed. The controversy did not arise independently in bilateral relations.\n\nThe object of the request is to obtain from the Court an opinion which the General Assembly deems of assistance for the proper exercise of its functions concerning Palestine. The legal questions involved in the request are located in a broader frame of reference than the settlement of a particular bilateral dispute. They embrace a broad range of questions relating to the functioning of the United Nations and the legal order in general.\n\nWhy should it be “improper” for the Court to address these questions?\n\nThe alleged “absence of an essential factual context”\n\nBy pretending that it was not going to address the substance while it has indeed Israel is trying to mislead the Court into a decision not to answer the request because it has not before it the factual and legal issues essential to any proper assessment of the substance of the request, to which it alone, it boasts, can contribute. And, accordingly, it is alleged, the Court would have to base its pronouncement on facts which are not well established, and, thus, on “speculation”.\n\nThis is in itself a very speculative argument. It is part of the judicial function to deal with situations where the facts are controversial. It is part of the judicial function to determine what facts are relevant for a certain conclusion on the legal situation, in this case: whether the Wall is in violation of certain rules of international law or whether its construction can be justified.\n\nActually, the Court is already in possession of sufficient information and evidence furnished by independent sources, including the United Nations, its organs, Rapporteurs and other international organizations, as well as by States. It does not need such information from Israel alone. Yet, Israel too has furnished extensive information and evidence through its official declarations and through its Written Statement, together with its annexes, of which the Court will undoubtedly avail itself. Israel cannot now complain that the Court does not have facts that it would have, otherwise, furnished. It was invited to do so but chose not to furnish more. A State which declines to give certain information to the Court is certainly precluded from raising an alleged lack of information of the Court as a basis for challenging the propriety of the Court pronouncing itself on the issue.\n\nYet, there is no real uncertainty concerning the facts. Probably, the only disagreement is over the issue of when and for how long the gates of the Wall are open!\n\nDoes the uncertainty about the facts make it “improper” for the Court to render the requested opinion?\n\nThe alleged violation of procedural justice\n\nIsrael claims that the way in which the question is asked violates principles of procedural justice, it argues, the question arbitrarily selects only one specific aspect of the problem and neglects all others. Thus, a fundamental issue of procedural justice arises, Israel argues. One could simply respond that it is up to the General Assembly to choose the question on which it wants to have the advice of the Court, and that it is not for the Court to second-guess this wish. The entire argument, however, is a gross distortion of the true situation. Israel’s main concern, the alleged security threat, is clearly put before the Court. Israel has had ample opportunities to argue this before the Court, and it has, for all practical purposes, done so in its Written Statement. It might have been helpful if Israel had put more concrete arguments before the Court. But Israel certainly cannot claim that it was not granted procedural equality.\n\nThe requirements of procedural justice cannot make it improper for the Court to render this opinion.\n\nThe alleged absence of a useful purpose\n\nIt has been argued, wrongly relying on certain dicta of the Court, that it should not answer the question because that answer could not serve any useful purpose. The authors of this argument seem to think that in the light of the determinations which competent organs of the United Nations have already made, a determination by the Court could not have any added value.\n\nThe General Assembly has indeed made a determination as to the illegality of the Wall, and has also declared one essential consequence of this illegality, namely that the construction should cease and that the parts of the Wall already built must be demolished. Yet, also in this respect, it is up to the General Assembly to choose the issue where it wants further guidance by the Court. But beyond this formal argument: it will, inter alia, be useful for the General Assembly to have its declarations confirmed by the Court, in particular as the views expressed by the General Assembly and by other United Nations bodies are contested by Israel; to gain clarity on a number of grounds of illegality; to gain clarity on a number of legal consequences which have not been comprehensively addressed by the General Assembly.\n\nIt is of course not for the Court to instruct the General Assembly as to what further action it should take in the light of the Court’s pronouncement. The General Assembly will certainly remain seised with the issue of Palestine. Its role has been that of formulating principles and goals which govern or should govern the international community and of promoting political processes to further these goals. This role will certainly be inspired by the pronouncement of the Court. And if further measures of implementation are needed, the General Assembly could also address a recommendation to the Security Council and it will then be appropriate for the Council to take as a basis for its decision the legal situation as clarified by the Court."
    },
    {
        "voto": 1,
        "juez": "League of Arab States",
        "pregunta": "Decides to comply with the request for an advisory opinion",
        "texto": "Concluding remarks: the responsibility of the Court in the present proceedings.\n\nThe Arab League would thus like to conclude by expressing its confidence that the Court will fulfil the singular responsibility imposed upon it by exercising its role as the principal judicial organ of the United Nations. This reference in Article 96 of the Charter is loaded with meaning. The Court an organ of the United Nations this means that it is an integral part of the United Nations system and hence one element of the system of maintenance of international peace and security established by the Charter. And as such its case law has participated in the reduction of world tensions. The Charter’s purposes and principles have come to reflect the global values of the international community and it is widely accepted today that, in addition to aggression, violations of core human rights, including the right to self-determination, as well as grave breaches of international humanitarian law, constitute the main threats to international peace and security.\n\nAs an organ of the United Nations, the Court has as its lodestar the purposes and principles for which the Organization exists these purposes and principles underlie the question of Palestine: self-determination, prohibition of the use of force, human rights and humanitarian law in its broadest sense. There is now an unprecedented unanimity on the part of the Members of the United Nations, its principal and subsidiary organs and its Specialized Agencies, that the construction of the Wall violates these purposes and principles. The Court has in the past always worked in the same direction as the other organs of the United Nations in upholding these purposes and principles. It has also promoted the work of the Organization against restrictive assertions of sovereignty by Member States. It has confirmed the normative activity of the United Nations organs, in particular the General Assembly, by upholding the fundamental role of its resolutions in the customary law process (Namibia, Nicaragua, East Timor cases), its general responsibility in the maintenance of international peace and security (Expenses case), and its primary responsibility towards mandates, trust and non-self-governing territories (Namibia, Western Sahara, East Timor). The Court a judicial organ of the United Nations this has led the Court to underline the complementarity of its judicial function with the functions of the political organs of the United Nations, insisting on the “functional parallelism” which exists between it and the General Assembly and the Security Council. It has rejected the view that there are intrinsically legal questions, on the one hand, and, on the other, intrinsically political questions which are not amenable to legal and judicial scrutiny.\n\nThe Court a principal organ of the United Nations this means today that it is the court of the world community and hence the legal guardian of community values and interests. The Court has been aware of this mission. On a number of occasions it has juxtaposed the traditional bilateralist structure of international law with the notion of “collective” interest. The Court has made reference to the concept of international community which it has seen as personified in the United Nations. The Court has affirmed not only that every State has a legal interest in the respect of obligations owed to itself individually, but that each State had a duty to react to certain situations of objective illegality Namibia Opinion.\n\nPalestine, as a former Mandate, is the beneficiary of the sacred trust of civilization the main purpose of the Mandate system. This means today that the world community has a responsibility for the attainment of the right to self-determination by the Palestinian people, including the two-State solution and in the protection of its territorial integrity, that is the whole territory under occupation. As a court of the world community, the Court has its role to play in the attainment of these objectives. It now has the opportunity to pronounce on the legal consequences of the construction of a wall. To warn, as some States have done, that a pronouncement of the Court would be unhelpful or hinder negotiations, is a far-fetched presumption which has nothing to do with reality. What is very real, however, is the prospect that the silence of the Court would have dire consequences for the future emergence of Palestine as a viable and fully sovereign State. The Court, thus, must not abdicate its judicial function in the face of this Palestinian tragedy. Ultimately, it was the breakthrough pronouncements in the Namibia case, not the silence of the Court in the contentious South West Africa case, that contributed to the exercise of self-determination and full independence of that other Mandate inherited by the United Nations from its predecessor."
    },
    {
        "voto": 1,
        "juez": "League of Arab States",
        "pregunta": "The construction of the wall being built by Israel, the occupying Power, in the Occupied Palestinian Territory, including in and around East Jerusalem, and its associated régime, are contrary to international law",
        "texto": "Fundamental rules and principles of the Charter\n\nFundamental principles of the Charter: the essential point is that the construction of the Wall fundamentally affects the demographic structure of the Occupied Palestinian Territories. It leads to a fragmentation of the Palestinian space, which has rightly been called Bantustanization. It makes Palestinian life burdensome, even impossible, and forces Palestinians to leave their homes, while fostering the position of the unlawful Israeli settlements. Israel denies this effect by calling the “fence” a temporary security measure. But this claim veils the true situation. It is public notice that major parts of the Wall are built in a very solid way, concrete structures, ditches, and so on. In today’s newspaper you can read the latest statement of Prime Minister Sharon: “We will build the security fence and complete it.” That does not sound temporary. The Wall will incite Palestinians to move out of the encircled places, in particular in what is called the “Seam Area”, and Israelis to stay in or to come to the settlements fortified by the Wall. That is why the Wall profoundly affects the right of the Palestinian people to self-determination, which includes the right to remain in the place where the people has lived since many centuries, that is why it constitutes a change in status, a de facto annexation which is contrary to the prohibition of acquiring territory by force.\n\n One thing should be made crystal clear: Palestine is not a kind of no-man’s land subject to appropriation by Israel. It is a self-determination unit in the borders drawn by the armistice lines of 1949. This has been recognized by the Security Council and the General Assembly in binding determinations and by Israel itself. This is the lex lata, whatever the parties may freely agree upon in the future.\n\n But does the alleged security threat not justify these measures? Is the inherent right of self-defence not recognized by the Charter? Self-defence is an act necessary to protect a State against an armed attack. As such, it is by necessity a temporary measure. A lasting change in status cannot conceivably be necessary for such protection. This is why the prohibition of acquisition of territory through the use of force, confirmed by Security Council resolution 242 and formulated in the well-known Friendly Relations Declaration of 1970, does not provide for an exception in the case of self-defence. A de facto change of status does not provide any additional security. The Wall cannot be justified as self-defence.\n\nInternational humanitarian law\n\nIts application cannot be denied. This has again been made clear by all the States which have addressed the issue in their written statements, including France, Ireland and Switzerland, guardian of the Geneva Conventions, and it has been convincingly pleaded the course of the present oral hearings. The essential point is the duty of an occupying power not to destroy private property and to provide for a decent existence of the civilian population, an obligation which is violated in many respects.\n\nBut does the security threat not justify these measures? The right of a party to a conflict to take measures for the protection of its own population living on its territory is certainly recognized. But, as the ICRC has clearly put it in a recent declaration which deserves to be re-emphasized, although it has already been quoted to the Court:\n\n“[T]he West Bank Barrier, in as far as its route deviates from the ‘Green Line’ into occupied territory, is contrary to international humanitarian law. The problems affecting the Palestinian population in their daily lives clearly demonstrate that it runs counter to Israel’s obligation under international humanitarian law to ensure the humane treatment and well-being of the civilian population living under its occupation. The measures taken by the Israeli authorities linked to the construction of the Barrier in occupied territory go far beyond what is permissible for an occupying power under international humanitarian law.”\n\nHuman rights\n\nThe applicability of international human rights treaties as well as the corresponding rules of customary international law has once again been affirmed in the present proceedings. This was clearly stated by a number of States, including France, Ireland and Switzerland. The latter drew your attention to the fact that you held, in the Nuclear Weapons case, that a concurrent application of international human rights and international humanitarian law was indeed required. International human rights guarantees are violated in a number of respects which we have developed in our Written Statement. In addition to the rights related to the unbearable deterioration of the living conditions of the Palestinian population, one further aspect of these violations has to be stressed: freedom of religion of Christians and Muslims, as the Wall also bars access to the Holy Places of these religions.\n\nBut does the alleged security threat not justify these measures? The extent to which security considerations may serve as a reason for limiting human rights is determined by the limitation clauses associated with a number of guarantees. They are summarized under the heading of proportionality.\n\nThis means the measure must serve a legitimate purpose. The security of the population is such legitimate purpose, but the protection of the Israeli settlements is not. These settlements, as has been repeatedly explained before you, are themselves a violation of international law. A situation created by a violation of international law cannot serve as a legitimate purpose for limiting human rights: “Ex iniuria ius non oritur”.\n\nA second condition: the measure must be necessary for achieving its purpose. But, as even Israel admits in its Written Statement, the security situation has not changed since the construction of the Wall. The attacks complained of by Israel have not diminished. It was very convincingly pleaded yesterday: the security to be provided by the Wall is just an illusion. A measure which is incapable of achieving its objective is a useless, and therefore unjustifiable infringement on human rights. Therefore, it has to be stressed that the true purpose of the Wall is different (and not legitimate): it is a means to change the legal status quo of the occupied territory.\nFinally, the limitation of a human right must not be excessive in relation to the advantage it is designed to achieve. Making the life of an entire population unbearable is an infringement of human rights grossly disproportionate to the real scope of the threat perceived by Israel. Thus, the security argument fails in respect of any limitation of human rights which are imposed on the Palestinians by reason of the construction of the Wall.\n\nTo sum up, Mr. President, Members of the Court: the Wall does not stand between terrorists and potential victims. It stands between the farmer and his land, between the employee and the employer, between the merchant and the client, between the child and its school, between the patient and the doctor, between families who want to unite, between the faithful and his or her Holy Places. As a matter of international law, it does not belong there at all!"
    },
    {
        "voto": 1,
        "juez": "League of Arab States",
        "pregunta": "All States are under an obligation not to recognize the illegal situation resulting from the construction of the wall and not to render aid or assistance in maintaining the situation created by such construction; all States parties to the Fourth Geneva Convention relative to the Protection of Civilian Persons in Time of War of 12 August 1949 have in addition the obligation, while respecting the United Nations Charter and international law, to ensure compliance by Israel with international humanitarian law as embodied in that Convention",
        "texto": "The Court should clearly state the consequences which these violations of applicable international law entail for various actors.\n\nMr. President, Members of the Court, in the Namibia Opinion, you held and this was already quoted by the preceding speaker that “a binding determination made by a competent organ of the United Nations to the effect that a situation is illegal cannot remain without consequence”\n\nConsequences for Israel: under the law of State responsibility, there is, first, a duty to cease the unlawful act. The construction must be stopped immediately. Secondly, there is a duty of reparation in the form of restitution: the Wall must be demolished, land taken from Palestinian owners for the purpose of constructing the Wall must be given back, regulatory instruments related to the construction of the Wall are null and void and must be rescinded. Damages going beyond the loss of land, which has to be given back, must be compensated. In addition, appropriate assurances of non-repetition have to be given.\n\nConsequences for third States: the rules which have been violated constitute erga omnes obligations. Other States are thus entitled to take appropriate measures to ensure that the breach ceases and that reparation is provided. As to the Fourth Geneva Convention, it provides that all States parties are obliged to respect and ensure respect of its provisions. Thus, violations trigger the right and duty of all States parties to take measures to ensure compliance with this treaty. In addition, the ICRC has a responsibility in this respect, and it has fulfilled the duty in an exemplary fashion.\n\nFurthermore, these breaches constitute violations of peremptory norms of international law, of ius cogens. This entails additional duties to take measures to redress the situation.\n\nAnd one aspect must be emphasized which is of particular importance for any future settlement: no State may recognize the de facto situation unlawfully brought about by the construction of the Wall.\n\nFinally, consequences as to personal criminal liability: in various respects, the construction of the Wall constitutes a grave breach of the Fourth Geneva Convention. All States are, thus, obliged to prosecute offenders which happen to find themselves in their power, or to extradite them to a State willing to prosecute them.\n\nConsequences for the United Nations and the Specialized Agencies: The General Assembly is a guardian of the Palestinian right to self-determination. The Security Council has addressed the situation according to its primary responsibility for the maintenance and restoration of international peace and security. In the exercise of these responsibilities, both organs will have to pay due respect to the determination made by the Court. They are under a duty not only to continue, but also to reinforce their efforts to achieve a lasting and peaceful solution for the question of Palestine based on the rule of law. It is the duty of all Members of the United Nations system to assist, within their respective fields of competence, the work of these political organs. The League of Arab States respectfully asks the Court to clearly declare these consequences in its opinion. This would not only be for the benefit of the General Assembly which has requested this opinion, but for the benefit of the international community at large. By clearly stating the law as it is, the Court will contribute to a peace process based on the rule of law."
    },
    {
        "voto": 1,
        "juez": "Jordan",
        "pregunta": "Finds that it has jurisdiction to give the advisory opinion requested",
        "texto": "In  relation  to  substantive  issues  raised  by  that  question  the  various  Written  Statements reveal no significant disagreement.  Jordan feels no need to comment on these issues, and stands by what it said in its Written Statement58.  But the Court’s jurisdiction and its discretionary powers in relation  to  advisory  opinions  have  proved  more  contentious.    Jordan  has  set  out  in  its  Written Statement arguments to show that the Court has jurisdiction to give the requested advisory opinion, and  that  there  are  no  compelling  reasons  for  the  Court  to  decline  to  exercise  that  jurisdiction. While  maintaining  those  arguments,  I  should  just  like  to  add  some  comments  in  response  to arguments to the contrary which have been put forward. /n/n The  starting  point,  Mr. President,  has  to  be  that  (and  here  I  quote  from  the  relevant General  Assembly  resolution)59  “the  United  Nations  has  a  permanent  responsibility  towards  the question  of  Palestine  until  the  question  is  resolved  in  all  its  aspects  in  a  satisfactory  manner  in accordance  with international legitimacy”.  The General Assembly, as one of the principal organs of the United Nations, shares (as does the Court, also one of the principal organs) that “permanent responsibility” for the question of Palestine.  In exercising that responsibility the Assembly is faced with a fact  the construction of the Wall.  It has to know what this implies for its future actions. It has therefore asked the Court, as the Organization’s principal judicial organ, to give an advisory opinion on the legal consequences of that fact.  Nothing could be more natural. /n/nYet  it  has  been  urged  that  the  Court,  notwithstanding  its  responsibilities  as  the  United Nations principal judicial organ, should leave the General Assembly without the advice it needs.  In Jordan’s  submission,  Mr. President  and  Members  of  the  Court,  for  the  reasons  set  out  in  Jordan’s Written  Statement60  that  cannot  be  the  right  course  for  this  Court  to  take.    The  Court  has  never before exercised its discretion so as to decline to give an advisory opinion properly requested by an authorized organ;  and there is no cause for it to do so now. /n/nThe Court’s view of the matter has been remarkably consistent since its pronouncements in  that  case.    In  the  Namibia  case  the  Court  referred  to  a  request  being  “put  forward  by  a  United Nations organ with reference to its own decisions and it seeks legal advice from the Court on the consequences  and  implications  of  these  decisions”64;    in  the  Western  Sahara  case  the  Court  said that “an opinion given by the Court in the present proceedings will furnish the General Assembly with elements of a legal character relevant to its further treatment of the decolonization of Western Sahara”65.  Mutatis mutandis, Mr. President, that is exactly the situation in the present case. /n/nMr. President,  seeking  an  advisory  opinion  in  no  way  interferes  with  the  Council’s primary  responsibilities    especially  when  on  the  matter  in  hand  the  Council  was  unable  to  act because of the negative vote of a Permanent Member.  But in any event, the argument cannot stand. It  is  startling  in  its  implications,  and  without  foundation  in  the  Charter.    If  accepted  it  would  cast serious doubt on the legality of much that the General Assembly has done over the past 37 years in relation to the Occupied Territories.  The Council and the Assembly have overlapping competences,  within  the  limits  of  Article 12  of  the  Charter.    But  that  Article  only  precludes  the Assembly from making a recommendation with regard to a dispute or situation while the Council is exercising its functions in respect of a dispute or situation:  and in this case the Assembly made no recommendation, only a request to another organ of the United Nations for an advisory opinion in the exercise of its specific powers under Article 96 of the Charter. /n/nIn  the  present  case  the  non-consenting  State    Israel    is  a  Member  of  the  United Nations,  and  a  party  to  the  Statute  of  the  Court,  and  has  thus  agreed  to  the  Court’s  advisory procedures.    Moreover,  Israel  has  actively  participated  in  these  proceedings,  both  as  regards  the composition of the Court and by submitting a written statement. /n/nIt  is  suggested,  Mr. President,  that  since  the  General  Assembly  has  already  determined that  the  building  of  the  Wall  is  illegal,  there  is  consequently  no  value  in  the  Court  giving  its advisory opinion on the same matter.  But, Mr. President, a determination by the General Assembly that  a  particular  state  of  affairs  is  illegal  is,  while  indicative  of  an  opinio  juris  on  the  part  of  the international  community80,  it  is  nevertheless  a  determination  by  a  political  organ  of  the  United Nations:  the confirmation, if so it be, of that determination by the United Nations principal judicial organ  does  add  something  of  legal  value  to  what  the  General  Assembly  has  already  said.    The argument  in  any  event  misrepresents  the  question  on  which  the  General  Assembly  has  asked  the Court for its opinion.  The General Assembly’s question is not whether the Wall is illegal, but asks about  the  legal  consequences  of  constructing  the  Wall.    Those  consequences  go  much  wider  than any finding of illegality.  It is the wider consequences, not yet addressed by the General Assembly, upon which the General Assembly seeks the Court’s guidance.  Finally  and this is perhaps the overriding consideration  the General Assembly has asked for an advisory opinion on a matter on which it believes it will be assisted by having the Court’s views before it:  the Court is, indeed, well placed to make a constructive contribution to a difficult situation at the heart of which lie issues of international law.  As the  Court has already indicated, it is for the General Assembly, and not for the  Court,  to  determine  whether  the  General  Assembly  needs  the  advisory  opinion  which  it  has sought and what use to make of it81. /n/nThe  next  line  of  argument  to  be  considered  is  that  the  giving  of  an  advisory  opinion would be unhelpful to the broader peace process within the diplomatic framework of the Road Map because, it is said, it would make the overall negotiating process more difficult. /n/nBut that is a matter about which one can only speculate.  It must not be forgotten that the Court is called upon in these proceedings to consider only a very specific factual situation, on the legal  consequences  of  which  the  Assembly  stands  in  need  of  the  Court’s  opinion.    Speculation about the political consequences which might follow for the peace process is a political matter into which the Court should not allow itself to be drawn. /n/nMoreover,  the  Court  has  already  rejected  the  argument  that  because  the  giving  of  an advisory  opinion  might  have  an  impact  on  some  current  negotiating  process  therefore  the  Court ought to refrain from giving an opinion properly requested of it.  In the Nuclear Weapons case that argument was advanced, and the Court’s response was clear:  “the Court cannot regard this factor as a compelling reason to decline to exercise its jurisdiction”89."
    },
    {
        "voto": 1,
        "juez": "Jordan",
        "pregunta": "Decides to comply with the request for an advisory opinion",
        "texto": "A  second  major  consideration  referred  to  in  a  number  of  written  statements  is  the  impact which the Court’s advisory opinion might have on ongoing international negotiations.  This is said to  be  a  reason  for  the  Court  to  abstain  from  giving  an  opinion.    While  this  argument  will  be addressed in greater detail by counsel for Jordan, there is, Mr. President and Members of the Court, a general point I should like to make. /n/nIn  its  Written  Statement  Israel  has  emphasized  how  many  attempts  it  has  made  to  reach  a peaceful  settlement  of  the  Palestinian  question  since  the  Israeli-Palestinian  talks  in  Oslo  in  1993. Mr. President,  Israel  has  no  monopoly  of  such  attempts.    We  all  want  a  peaceful  settlement.    My country, together with the Palestinians, has been every bit as assiduous in its peace efforts. /n/nThe  Assembly  knew  what  it  was  doing  when  it  decided  to  seek  the  Court’s  opinion  on  a specific legal question, and it took that course for reasons of which it was the best  and only judge. /n/nMr.  President,  the  Assembly  needs the  opinion it  has  requested.    In  the  language  of  the Court  in  the  Reservations  case  “the  object  of  this  request  for  an  Opinion  is  to  guide  the  United Nations in respect of its own action”63.  It is precisely the Assembly’s own future decisions which require  that  it  should  know  the  legal  consequences  of  the  building  of  the  Wall:    only  then  can  it properly decide what action to take. /n/nThe argument has also been made that since under the Charter the Security Council has the  primary  responsibility  for  the  maintenance  of  international  peace  and  security,  therefore  the General Assembly may not take action which interferes with the Council’s exercise of its primary responsibilities  upon which, in the present context, it has been actively engaged for many years and is indeed currently engaged. /n/nThe  Assembly’s  role  in  relation  to  the  maintenance  of  peace  and  security  may  be secondary,  but  it  is  not  non-existent.    It  retains  its  normal  competences  under  the  Charter,  and  its request for an advisory opinion falls fairly and squarely within them. /n/nMoreover, Mr. President, the specific question put to the Court does not directly address a legal question actually pending between two States.  The Court’s advisory opinion will not settle any  existing  bilateral  dispute,  since  it  will  not  deal  with  such  a  dispute:    the  Court’s  opinion  will deal  only  with  a  particular  request  relating  to  certain  legal  consequences  flowing  from  a  given situation;  it will only be “advisory”, and it will only be addressed to the General Assembly. /n/nThe fact that the question put to the Court by the Assembly may have political aspects or motivation, or that the Court’s opinion may when given to the Assembly have implications in the wider  political  arena,  is,  as  the  Court  has  often  indicated,  a  separate  matter  which  does  not  affect the Court’s ability to give its advisory opinion on what is clearly a legal question75.  It is significant that,  on  every  occasion  when  such  an  argument  has  been  raised,  the  Court  has  rejected  it.    In  the Nicaragua case, in 1986, the Court noted that it “has never shied away from a case brought before it  merely  because  it  had  political  implications . . .”76.    It  has  not  done  so  subsequently,  Mr. President, and Jordan submits that it should not start doing so now. /n/nNor can the Court be regarded as being in some way politicized just because it fulfils its judicial function by giving an advisory opinion on a matter with political implications:  the Court, Mr. President  and  Members  of  the  Court,  is  a  more  robust  institution  than  that  suggestion  would imply.  The issue is not the politicization of the Court, but rather emphasizing that the questions for decision are purely legal. /n/nIt  is  also  suggested  that  for  the  Court  to  respond  to  the  question  put  by  the  General Assembly would prejudice progress in the current negotiations for a Middle East peace settlement, which  are  taking  place  on  the  basis  of  the  “Road  Map”,  including  certain  issues  known  as “permanent status” issues. /n/nIt may be that much of the concern felt about the possible impact of the Court’s opinion is based on a fear that the Court might range far and wide over a myriad legal issues which might be  thought  to  be  raised  by  the  question  put  to  the  Court.    But  this  is  not  so,  Mr. President.    The Court, in answering the question put to it, will no doubt keep strictly to the issues raised directly by that question.  And being an advisory opinion, the Court has the possibility of saying only as much about any particular aspect of the question put to it as it considers appropriate. /n/nThe further argument has been advanced that the question put to the Court is so complex and uncertain that it is not a legal question at all, and raises such complex issues of fact and law as to be unsuitable for determination by an advisory opinion. /n/nThe focus for the Court’s opinion is also limited.  It is also clear.  The Court is asked to give  its  opinion  on  “the  legal  consequences”  of  the  construction  of  that  Wall.    There  is  nothing uncertain  about  a  question  so  phrased.    There  can  be  nothing  inappropriate  in  asking  a  judicial organ to give an opinion on the legal consequences flowing from a specific situation about which the facts are well known:  indeed questions about the legal consequences of an act are quintessentially  legal  questions  since,  in  the  words  of  the  Court  in  the  Western  Sahara  case,  they are  “framed  in  terms  of  law  and  raise  problems  of  international  law . . .  [and]  are  by  their  very nature  susceptible  of  a  reply  based  on  law;    indeed,  they  are  scarcely  susceptible  of  a  reply otherwise than on the basis of law”91."
    },
    {
        "voto": 1,
        "juez": "Jordan",
        "pregunta":"The construction of the wall being built by Israel, the occupying Power, in the Occupied Palestinian Territory, including in and around East Jerusalem, and its associated régime, are contrary to international law",
        "texto": "Two  things  about  it  are  of  crucial  importance.    First,  much  of  the  Wall  now  being  built  by Israel  is  in  territory  which  does  not  belong  to  Israel,  but  which  is,  rather,  occupied  territory   territory which, as consistently acknowledged by the international community for over 35 years, is subject to a special régime in international law. /n/nIt  is  the  fact  that  the  Wall  is  being  built  on  Occupied  Territory  which  is  at  the  heart  of  the present  case.    If  Israel  has  a  security  problem,  then  in  principle  Israel  can  protect  itself  by  taking suitable measures within its own territory.  If the Wall had been constructed wholly within Israel’s sovereign territory, these proceedings would not have come about. /n/nThe second crucial factor about the Wall is that it is a wall with the characteristics described in  the  Secretary-General’s  report.    On  the  screen  now  (and  at  tab 1  in  the  judges’  folders)  is  a succession of photographs taken of the Wall.  The Court can see that in physical terms the Wall is not  just  a  simple  fence.    It  dominates  its  surroundings,  separates  homes  from  their  lands,  people from  their  places  of  worship  as  well  as  from  essential  services  and  sources  of  water,  it  divides communities, and cuts a swathe through towns and villages. /n/nThose  physical  characteristics  are  supplemented  by  an  extensive  system  of  administrative controls.  The Wall cannot be looked at on its own, but only in conjunction with the controls which are an integral part of the whole system. /n/nIt  is  when  one  looks  at  the  overall  picture  presented  by  the  Wall  and  its  accompanying controls that one fears for the future of the Palestinian inhabitants of the Occupied Territories.  It is consistent  with  what  is  known  already  of  the  Wall  to  see  in  its  construction  steps  aimed  at  the further assimilation of the Occupied Territories into Israel. /n/nAnd more than that, Mr. President, it obstructs the “permanent, free and unhindered access to  the  Holy  Places  by  all  the  people  of  all  religions  and  nationalities”.    That  has  been  a  major element  in  United  Nations  policy  on  Palestine  since  resolutions  191 (III)  and  194 (III)  in  1948. And it was reiterated by the General Assembly in resolution 57/111 of 2002. /n/nThe  map,  Mr. President,  also  shows  something  else.    It  shows  that,  despite  arguments  to the  contrary,  this  Wall  is  not  primarily  about  the  defence  of  Israel’s  territory.    One  glance  at  the route taken by the Wall gives the lie to that argument.  If the Wall is no more than a security barrier to  protect  the  territory  of  Israel,  why  does  it  follow  the  path  it  does?    How,  for  example,  does  a Wall encircling Qalqilya help to defend nearby Israeli territory?  What does the long finger of Wall extending  far  into  the  West  Bank  in  the  region  of  Salfit  have  to  do  with  the  defence  of  Israel’s territory?  How can the projected eastern stretch of the Wall, from Jenin in the north to Hebron in the  south,  be  justified  as  a  security  barrier  for  the  protection  of  Israel’s  territory,  when  there  is already the whole stretch of the Wall over to the west to serve for that alleged purpose?  If the Wall defends anything, it is  as we shall see in a moment  the position of Israeli settlements in the Occupied  Territories:    but  no  exceptional  right  of  self-defence  can  be  invoked,  Mr. President,  to defend  that  which  is  itself  unlawful.    Had  Israel  built  a  wall  wholly  within  its  own  territory,  we would  not  all  be  here  today.    And  I  would  just  observe  that  the  Court  has  been  given  no  cogent reasons why it was necessary to build this Wall in Occupied Territory, and why a wall built within Israel’s own territory would not have met the security concerns which are alleged to have provoked it. /n/nNow let me show one more sketch-map.  Still on the screen is the complete route of the Wall  constructed, planned and projected.  Now on the screen (and at tab 7 in the folders) is that same  map,  but  superimposed  on  it  are  the  locations  of  Israeli  settlements  in  the  Occupied Territories.    Although  settlements  are  spread  throughout  the  Occupied  Territories,  80 per cent  of the  settler  population  is  concentrated  in  the  western  areas,  now  being  pointed  out.    It  is  readily apparent  that  the  Wall  brings  the  main  groups  of  the  settlements  into  effective  contiguity  with Israel’s own territory;  it strengthens, develops and consolidates Israel’s settlements. /n/nThose  settlements  have  long  been  regarded  by  the  international  community  as  illegal56. And ever since the Wall began to be constructed, the international community has also regarded the Wall  as  illegal57.    Mr. President  and  Members  of  the  Court,  that  is  the  Wall  about  the  legal consequences of which the General Assembly has requested your opinion."
    },
    {
        "voto": 1,
        "juez": "Indonesia",
        "pregunta": "Israel is under an obligation to make reparation for al1 damage caused by the construction of the wall in the Occupied Palestinian Territory,including in and around East Jerusalem",
        "texto": "Honourable  judges,  as  widely  reported,  the  construction  of  the  Wall  has  destroyed schools,  commercial  buildings,  homes,  water  networks  and  has  made  difficulties  for  teachers reaching their classes when travelling.  The shops and enterprises have been closed as a consequence  of  the  Wall.    The  restriction  of  movement  also  affects  access  to  sacred  places  and mosques.    Regarding  the  right  to  food  and  water,  the  Israeli  authority  has  taken  food  away  from farmers and the Wall has affected communities’ access to water.  Israel, as Occupying Power, does not fulfil its obligation to ensure the Palestinian right to health.  As reported by the Bertini Report there  are  “access  restrictions . . .  [which]  prevent  Palestinians  in  need  of  medical  treatment  from reaching health services” /n/nIsrael  is  under  a  legal  obligation  to  restore  land  and  private  properties  forcibly  seized  for  the construction of the Wall, to pay full compensation, to annul all measures enacted regarding the Wall,  to  cease  restriction  on  freedom  of  movement  in  the  Occupied  Palestinian  Territory, including East Jerusalem. /n/nLast  but  not  least,  Israel  is  under  an  obligation  to  co-operate  with  international  humanitarian organizations,  including  the  International  Committee  of  the  Red  Cross  and  the  Human  Rights Committee to respect the dignity of the Palestinian people."
    },
    {
        "voto": 1,
        "juez": "Indonesia",
        "pregunta": "Decides to comply with the request for an advisory opinion",
        "texto": "With  regard  to  Article 12  of  the  Charter,  let  me  refer  to  the  opinion  made  by  the honourable Judge Bruno Simma in his publication The Charter of the United Nations:  A Commentary  that  this  Article  has  been  gradually  eroded.    It  is  not  uncommon  that  the  General Assembly  has  made  recommendations  even  when  the  Security  Council  was  dealing  actively  with an  issue.    If  the  Security  Council  was  not  actually  exercising  its  function  at  that  moment,  or  if  a resolution  was  blocked  by  a  veto,  the  General  Assembly  has  assumed  that  it  is  free  to  make recommendations,  provided  that  these  did  not  directly  contradict  a  Security  Council  resolution41. /n/nThis  view  is  traditionally  legitimized  by  the  Uniting  for  Peace  Resolution  Mechanism42  which acknowledges  that  the  failure  of  the  Security  Council  to  discharge  its  responsibilities  does  not deprive  the  General  Assembly  of  its  rights  or  relieve  it  of  its  responsibilities  under  the  Charter. Having  said  that,  Indonesia  is  of  the  view  that  the  advisory  opinion  request  falls,  without  any doubt, within the scope of “functions” and “powers” of the General Assembly.  The argument that the advisory opinion request was ultra vires the competence of the General Assembly is therefore unfounded. /n/nMr. President,  distinguished  Members  of  the  Court,  a  State  or  group  of  States  might oppose  the  rendering  of  an  opinion  by  the  Court  on  the  ground  that  the  Court’s  opinion  on  this question will jeopardize the negotiating process.  On the contrary, the impartial legal views of the Court  will  give  a  solid  international  legal  ground  to  speed  up  the  negotiating  process.    The negotiating process cannot be a “compelling reason” for the Court not to give its opinion.  There is no precedent that the impartial legal opinion of the World Court would hamper the peace process or create additional barriers for the negotiating process or  make the  “two-State” solution impossible. Indonesia  shares  the  view  that  the  establishment  of  a  Palestinian  State,  living  side  by  side  with Israel must be realized through political dialogue.  It consistently maintains that the interest of the very  fundamental  principle  of  international  law  shall  not  be  compromised.    As  mentioned  by  the distinguished Palestinian representative yesterday, the implementation of the peace process should not  be  at  the  expense  of  the  legal  rights  of  the  Palestinian  people.    In  this  regard,  the  Indonesian Government believes that the advisory opinion of the Court could contribute positively to the peace process. /n/nThe  positive  contribution  of  the  Court  to  the  peace  process  has  been  expressed  by  a Member  of  the  Court,  the  former  Judge  and  President,  Mohamed  Bedjaoui,  before  the  Sixth Committee  on  16 October  1995.    In  this  case,  Indonesia  also  endorses  the  preventive  nature  of advisory opinions.  Since an advisory opinion could provide an authoritative and important guide, advisory  procedure  appears  to  be  an  instrument  of  “preventive  diplomacy”,  as  envisaged  in “Agenda  for  Peace”,  which  is  a  particularly  suitable  means  for  the  Court  to  defuse  tension  and ward  off  conflicts  by  the  determination  of  law.    In  this  connection,  I  would  like  to  recall  the positive  contribution  of  the  Court’s  Opinion  on  Namibia  to  the  establishment  of  the  rule  of international law in south-western Africa.  Within this context, Indonesia expects that an advisory opinion on this particular issue would be a legal building block for the peace process in the Middle East.  The impartial legal opinion of the Court on this question would provide a solid international legal ground ensuring that the negotiation process be fairly conducted in good faith."
    },
    {
        "voto": 1,
        "juez": "Indonesia",
        "pregunta":"The construction of the wall being built by Israel, the occupying Power, in the Occupied Palestinian Territory, including in and around East Jerusalem, and its associated régime, are contrary to international law",
        "texto": "Mr. President,  honourable  judges,  on  the  issue  of  legality,  Indonesia  strongly  believes that there is no legal justification for Israel to construct the Wall44.  The Wall is illegal because it is meant  to  ensure  control  of  the  Palestinian  Territories  through  various  measures.    By  building  the Wall,  the  Israeli  Government  has  ordered  vast  expropriations  of  land  and  has  destroyed  homes, shops, schools, water networks and agricultural land.  On the applicability of international humanitarian  law  in  the  Occupied  Palestinian  Territory,  the  construction  of  the  Wall  and  related access  arrangements  fail  to  meet  the  requirements  of  international  human  rights  and  humanitarian law. /n/nThe Wall violates Article 2 of the Universal Declaration of Human Rights.  Article 2 of the  Universal  Declaration  of  Human  Rights  also  makes  it  clear  that  “no  distinction  shall  be  made on the basis of the political, jurisdictional or international status of the country or territory to which a person belongs, whether it be independent, trust, non-self-governing or under any other limitation of sovereignty”.  This approach is also confirmed by United Nations General Assembly resolution 48/121  (1993)  endorsing  the  “Vienna  Declaration  and  Action  Plan  from  the  World Conference  on  Human  Rights”.    It  explicitly  ensures  that  effective  international  measures,  to guarantee and monitor the implementation of a human rights standard, should be taken in respect of people under foreign occupation. /n/nAlthough Article 12 of the ICCPR stated that freedom of movement can be restricted for security reasons  but the restrictions should be limited to what is necessary and proportionate as mentioned  in  General  Comments  No. 27  adopted  by  the  Human  Rights  Committee51.    The  Wall creates  walled-in  enclaves  confining  tens  of  thousands  of  people.    It  sharply  limits  freedom  of movement  except  to  a  handful  of  permit-holders,  and  endangers  Palestinians’  access  to  basic services  such  as  education  and  medical  care  and  other  access  to  work  and  water.    The  Israeli Government cannot use security concerns for Israelis living in illegal settlements to justify further illegal  changes  to  the  Occupied  Territory  by  constructing  illegal  barriers.    To  be  permissible, restrictions must be provided by law, must be necessary in a democratic society for the protection of  these  purposes  and  must  be  consistent  with  all  other  rights  recognized  in  the  Convention52. Restrictive measures must conform to the principle of proportionality;  they must be appropriate to achieve their protective function;  they must be the least intrusive instrument amongst those which might  achieve  the  desired  result;    and  they  must  be  proportionate  to  the  interest  to  be  protected53. The construction of a wall does not fulfil the obligation under Article 12 of the ICCPR. /n/nThe Wall also infringes on other Palestinian rights such as right to property as enshrined in  Article 17  of  the  Universal  Declaration  on  Human  Rights,  Article 1  of  the  ICESCR,  and Article 1 of the ICCPR;  the right to health as stated in Article 12 of the ICESCR and Article 56 of the  Fourth  Geneva  Convention;    the  right  to  education  as  stated  in  Article 3  of  the  ICESCR, Article 50  of  the  Fourth  Geneva  Convention;    the  right  to  work  as  enshrined  in  Article 23  of  the Universal Declaration of Human Rights and Article 6 of the ICESCR;  the right to food and water as  stated  in  Article 11  of  the  ICESCR;    and  lastly,  the  right  to  freedom  of  religion  as  stated  in Article 18 of the ICCPR, and Article 58 of the Fourth Geneva Convention. /n/nThe  construction  of  the  Wall  by  Israel  in  the  Occupied  Palestinian  Territory,  including  East Jerusalem,  departing  from  the  Armistice  Line  of  1949,  is  illegal  under  relevant  norms  and principles of international law and must be ceased and reversed."
    },
    {
        "voto": 1,
        "juez": "Indonesia",
        "pregunta": "Israel is under an obligation to terminate its breaches of international law; it is under an obligation to cease forthwith the works of construction of the wall being built in the Occupied Palestinian Territory, including in and around East Jerusalem, to dismantle forthwith the structure therein situated, and to repeal or render ineffective forthwith all legislative and regulatory acts relating thereto, in accordance with paragraph 151 of this Opinion",
        "texto": "Israel  is  a  party  to  the  Fourth  Geneva  Convention  of  1949  relative  to  the  Protection  of Civilian  Persons  in  Time  of  War  and  two  international  covenants  which  are  the  International Covenant  on  Civil  and  Political  Rights  (ICCPR),  and  the  International  Covenant  on  Social, Economical  and  Cultural Rights  (ICSECR).    However,  time  and  again,  Israel  refuses  to  apply  the Fourth  Geneva  Convention  to  the  Occupied  Palestinian  Territory  even  though  the  international community called upon the Israeli Government to accept de jure application of the Fourth Geneva Convention  in  Palestine45.    Also  according  to  Article 2  of  the  ICCPR  Israel,  as  a  party,  must undertake  “to  respect  and  to  ensure  to  all  individuals  within  its  territory  and  subject  to  its jurisdiction  the  rights  recognized  in  the  present  Covenant”.    Since  Palestinian  Territories  are  not part  of  Israel,  it  should  strictly  follow  these  principles,  not  only  towards  its  nationals  but  also  in protecting  the  rights  of  Palestinians.    Israel  should  accept  the  applicability of  international  human rights  and  humanitarian  law.    Israel  should  also  incur  international  responsibilities  arising  from  a continuing violation of international obligations46. /n/nHonourable judges,  Article 47 of the Fourth Geneva Convention ensures that the occupied population is entitled to certain rights that “protected persons . . . shall not be deprived, in any case or in any manner whatsoever, of  the  benefits  the  present  convention  by  any  change  introduced,  as  the  result  of  the occupation  of  a  territory,  into  the  institutions  or government  of  the  said  territory,  nor by any agreement concluded between the authorities of the occupied territories and the Occupying Power”. International humanitarian law guarantees in Article 27 that “Protected persons are entitled, in all circumstances, to respect for their persons, their  honor,  their  family  rights,  their  religious  convictions  and  practices,  and  their manners  and  customs.    They  shall  at  all  times  be  humanely  treated,  and  shall  be protected  especially  against  all  acts  of  violence  or  threats  thereof  and  against  insults and public curiosity.”47 The  Wall  is  a  combined  product  of  the  settlements  and  closure  policies.    The  Wall  adds  a permanent  barrier  to  the  barriers  already  put  in  place  through  checkpoints.    In  addition,  it  is  a permanent expropriation of private property. /n/nThe  “Bertini  Report”48  has  elaborated  on  the  humanitarian  situation  in  Palestine  and shown how closures, sieges, curfews and checkpoints are  strategies that have  affected the right to the freedom of movement and property.  The report states: “Palestinians  are  subject  to  a  variety  of  closures,  curfews,  roadblocks  and restrictions  that  have  caused  a  near-collapse  of  the  Palestine  economy . . .  and  rising dependency  on  humanitarian  assistance.    The  restrictions  affect  almost  all  activities, rendering  most  Palestinians  unable  to  carry  out  any  semblance  of  a  normal  life  and subject to daily hardships, deprivations and affronts to human dignity.”49 The  report  also  states  “There  is  a  consensus  among  all  parties,  and  this  report  confirms,  that  the current regime of closures and curfews is having a devastating impact on the Palestinian population, both on their economy and the humanitarian situation.” /n/nThe  International  Committee  of  the  Red  Cross  in  its  press  release  of  18 February 2004, stated  inter  alia  its  concern  about  the  humanitarian  impact  of  the  West  Bank  barrier  on  many Palestinians living in the Occupied Territory.  The ICRC’s opinion is that the West Bank barrier, in as  far  as  its  route  deviated  from  the  “Green  Line”  into  Occupied  Territory,  is  contrary  to international  humanitarian  law.    The  problems  affecting  the  Palestinian  population  in  their  daily lives clearly demonstrate that it runs counter to Israel’s obligation under international humanitarian law  to  ensure  the  humane  treatment  and  well-being  of  the  civilian  population  living  under  its occupation.  The measures taken by the Israeli authorities linked to the construction of the barrier in  the  Occupied  Territory  go  far  beyond  what  is  permissible  for  an  occupying  power  under international  humanitarian  law.    These  findings  are  based  on  the  ICRC’s  monitoring  of  the  living conditions of the Palestinian population and on its analysis of the applicable international humanitarian  law  provisions.    The  Israeli  authorities  have  been  regularly  informed  about  the ICRC’s  humanitarian  and  legal  concerns.    And  the  ICRC  therefore  calls  on  Israel  not  to  plan, construct, or maintain this barrier within the Occupied Territory. /n/nIsrael is under an obligation to fully and effectively respect the Fourth Geneva Convention, as well as Additional Protocol I to the Geneva Conventions to the Occupied Palestinian Territory, including East Jerusalem. /n/nAll  norms  and  principles  as  provided  by  international  human  rights  conventions  shall  be respected in the Occupied Palestinian Territory, including East Jerusalem, and therefore Israel is  under  obligations  to  stop  its  grave  breaches  of  international  human  rights  law,  and  to  bring all the perpetrators of human rights atrocities to justice."
    },
    {
        "voto": 1,
        "juez": "Indonesia",
        "pregunta": "Israel is under an obligation to make reparation for al1 damage caused by the construction of the wall in the Occupied Palestinian Territory,including in and around East Jerusalem",
        "texto": "Honourable  judges,  as  widely  reported,  the  construction  of  the  Wall  has  destroyed schools,  commercial  buildings,  homes,  water  networks  and  has  made  difficulties  for  teachers reaching their classes when travelling.  The shops and enterprises have been closed as a consequence  of  the  Wall.    The  restriction  of  movement  also  affects  access  to  sacred  places  and mosques.    Regarding  the  right  to  food  and  water,  the  Israeli  authority  has  taken  food  away  from farmers and the Wall has affected communities’ access to water.  Israel, as Occupying Power, does not fulfil its obligation to ensure the Palestinian right to health.  As reported by the Bertini Report there  are  “access  restrictions . . .  [which]  prevent  Palestinians  in  need  of  medical  treatment  from reaching health services” /n/nIsrael  is  under  a  legal  obligation  to  restore  land  and  private  properties  forcibly  seized  for  the construction of the Wall, to pay full compensation, to annul all measures enacted regarding the Wall,  to  cease  restriction  on  freedom  of  movement  in  the  Occupied  Palestinian  Territory, including East Jerusalem. /n/nLast  but  not  least,  Israel  is  under  an  obligation  to  co-operate  with  international  humanitarian organizations,  including  the  International  Committee  of  the  Red  Cross  and  the  Human  Rights Committee to respect the dignity of the Palestinian people."
    },
    {
        "voto": 1,
        "juez": "Republic of Cuba",
        "pregunta": "Finds that it has jurisdiction to give the advisory opinion requested",
        "texto": "Honourable  judges,  regarding  the  jurisdiction  of  the  International  Court  of  Justice  for  the emission  of  a  consultative  opinion  on  the  legal  question  presented  by  the  General  Assembly,  the Republic  of  Cuba  considers  that  this  august  body  is  fully  competent  to  emit  the  consultative opinion requested. /n/nArticle 96  of  the  United  Nations  Charter  confers  the  General  Assembly  and  the  Security Council,  the  unconditional    and  I  must  underline  unconditional    right  to  request  consultative opinions to the Court on any legal question. /n/nArticle 65,  paragraph 1,  of  the  Statute  of  the  International  Court  of  Justice  establishes  that the Court will emit consultative opinions regarding any legal question at the request by any organ authorized to do so by the Charter./n/nThe  General  Assembly  also  clearly  established  the  applicable  legal  framework  for  the interpretation  and  application  of  the  pertinent  legal  norms  in  the  emission  of  the  consultative opinion on the legal question. /n/nIn spite of the so-called “considerations”, or “political elements”, involved in the negotiated solution  of  the  Israeli-Palestinian  conflict,  and  the  request  by  several  States  that  the  Court  make discretional  use  of  Article 65,  paragraph 1,  of  its  Statute,  the  Republic  of  Cuba  considers  that  the Court  should  not  abstain  from  emitting  a  consultative  opinion  on  this  important  question.    In Cuba’s  view,  any  debate  on  the  optional  nature  of  Article 65,  paragraph 1,  of  the  Statute  is eminently theoretical in nature and can only be carried out in the light of the other Articles of said Statute and of the United Nations Charter. /n/nLikewise,  although  on  occasions  States  have  objected  to  the  jurisdiction  of  the  Court  based on the political nature of questions that have been placed before it, this has not prevented the Court from emitting consultative opinions on said questions, circumscribing itself to the legal consequences deriving from them, and, thus, adhering to its competence according to the internationally accepted instruments that govern its functioning. /n/nIt  is  Cuba’s  contention  that  the  emission  of  a  consultative  opinion  regarding  the  question presented  by  the  General  Assembly  is  based  not  only  on  Article 96  of  the  Charter,  but  also  on Article 14, which establishes that the General Assembly is competent to recommend measures for the  peaceful  solution  of  any  situation,  irrespective  of  origin,  even  a  situation  arising  from  a violation of the United Nations Charter itself. /n/nMention has been made in the written statements of the limitations imposed by Article 12 of the  Charter  to  the  fulfilment  by  the  General  Assembly  of  the  mandate  conferred  upon  it  by Article 14.  In Cuba’s view those limitations are not applicable in the cases involving requests for consultative  opinions  to  the  Court.    Article 96  of  the  Charter,  giving  this  faculty  to  the  General Assembly, is not qualified in any manner and, therefore, places no limitations whatsoever. /n/nFurthermore, even if Article 12 were to be theoretically applicable, limitations imposed by it would not be an obstacle for the request of a consultative opinion by the General Assembly on this issue.    The  fact  is  that  the  issue  at  hand  was  dealt  with  by  the  General  Assembly by virtue of  the United for Peace resolution resulting from a veto imposed by a Permanent Member of the Security Council  to  an  enabling  resolution.    Hence,  this  should  be  interpreted  in  the  sense  that,  for  all practical  purposes,  the  Security  Council  is  not  considering  the  draft  resolution  presented  to  it  and the item involved, even if said issue were still on the Council’s agenda. /n/nThe  Government  of  the  Republic  of  Cuba  considers  without  any  shadow  of  doubt whatsoever,  that  the  International  Court  of  Justice  is  competent  to  emit  a  consultative  opinion  on the legal question presented to it by the United Nations General  Assembly.  Articles 14 and 96 of the  United  Nations  Charter  and  Article 65,  paragraph 1,  of  the  Statute  of  the  Court  uphold  said competence.    Is  also  our  firm  view  that  the  emission  of  a  consultative  opinion  on  this  important issue is pertinent and timely. /n/nThe Government of the Republic of Cuba also considers that the emission of a consultative opinion on this important issue will not constitute an obstacle to the peace process but, on the contrary, would be an important tool in the hands of the United Nations General Assembly and  the  United  Nations  as  a  whole  for  the  fulfilment  of  its  functions  with  regard  to  this  conflict. Likewise,  it  can  contribute  to  clarify  to  the  international  community  the  terrible  socio-economic consequences for the Palestinian people derived from the construction of the Wall, particularly for the exercise of its inalienable right to self-determination."
    },
    {
        "voto": 1,
        "juez": "Republic of Cuba",
        "pregunta": "Decides to comply with the request for an advisory opinion",
        "texto": "In addition, Cuba considers that the emission of a consultative opinion on the legal question of reference is of significance in the present international context and for the negotiated solution of the Israeli-Palestinian conflict itself and for the most recent efforts carried out in that direction. /n/nA consultative issue should constitute an essential tool in the hands of the United Nations in the  fulfilment  of  its  functions,  particularly  for  the  General  Assembly  of  the  United  Nations, according to Article 14 of the Charter.  Likewise, it has also the role of contributing to clarify to the international community as a whole the terrible socio-humanitarian consequences for the Palestinian people derived from the construction of the Wall and, particularly, for the exercise of its right  to  self-determination  and  for  the  establishment  of  a  sovereign  and  independent  Palestinian State. /n/nThe emission of a consultative opinion on this question should also be a dissuasive element for  the  Occupying  Power  geared  at  having  it  stop  and  revert  the  construction  of  the  Wall  in  the Occupied Palestinian Territory and it should, at least, be a strong call on the Occupying Power to comply with the wishes of the United Nations General Assembly, as expressed in resolution ES-10/13 of 21 October 2003. /n/nThe  Government  of  the  Republic  of  Cuba  respectfully  hopes  that  the  International  Court of Justice, while emitting the consultative opinion requested by the General Assembly, recognizes that  the  construction  of  the  Wall  by  Israel  is  illegal  and  in  violation  of  norms  and  principles  of international law, including the Fourth Geneva Convention of 1949 and the relevant resolutions of the Security Council and the General Assembly. /n/nLastly,  Cuba  hopes  that  the  International  Court  of  Justice  acts  in  a  decisive  and unanimous manner in favour of peace and justice.  The Wall of separation continues to accentuate the illegal Israeli occupation, and perpetuates the system of “apartheid” established by Israel in the Occupied  Palestinian  Territory.    Furthermore,  with  these  actions,  Israel  moves  the  possibility  of reaching a negotiated, just and lasting solution to the Palestinian-Israeli conflict further along into the future."
    },
    {
        "voto": 1,
        "juez": "Republic of Cuba",
        "pregunta":"The construction of the wall being built by Israel, the occupying Power, in the Occupied Palestinian Territory, including in and around East Jerusalem, and its associated régime, are contrary to international law",
        "texto": "In addition, the General Assembly, by resolution ES-10/13, of 21 October 2003, established that the construction of the Wall is an issue that has clear implications for international law.  Said resolution, in its paragraph 1, “Demands that Israel stop and reverse the construction of the Wall in the  Occupied  Palestinian  Territory,  including  in  and  around  East  Jerusalem,  which  is  in departure of the Armistice Line of 1949 and is in contradiction to relevant provisions of International Law”. /n/nHonourable judges, with regard to the Republic of Cuba’s position on the most salient facts derived from the construction of the Wall, my delegation wishes to reiterate that the situation in the Occupied  Palestinian  Territory  has  always  been  a  source  of  deep  concern  for  my  country.    For decades, Israel, the Occupying Power, has been responsible for continuous and flagrant violations of human rights, of international humanitarian law and of international law in said territory and has ignored resolutions of the General Assembly and the Security Council. /n/nAt present, according to available public information, the situation is even more critical.  The construction  of  the  Wall  supposes  in  the  short-term  a  humanitarian  catastrophe  that  could  be conducive  to  the  extermination  and  genocide  of  the  Palestinian  people,  while,  at  the  same  time, conditioning,  from  the  physical  point  of  view,  the  co-existence  of  two  sovereign  and  independent States in the region, Israel and Palestine. /n/nThe construction of the Wall violates principles and norms of international law enshrined in the Charter of the United Nations and international law. /n/nIf the layout of the Wall foreseen by the authorities of the Occupying Power is carried out, it would  deviate  from  the  Armistice  Line  of  1949  (Green  Line)  up  to  22 km  in  several  places, annexing important zones of the West Bank and in and around Jerusalem. /n/nThe  Occupying  Power,  with  this  act,  would  de  facto  establish  a  new  border  by  means  of unilateral  imposition  and  the  use  of  the  force,  by  means  of  a  separation  wall  between  the Palestinian  Territory  occupied  in  the  war  of  aggression  carried  out  by  Israel  in  1967,  and  its  own State.    By  virtue  of  international  law,  an  aggressor  State  cannot  acquire  a  territory  by  means  of unilateral annexation. /n/nThe construction of the Wall in the Occupied Palestinian Territory also qualifies as an illicit act of annexation in accordance with the provisions of resolutions 478 (1980) and 497 (1981) of the United  Nations  Security  Council,  which  declare  that  the  acts  of  Israel  geared  at  the  annexation  of East Jerusalem and the Golan are null and void, and should not be recognized by States. /n/nThe  construction  of  the  Wall  also  ignores  the  principle  of  the  equality  of  rights  and self-determination of peoples.  The right to self-determination is founded on Article 1, paragraph 2, and  on  Article 55  of  the  United  Nations  Charter.    It  was  sanctioned  also  in  Article 1  of  the Covenants on Civil and Political Rights and on Cultural, Social, and Economic Rights. /n/nLikewise,  the  United  Nations  General  Assembly  has  ratified  this  principle  in  numerous resolutions.    Among  the  most  noteworthy,  it  is  found  in  resolution  1514  (XV)  of  the  fifteenth session  of  the  General  Assembly,  on  the  Declaration  on  the  concession  of  independence  to  the colonial countries and peoples, and in the aforementioned resolution 2625 (XXV) of the twenty-fifth session. /n/nThe  construction  of  the  Wall  goes  against  the  principle  of  peaceful  solution  of  disputes. Article 2,  paragraph 3,  of  the  United  Nations  Charter  establishes  that  States  should  resolve  their disputes  by  peaceful  means.    Thus,  any  delimitation  of  borders  should  be  negotiated  between  the two parties concerned on the basis of equality and equity for both which clearly derives from this principle.    The  parties  should  be  placed  on  equal  terms  and  each  one  of  them  should  respect  the rights of the other in accordance with international law.  The unilateral construction of the Wall by the  Occupying  Power,  in  the  Occupied  Palestinian  Territory,  is  in  no  way  conducive  to  a  climate propitious to the peaceful and negotiated solution of the Israeli-Palestinian conflict on equal terms. /n/nHonourable  judges,  it  is  crystal  clear  that  the  construction  of  the  Wall  goes  against  the provisions contained in a number of resolutions of the General Assembly and the Security Council. /n/nThe  consideration  of  these  resolutions  also  demonstrates  that  the  systematic  refusal  by  the Occupying Power to comply with the provisions contained therein regarding the acts committed in the Occupied Palestinian Territory, entails legal consequences for the Occupying Power. /n/nIn addition, the non-compliance by the Occupying Power of United Nations resolutions is in conflict with the principle of good faith, one of the fundamental principles of international law. /n/nThe  construction  of  the  Wall  in  the  Occupied  Palestinian  Territory  is  also  in  violation  of resolutions  adopted  by  the  United  Nations  bodies  in  the  context  of  the  Israeli  settlements  in  the Occupied Palestinian Territory. /n/nFurthermore,  the  construction  of  the  Wall  by  the  Occupying  Power  violates  principles  and norms of international humanitarian law. /n/nFirst and foremost, Cuba sustains that the Geneva Convention of 12 August 1949 regarding the  protection  of  civilian  persons  in  times  of  war,  the  Fourth  Geneva  Convention,  is  fully applicable to the Occupied Palestinian Territory, including in and around East Jerusalem. Reference should be made to the violations by Israel, the Occupying Power, of said Convention. /n/nThough  Israel  has  contended  that  the  Fourth  Geneva  Convention  is  not  applicable  to  the Occupied  Palestinian  Territory  as  it  is  “not  a  territory  of  a  High  Contracting  Party  as  required  by the  Convention”,  the  applicability  of  this  instrument  to  the  Occupied  Palestinian  Territory  enjoys extensive international recognition.  The written presentation delivered by the Republic of Cuba on 30 January 2004 to this Court, contains legal and factual elements confirming this assertion.  At the same  time,  Israel,  as  Occupying  Power,  is  also  legally  bound  by  other  consuetudinary  norms relating to occupation, according to the stipulations of the Rules annexed to the Hague Convention on Laws and Customs of Land Wars of 18 October 1907. /n/nIn  the  view  of  the  Republic  of  Cuba,  as  a  result  of  the  construction  of  the  Wall  and  of  the severe humanitarian and socio-economic conditions that this has entailed and will continue to entail for  the  population  of  the  Occupied  Palestinian  Territory,  the  Occupying  Power  incurs  in  a  large number of very serious violations of the Fourth Geneva Convention. /n/nIt violates the obligation emanating from Article 1, common to the four Geneva Conventions, according to which the “High Contracting Parties undertake to respect and to ensure respect of said Convention in all circumstances”. /n/nAs a result of the construction of the Wall and of the establishment of arbitrary restrictions to the  movement  of  Palestinian  persons  and  goods  from  one  side  of  the  Wall  to the  other,  access  by the  Palestinian  population  to  their  lands,  jobs,  markets  and  other  sources  of  subsistence  has  been severely limited, with which the Palestinian economy has been severely affected and its population subjected  to  unsustainable  conditions.    This  situation  clearly  demonstrates  that  the  Occupying Power  has  not  fulfilled  its  obligation  to  provide  these  persons  with  the  opportunity  to  find  paid employment,  according  to  provisions  included  in  Article 39,  paragraph 1,  of  the  Fourth  Geneva Convention. /n/nLikewise,  the  Occupying  Power  has  not  fulfilled  the  provisions  of  paragraph 2  of  said Article 39, according to which “where a Party to the conflict applies to a protected person methods of control which result  in  his  being  unable  to  support  himself,  and  especially  if  such  a  person  is prevented for reasons of security from finding paid employment on reasonable conditions, the said Party shall ensure his support and that of his dependents”. In this context, the Occupying Power has not fulfilled the provisions of Article 55, paragraph 1, of the Fourth Geneva Convention, according to which “the Occupying Power has the duty of ensuring the food and medical supplies of the population;  it should, in particular, bring in the necessary foodstuffs, medical stores and other articles if the resources of the Occupied Territory are inadequate”."
    },
    {
        "voto": 1,
        "juez": "Republic of Cuba",
        "pregunta": "Israel is under an obligation to terminate its breaches of international law; it is under an obligation to cease forthwith the works of construction of the wall being built in the Occupied Palestinian Territory, including in and around East Jerusalem, to dismantle forthwith the structure therein situated, and to repeal or render ineffective forthwith all legislative and regulatory acts relating thereto, in accordance with paragraph 151 of this Opinion",
        "texto": "Through  its  presentation,  the  Government  of  the  Republic  of  Cuba  reiterates  inter  alia,  its condemnation of acts of annexation, to the excessive use of force without establishing a distinction between civilians and combatants, to the creation of a humanitarian crisis caused by the limitations imposed on the circulation of goods and persons, to the inhuman treatment of children, and to the generalized destruction of goods, all of which are a direct consequence of the territorial expansion of  the  Occupying  Power  through  the  construction  of  the  Wall,  and  all  of  which  have  clear  legal consequences. /n/nThe right to self-determination of the Palestinian people cannot be alienated and it should be realized on the basis of territorial integrity within the borders of an independent Palestinian State. This right of the Palestinian people has been confirmed by the United Nations General Assembly in numerous  resolutions,  and  also  recognized  in  the  different  phases  of  the  peace  process  in  the Middle East. /n/nThe  right  to  self-determination  is  closely  linked  with  the  concept  of  territorial  sovereignty. A people can only exercise the right to self-determination within a territory.  The amputation of the Palestinian  territory  by  means  of  the  construction  of  a  wall  is  a  serious  breach  of  the  inalienable right  to  self-determination  of  the  Palestinian  people,  since  it  considerably  reduces  the  size  of  the already small self-determination unit within which such right should be exercised. /n/nThis  situation  must  cease.    Israel,  the  Occupying  Power,  has  the  obligation  to  stop  and  to revert the construction of the Wall, while the international community, on the other hand, has also the  obligation  of  not  recognizing  the  control by  the  Occupying Power  of  the  Palestinian  Territory delimited by the Wall. /n/nAccording  to  international  law  the  prohibition  of  acquiring  territories  by  force  applies independently  of  any  other  consideration.  The  Declaration  on  Principles  of  International  Law concerning Friendly Relations and Cooperation among States in accordance with the Charter of the United Nations,  that  is  resolution 2625  of  the  Twenty-Fifth  Session  of  the  General  Assembly (24 October 1970), establishes that “the territory of a State shall not be the object of acquisition by another State resulting from the threat or use of force.  No territorial acquisition resulting from the threat or use of force shall be recognized as legal”. /n/nThe  actions  adopted  by  Israel,  the  Occupying  Power,  of  building  a  wall  in  the  Occupied Palestinian Territory is not justified in any way whatsoever by military necessities. /n/nIt  violates,  furthermore,  the  principle  of  proportionality,  as  it  is  not  proportionate  with legitimate  security  interests,  moves  away  from  measures  of  that  character  and  acquires  the  nature of punishment, humiliation and conquest. /n/nIt must be recalled that, because of their special nature, the norms of international humanitarian  law  establish  obligations  applicable  to  the  international  community  as  a  whole. Therefore, every member of the international community is entitled to demand that said norms be respected. /n/nWith the destruction of dwellings, stores, cultivated lands and other goods belonging to the Palestinian population by the construction of the Wall, the Occupying Power is violating Article 53 of the Fourth Geneva Convention according to which “any destruction by the occupying Power of real estate or personal property belonging individually  or  collectively  to  private  persons,  or  to  the  State,  or  to  other  public authorities, or to social or cooperative organizations, is prohibited, except where such destruction is rendered absolutely necessary by military operations”. In Cuba’s view, the exception foreseen in this Article is not applicable to this case. /n/nKeeping in mind the previously mentioned violations of the rights of the “protected population”,  in  this  case  the  Palestinian  population  resided  in  the  Occupied  Palestinian  Territory, the  Occupying  Power  is  also  violating  Article  47  of  the  Fourth  Geneva  Convention,  according  to which “protected persons who are in occupied territory shall not be deprived, in any case or in any manner whatsoever, of the benefits of the present Convention...”. /n/nAll  the  violations  of  the  provisions  of  the  Fourth  Geneva  Convention  above  described, represent,  furthermore,  a  humiliation  to  the  Palestinian  people  by  virtue  of  Article 27  of  said instrument, according to which “protected persons are entitled, in all circumstances, to respect for their persons, their honour, their family rights, their religious convictions and practices, and their manners and  customs.    They  shall  at  all  times  be  humanely  treated,  and  shall  be  protected especially against all acts of violence or threats thereof...” In  all  evidence,  the  construction  of  the  Wall,  with  its  concrete  structure,  its  razor  wire,  its towers of observation and its electronic monitoring means, creates a population of prisoners. /n/nIn addition to the above, the disproportionate and excessive use of the concept of the right to legitimate  defence  by  the  Occupying  Power,  and  the  violation  of  the  principles  of  proportionality and distinction derived from the construction of the Wall should be also considered. /n/nThe Occupying Power intends to justify the construction of a Wall in the occupied Palestinian territory as being a security measure by virtue of the exercise by States of their right to legitimate  defence.    In  accordance  with  the  United  Nations  Charter  and  international  law,  States have the right to exercise  said right individually or collectively in the case of an armed attack for the protection of its legitimate security interests, and in cases of strict military necessity. Nevertheless, distinguished Members of the Court, those actions should be compliant with international human rights norms and international humanitarian law. /n/nIsrael, the Occupying Power, persists in serious violations of the provisions of the Fourth Geneva  Convention  of  1949.    It  still  refuses  to  accept  the  de  jure  applicability  and  even  the application  of  the  Convention  to  the  Occupied  Palestinian  Territory,  including  Jerusalem,  thus demonstrating  its  refusal  to  respect  the  wish  of  the  international  community,  that  for  more  than 30 years has confirmed the applicability of this Convention to the Occupied Palestinian Territory. /n/nThe  extreme  humanitarian  crisis  imposed  by  the  Occupying  Power  on  the  Palestinian population  since  the  construction  of  the  Wall,  as  described  in  the  report  of  the  Secretary-General and  in  other  public  sources,  may  be  classified  as  a  crime  of  extermination,  as  it  constitutes  the intentional  infliction  of  conditions  of  life,  calculated  to  bring  about  the  destruction  of  part  of  a population, in this case the Palestinian population. /n/nThe  Government  of  the  Republic  of Cuba  equally  expects  that  the  International  Court  of Justice recognize the international responsibility derived for the Occupying Power by the illicit acts previously  expressed.    Likewise,  the  Government  of  the  Republic  of  Cuba  considers  that  the stopping of the process of construction of the Wall in the Occupied Palestinian Territory cannot be postponed, and respectfully requests the Court to demand that the Wall be totally demolished and that the Occupying Power unrestrictedly fulfil its obligations under international law and international humanitarian law."
    },
    {
        "voto": 1,
        "juez": "Republic of Cuba",
        "pregunta": "Israel is under an obligation to make reparation for al1 damage caused by the construction of the wall in the Occupied Palestinian Territory,including in and around East Jerusalem",
        "texto": "The  Occupying  Power  is  up  to  now  preventing  22 Palestinian  locations  from  access  to schools by impeding the free circulation of Palestinians on both sides of the Wall, with which it is violating  the  provisions  of  Article 50,  paragraph 1,  according  to  which  “the  occupying  Power shall...  facilitate  the  proper  working  of  all  institutions  devoted  to  the  care  and  education  of children”. /n/nOn  the  other  hand,  the  Occupying  Power  is  up  to  now  preventing  30 Palestinian  locations from access to health services and eight from access to the primary sources of water provision by impeding the free circulation of Palestinians on both sides of the Wall.  With these actions, Israel is violating the provisions of Article 56, according to which, inter alia, “the occupying Power has the duty of ensuring and maintaining... the  medical and hospital establishments and services,  public  health and hygiene in the occupied territory...”. /n/nThe  emission  of  a  consultative  opinion  on  this  question  should  also  encourage  the Occupying Power to comply with the wishes of the international community and should also play a decisive  role  in  preventing  any  future  intention  of  the  Occupying  Power  to  obtain  international recognition of the de facto situation created in the Occupied Palestinian Territory as a result of the construction of the Wall."
    },
    {
        "voto": 1,
        "juez": "Republic of Cuba",
        "pregunta": "All States are under an obligation not to recognize the illegal situation resulting from the construction of the wall and not to render aid or assistance in maintaining the situation created by such construction; all States parties to the Fourth Geneva Convention relative to the Protection of Civilian Persons in Time of War of 12 August 1949 have in addition the obligation, while respecting the United Nations Charter and international law, to ensure compliance by Israel with international humanitarian law as embodied in that Convention",
        "texto": "It is a violation of the prohibition of the threat and use of force.  In conformity with Article 2, paragraph 4,  of  the  Charter,  the  Members  of  the  United  Nations  shall  abstain  in  international relations  to  resort  to  the  threat  or  use  of  force  against  the  territorial  integrity  or  the  political independence  of  any  State,  or  in  any  another  form  incompatible  with  the  purposes  of  the  United Nations. /n/nThe Government of the Republic of Cuba cannot accept that the following elements may be considered an answer proportionate to the perception of security of the Occupying Power:  the excessive  use  of  force,  the  lack  of  distinction  between  combatants  and  civilians,  the  creation  of  a humanitarian  crisis  as  a  consequence  of  the  limitations  imposed  on  the  circulation  of  goods  and persons, the death and the inhuman treatment of children, the generalized destruction of goods and, ultimately, the territorial expansion by means of the construction of the Wall."
    },
    {
        "voto": 1,
        "juez": "Malaysia",
        "pregunta": "Finds that it has jurisdiction to give the advisory opinion requested",
        "texto": "First, the request to render an urgent advisory opinion comes from the General Assembly, one of the two named principal organs of the United Nations which may request your Court to give an advisory opinion on “any legal question”. /n/nThe Court is presented by the General Assembly with an unambiguously legal question, and nothing more than a legal question. It is not for the Court to scrutinize possible scenarios about the political consequences of an advisory opinion with regard to a particular situation or to consider whether a State, which has disregarded innumerable United Nations resolutions, will be pleased or not with the advisory opinion. This has never been the role of the Court. The Court has never acted in such a manner. Those inviting it to adopt such an attitude are, in Malaysia’s view, seriously damaging the Court’s function, integrity and credibility. /n/nHere Malaysia wishes to concentrate this part of its oral statement on the nature of the territory upon which Israel is constructing the main part of its Wall. This is an essential point which the Court has to address with regard to both the admissibility of the request and the merits of the advisory opinion."
    },
    {
        "voto": 1,
        "juez": "Malaysia",
        "pregunta":"The construction of the wall being built by Israel, the occupying Power, in the Occupied Palestinian Territory, including in and around East Jerusalem, and its associated régime, are contrary to international law",
        "texto": "The General Assembly has come to the Court to seek and to obtain clarification on the legal consequences arising from the construction of the Wall being built by Israel, considering the rules and  principles  of  international  law,  and  to  obtain  further  legal  guidance  that  will  assist  the international community to determine its response.  No institution is better placed than your Court to assess in an authoritative way the situation from an international law perspective. /n/nThe Wall, sections of which are constructed deep inside the Occupied Palestinian Territory, departs from the Armistice Line of 1949 and is therefore illegal under international law. This implies the violation of the obligation to respect the territorial integrity of Palestine and the right of the Palestinian people to self-determination. /n/nThe Wall gravely violates the Fourth Geneva Convention in that it involves the illegal, de facto attempt at annexation of substantial parts of the Palestinian territory and its resources; the transfer of a large number of Palestinian civilians, and further deprivation of human rights of the Palestinians, resulting in further dire humanitarian consequences among an already deprived people. /n/nThe Wall constitutes a unilateral action. It harms the process of implementation of the Road Map. It undermines the effective creation of the Palestinian State. All of this implies a violation of the obligation to pursue negotiations in good faith. /n/nFourthly, the General Assembly adopted on 21 October 2003 the above-mentioned resolution A/ES-10/13, co-sponsored by the European Union and its acceding and associated members. The Assembly demanded that Israel stop and reverse the construction of the Wall in the Occupied Palestinian Territory, considering that this construction is in contradiction with relevant provisions of international law and requested the Secretary-General to report on compliance with the resolution. The Security Council’s failure to adopt a resolution to the same effect was only because of the exercise of a veto. On 24 November, the United Nations Secretary-General submitted a very disturbing report on the non-compliance of Israel with the European Union-initiated Assembly resolution, describing the poor conditions and deprivation of human rights of the Palestinian people and the failure to achieve a peaceful solution. Given this situation, it became imperative upon the Assembly to act. /n/nMoreover, the other so-called “half” of the question, that is the struggle against terrorism, was raised by Israel to justify the construction of the Wall. As reiterated in our Written Statement, Malaysia has always and consistently condemned all forms and manner of terrorism. Internationally, its unequivocal position on terrorism is well known and on record. But Malaysia has also consistently reaffirmed that the struggle against terrorism must be accomplished within the realm of international law and not in violation thereof. As demonstrated in Malaysia’s Written Statement, the construction of the Wall in the Occupied Palestinian Territory cannot be justified on the ground of self-defence, the only circumstance precluding wrongfulness invoked by Israel. Indeed, no other circumstance precluding wrongfulness could be rightfully raised. The conditions required by the Draft Articles on State Responsibility adopted by the International Law Commission to invoke such circumstances as necessity, distress or counter-measures, are clearly not met here. To mention just one reason, the construction of the Wall constitutes a violation of peremptory norms of international law, such as the right to self-determination of peoples and the respect of the territorial integrity of other countries. Palestine is already such a fragile and small entity and there should be no other encroachment of its territory and its natural resources. /n/nIn our Written Statement Malaysia elaborated the main argument why the Court should comply with the General Assembly’s request for an advisory opinion. It is also the main reason why the construction of the Wall is illegal: the Occupied Palestinian Territory is one under international supervision, for which the United Nations in general and the General Assembly in particular have a special responsibility. This responsibility will last until the whole of the former British Mandated Territory achieves a final status, that is, by the effective existence of two States one Arab and the other Jewish living side by side in peace. /n/nGeneral Assembly and Security Council resolutions have clearly and insistently determined that the West Bank, including East Jerusalem, is Occupied Palestinian Territory. Israel simply cannot validly deny these determinations by the United Nations in discharge of the Organization’s special responsibilities for a territory under international supervision. Hence, in this case the Court is not facing a bilateral boundary dispute, or even less, an attempt to request the Court to consider a boundary dispute in another guise, as some have liked us to believe. In its Written Statement, Israel deliberately misrepresented what Malaysia stated in the General Assembly, in order to prove that the intention of the request for an advisory opinion is to solve a bilateral dispute between Palestine and Israel in favour of the former. No, Mr. President, it is not a bilateral dispute, it is the continuous defiance by Israel of the whole international community with regard to a territory for which the United Nations has a special responsibility and in which the entire international community has a particular interest. Yes, Mr. President, we would like to say again and again: “justice must be done in Palestine”. This refers primarily to the respect for international law. /n/nIsrael has adopted a position with regard to the legal status of the Palestinian territory akin to that followed by South Africa with regard to Namibia during the period of the unlawful occupation of Namibia. Israel assumes, without legal justification, to have “rights” over the territory. Legally, the Palestinian situation is even more straightforward than those in the Namibia and Western Sahara Advisory Opinions. Initially, South Africa had a legal title to administer South West Africa as a Mandatory Power, until this Mandate was validly revoked by the General Assembly in 1966. In the case of Western Sahara, Spain was recognized as the Administering Power of a non-self-governing territory. In the case of the Occupied Palestinian Territory none of this has occurred. Israel simply has no legal title to administer a territory under international supervision. It is merely a belligerent occupier. Israel is in a pure de facto situation. /n/nMoreover, it is an indisputable fact that Israel did not claim any title to the West Bank before 1967. Even in the aftermath of the six-day war, and with the exception of Jerusalem, there was “no claim to annexation or title”, as Judge Rosalyn Higgins rightly pointed out in an article written after the war. /n/nIndeed, by establishing a de facto unilateral demarcation line by constructing the Wall, Israel is also violating the obligation to respect the Green Line. As explained in Malaysia’s written statement, whatever the intention of the construction of the Wall, it clearly purports to establish a new separation line. Israelis have freedom of movement west of the Wall but Palestinians need a permit. One of the justifications advanced in the Israeli Written Statement is another clear evidence of this. I quote: “the fence will be moved to reflect any agreement between the parties”. If this will be the case, then the construction of the Wall is nothing else than a unilateral demarcation line imposed upon the other party now, until “any agreement between the parties” will be reached. Moreover, it could be difficult to find any stronger evidence that the Wall is not a simple “temporary measure against terrorism”, but a true de facto separation line aimed at annexation of Palestinian territory than that provided by the official website of the Ministry of Foreign Affairs of Israel. It refers to the “Western, or Israeli side of the security fence”! /n/nThe insistence of Israel in comparing its “fence” in the West Bank, including in and around Jerusalem, with those existing at the borders with Egypt, Jordan and Lebanon, provides yet another striking evidence that the Israeli Government’s purpose in constructing the Wall is not simply to prevent terrorism, but to establish a physical line separating two different areas of exercise of territorial control. Whilst not insisting here upon the “unilateral disengagement plan” as announced by the Israeli Prime Minister, this plan proves indisputably the intentions of the Government of Israel in constructing the Wall."
    },
    {
        "voto": 1,
        "juez": "Malaysia",
        "pregunta": "Israel is under an obligation to terminate its breaches of international law; it is under an obligation to cease forthwith the works of construction of the wall being built in the Occupied Palestinian Territory, including in and around East Jerusalem, to dismantle forthwith the structure therein situated, and to repeal or render ineffective forthwith all legislative and regulatory acts relating thereto, in accordance with paragraph 151 of this Opinion",
        "texto": "Equally, in terms of the law of armed conflict there is no military necessity for Israel to build a wall in a territory it already occupies. From a human rights law perspective the Wall cannot justify the non-compliance with core human rights that are of a non-derogatory nature, even during a state of public emergency. Assuming that the Wall is being constructed in order to protect Israeli citizens within Israel, the Wall should be built on Israeli territory. Furthermore, if an additional main concern is to provide security to the Israeli citizens illegally settled on occupied Palestinian territory, then the best way is to withdraw from those illegal settlements. In any event, to accommodate the security concerns of these illegal Israeli settlements can never be to the detriment of the security and living conditions of the Palestinian people within their own territory and lands. /n/nThe Court will have no difficulty in finding as legal consequences of the construction of the Wall that it neither affects Palestinian sovereignty over the territory lying between the Wall and the Green Line nor creates any territorial right whatsoever in favour of Israel. Moreover, Israel itself, in trying to justify the construction of the Wall, has recognized that the “fence”, as Israel calls it, does not “annex any Palestinian lands” and “does not establish a border”. Hence, since the territories lying between the Green Line and the Wall are internationally recognized as being Palestinian territory, since they have not been claimed as Israeli territory and since they have come under Israeli control only by virtue of military occupation in 1967, the construction and maintenance of the Wall does not affect Palestinian sovereignty and does not create any territorial right in favour of Israel."
    },
    {
        "voto": 1,
        "juez": "Malaysia",
        "pregunta": "All States are under an obligation not to recognize the illegal situation resulting from the construction of the wall and not to render aid or assistance in maintaining the situation created by such construction; all States parties to the Fourth Geneva Convention relative to the Protection of Civilian Persons in Time of War of 12 August 1949 have in addition the obligation, while respecting the United Nations Charter and international law, to ensure compliance by Israel with international humanitarian law as embodied in that Convention",
        "texto": "Fifthly, contrary to what Israel seems to suggest, the Tenth Emergency Special Session was convened and reconvened in a lawful way. In resolution A/ES-10/2 of 2 April 1997, by a vote of 134 to 3, with 11 abstentions, the Assembly determined that: “the repeated violation by Israel, the occupying Power, of international law and its failure to comply with relevant Security Council and General Assembly resolutions and the agreements reached between the parties undermine the Middle East peace process and constitute a threat to peace and security”. /n/nIndeed, Israel has spoken about “Palestinian lands”. But a distinction must be made here. They are not only Palestinian lands, but also Palestinian territory. The former refers to private property or ownership, the latter to sovereignty. Malaysia wishes to add one further legal consequence to those already mentioned at pages 55 and 56 of our Written Statement: the construction and maintenance of the Wall in the Occupied Palestinian Territory does not affect in any way the private or public property of land situated between the Green Line and the line followed by the Wall."
    }
]