[
    {
        "voto": 1,
        "juez": "Bangladesh",
        "pregunta": "Decides to comply with the request for an advisory opinion",
        "texto": "Bangladesh firmly believes that an advisory opinion on the questions posed by the General Assembly would undoubtedly represent a critical and logical step towards ending the illegal occupation. The dismantling of this occupation would, in turn, address the root cause of Israel’s violent subjugation of the Palestinian people. /n/nEnding the occupation would necessarily bring an end to the violence that is exercised upon Palestinians on a daily basis. However, there is no end to the occupation in sight, nor is it likely to end through political means alone. It has become interminable. That much was all but confirmed by Israel’s Prime Minister, Mr Benjamin Netanyahu, on 18 January 2024. The Court’s intervention, to us, is therefore both timely and necessary."
    },
    {
        "voto": 1,
        "juez": "Bangladesh",
        "pregunta":"The construction of the wall being built by Israel, the occupying Power, in the Occupied Palestinian Territory, including in and around East Jerusalem, and its associated régime, are contrary to international law",
        "texto": "Bangladesh has long reiterated the call to end Israel’s occupation of Palestine and to achieve a lasting and permanent solution, which entails the establishment of a sovereign and independent Palestinian State along the pre-1967 borders, with East Jerusalem as its capital. We firmly believe that the Court must heed the long overdue call to holistically examine Israel’s occupation and render an opinion on the legal status of the occupation as a whole. /n/nThe ongoing war represents one of the most shameful catastrophes in the history of the modern era. The United Nations agencies and other humanitarian aid organizations on the ground have warned of a “humanitarian disaster” engulfing the tiny enclave of 2.3 million people, with shortages of food, fuel, drinking water and medicines, worsening by the day. The killing of thousands of innocent civilians, particularly children, the destruction of their homes, the occupation of their ancestral lands and the deliberate obstruction of their access to food and water all constitute blatant violations of international law and serve as textbook examples of ethnic cleansing. /n/nWe elaborated on these matters and the underlying reasoning in our submissions before the Court, Mr President, on 24 July and 25 October last year. It is pertinent to recall that, just four months back, the United Nations Special Rapporteur on the situation of human rights in the Occupied Palestinian Territories, Francesca Albanese, in her report, brought up several appalling facts. I would consider it apt to quote one pertinent aspect: “[I]n the occupied Palestinian territory, the fundamental right to life is under threat, as indicated by the mortality rates of Palestinian children: the neonatal mortality and infant mortality rates in the occupied Palestinian territory are, respectively, 9.3 and 12.7 per 1,000 live births, rising to 14.8 per 1,000 live births for children under 5, while in Israel they are 1.7, 2.7 and 3.4 per 1,000 live births. In addition to direct attacks on the right to life, Palestinians also endure structural violence and racial discrimination, which impedes their full development.” /n/nThe structural violence of the occupation and the deliberate and excessive use of force against the Palestinians are indeed not limited to the recent events in Gaza. As the Special Rapporteur Ms Albanese stated in her 2023 report: “[t]he spectre of death looms as a dominant element in the lives of Palestinian children. This reality exerts a psycho-social toll on those who manage to survive, as poignantly expressed by Ouadia, a 14 year old girl, ‘fearing death does not prevent you from dying, but it prevents you from living.’” /n/nOn Israel’s illegal occupation, Mr President, Members of the Court, the fundamental question posed by the United Nations General Assembly regarding the legality of the Israeli occupation is grounded in established international norms and legal principles. The State of Palestine, in its written statement, underscores the colonial and acquisitive nature of the occupation, emphasizing its deleterious impact on the Palestinian people. The occupation, characterized by persecution, racial discrimination and apartheid, stands in clear violation of three peremptory norms of international law: the right to self-determination, the prohibition of acquiring territory by force and the prohibition of racial discrimination and apartheid. /n/nNumerous submissions have echoed these sentiments, highlighting the temporary nature of belligerent occupation as mandated by international law. The annexation of occupied territory and the settlement of the occupying Power’s nationals in the occupied area are explicitly prohibited, constituting illegal acquisition of territory under the United Nations Charter and relevant United Nations resolutions. /n/nIsrael’s prolonged occupation, coupled with its policies of colonization and annexation, underscores its illegality under international law. These actions not only contravene the United Nations Charter but also violate general international law, including the peremptory norm prohibiting the acquisition of territory by force. /n/nFurthermore, arguments put forth by States and international organizations reject any justification for Israel’s occupation on grounds of self-defence. The occupation violates fundamental principles of international law, including the right to self-determination and the prohibition of acquiring territory by force. /n/nThe Advisory Opinion on Wall, which concluded that Israel cannot rely on self-defence to justify its actions, reinforces the notion that the occupation cannot be justified under international law. /n/nWhile the countries supporting Israel in these advisory proceedings have primarily focused on jurisdictional questions, a few States have addressed the merits of the occupation. One contends that an occupation can never be unlawful, regardless of violations of international humanitarian law. However, this argument stands in contravention of established legal principles and has been widely found to be incorrect. /n/nSwitzerland’s distinction between the “law of occupation” and the “legality of an occupation” further elucidates the legal framework surrounding the issue. An occupation that involves annexation or de facto control of the occupied territory constitutes an illegal acquisition of territory by force, as prohibited under international law. /n/nUltimately, Israel’s occupation, characterized by its acquisitive, colonial and annexationist nature, represents a clear violation of international law. It serves as a means for the illegal acquisition of territory and must be brought to an immediate and unconditional end. /n/nI may also recall the United Nations Security Council resolution 2334 of 23 December 2016, which reaffirmed the obligations of Israel, the occupying Power, to abide scrupulously by its legal obligations and responsibilities under the Fourth Geneva Convention128 in regard to the protection of civilian persons in time of war. /n/nThat Security Council resolution also condemned all measures aimed at altering the demographic composition, character and status of the Palestinian territory occupied since 1967, including East Jerusalem, including, inter alia, the construction and expansion of settlements, transfer of Israeli settlers, confiscation of land, demolition of homes and displacement of Palestinian civilians, in violation of international humanitarian law and relevant resolutions. Israel has flagrantly violated this and all other Security Council resolutions and it continues to do so in furtherance of permanently maintaining its illegal occupation of Palestinian territory. /n/nTherefore, applying one or both of these frameworks, which Bangladesh endorsed for the reasons stated in our written submissions, we would respectfully submit that Israel’s occupation is undoubtedly illegal. I will now turn to the legal consequences. /n/nMr President, distinguished Members of the Court, the promise of a Palestinian State based on a diplomatic settlement grounded in law has been a prominent feature of the international agenda since 1948. Seventy-five years later, there exists a vast body of State practice and opinio juris that emphatically support the Palestinian people’s right to an independent State. The UN Security Council and the General Assembly have adopted numerous resolutions since 1948 on the “Question of Palestine”, recognizing, among other rights, the right of return for Palestinian refugees and the right of Palestinians to establish an independent State along the pre-1967 borders. Additionally, both the United Nations General Assembly and the Human Rights Council have acknowledged the Palestinian people’s right to self-determination. Importantly, in 2004, this Court, in its Advisory Opinion on the Wall, explicitly affirmed the Palestinian people’s right to self-determination under international law. /n/nThe Court’s steadfast commitment to universally uphold the rule of law, coupled with its principled stance on the legality of Israel’s half-century “temporary” occupation of the Occupied Palestinian Territory, would shine a light of hope on the beleaguered Palestinian people. A decisive determination by the Court of the illegal status of the Israeli occupation of Palestinian territory, and the legal consequences that arise from such status, including an immediate, unconditional and complete end to the occupation, would help secure the identity, respect, dignity and existence for the present and future generations of the Palestinian people, in a State of their own, at peace with Israel."
    },
    {
        "voto": 1,
        "juez": "Bangladesh",
        "pregunta": "Israel is under an obligation to terminate its breaches of international law; it is under an obligation to cease forthwith the works of construction of the wall being built in the Occupied Palestinian Territory, including in and around East Jerusalem, to dismantle forthwith the structure therein situated, and to repeal or render ineffective forthwith all legislative and regulatory acts relating thereto, in accordance with paragraph 151 of this Opinion",
        "texto": "Mr President and Members of the Court, there is a broad consensus that Israel, through its denial of the Palestinian people’s right to self-determination, has violated peremptory norms of international law. These violations include persecution, racial discrimination and apartheid against Palestinians, as well as the occupation, colonization and annexation of Palestinian land. These systematic breaches severely undermine the rights of Palestinians as a people and of Palestine as a State, while also hindering the prospects for a just and lasting peace in accordance with international law and relevant United Nations resolutions. Consequently, international law mandates the complete, unconditional and immediate cessation of these internationally wrongful acts. /n/nAll States and international organizations that have condemned Israel’s conduct agree that these systematic and grave breaches carry legal consequences for Israel as the responsible State, other States, and the United Nations and other intergovernmental organizations. /n/nOn legal consequences for Israel, first, Israel must cease all acts preventing the exercise of the right to self-determination by the Palestinian people, including rescinding discriminatory laws and measures. This cessation includes withdrawing occupation forces, dismantling illegal structures such as settlements and the Wall, and repealing annexation-related legislation."
    },
    {
        "voto": 1,
        "juez": "Bangladesh",
        "pregunta": "Israel is under an obligation to make reparation for al1 damage caused by the construction of the wall in the Occupied Palestinian Territory,including in and around East Jerusalem",
        "texto": "And second, Israel must provide reparations for the damages caused and guarantee non-repetition."
    },
    {
        "voto": 1,
        "juez": "Bangladesh",
        "pregunta": "All States are under an obligation not to recognize the illegal situation resulting from the construction of the wall and not to render aid or assistance in maintaining the situation created by such construction; all States parties to the Fourth Geneva Convention relative to the Protection of Civilian Persons in Time of War of 12 August 1949 have in addition the obligation, while respecting the United Nations Charter and international law, to ensure compliance by Israel with international humanitarian law as embodied in that Convention",
        "texto": "On the legal consequences of all other states: first, all States must ensure the immediate cessation of any impediment to the exercise of the Palestinian people’s right to self-determination and uphold the prohibition of acquiring territory by force, and of racial discrimination and apartheid. /n/nAnd second, States must not recognize the illegal situation resulting from Israel’s wrongful acts, including in Jerusalem, and must not provide aid or assistance to maintain this situation. Co-operation is essential to ensure Israel’s compliance with international law and humanitarian standards."
    },
    {
        "voto": 1,
        "juez": "Bangladesh",
        "pregunta": "The United Nations, and especially the General Assembly and the Security Council, should consider what further action is required to bring to an end the illegal situation resulting from the construction of the wall and the associated régime, taking due account of the present Advisory Opinion",
        "texto": "On legal consequences for the United Nations: first, the General Assembly and the Security Council should consider further action to immediately end the Israeli occupation and remove obstacles to Palestinians’ rights, including self-determination. /n/nAnd second, immediate action is necessary to end the system of apartheid set up by Israel, with relevant United Nations resolutions implemented without delay."
    }
]