[
    {
        "voto": 1,
        "juez": "Bolivia",
        "pregunta": "Finds that it has jurisdiction to give the advisory opinion requested",
        "texto": "Bolivia considers that the Court possesses jurisdiction to give the advisory opinion requested by the General Assembly, based on the Court’s own settled jurisprudence."
    },
    {
        "voto": 1,
        "juez": "Bolivia",
        "pregunta": "Decides to comply with the request for an advisory opinion",
        "texto": "In this context, suffice it to recall that the Court confirmed in 2004 that, '[w]hatever its political aspects, the Court cannot refuse to admit the legal character of a question which invites it to discharge an essentially judicial task, namely, an assessment of the legality of the possible conduct of States with regard to the obligations imposed upon them by international law'. It is in this sense that the Court, as the highest instance of international justice, must clarify and affirm the obligations and rights of the States that international norms have established, and that have now been requested in this advisory opinion as a guide for the actions and powers of the United Nations General Assembly and the States."
    },
    {
        "voto": 1,
        "juez": "Bolivia",
        "pregunta": "The construction of the wall being built by Israel, the occupying Power, in the Occupied Palestinian Territory, including in and around East Jerusalem, and its associated régime, are contrary to international law",
        "texto": "Mr President, Members of the Court, it is an honour to appear before you on behalf of the Plurinational State of Bolivia to address an issue of vital importance for the international community. Today, the world looks to this Court, the principal judicial body of the United Nations, which is empowered to determine the legal consequences arising from Israel’s continued violations of the right of the Palestinian people to self-determination; from its prolonged acts of occupation; from its continued settlements and annexation of Palestinian territory, including measures which alter the demographic composition, character and status of the holy city of Jerusalem; and the adoption by Israel of related discriminatory legislation and measures, as requested by the General Assembly of the United Nations.\n\nThe right to self-determination is enshrined in Article 1 of the United Nations Charter. In 1970, General Assembly resolution 2625, confirmed, as put by this Court in 2019, the normative character of its right under customary international law. Resolution 2625, the Friendly Relations declaration, confirmed that the duty of each State is “to refrain from any forcible action which deprives peoples of their right to self-determination and freedom and independence” and to “promote, through joint and separate action, realization of the principle of equal rights and self-determination of peoples”.\n\nThe continued siege of Palestinian people through Israel’s illegal occupation, annexation and colonization since 1948 has systematically and forcibly discriminated, displaced and fragmented the Palestinian people by deliberately denying them their recognized inalienable right to self-determination and their right to return to their homeland, where the State of Israel is now illegally established. The illegal Israeli occupation of the Palestinian territories constitutes a denial of this right and, in this sense, Israel violates the right enshrined under international law.\n\nAlmost 20 years ago, in the Advisory Opinion on the Legal Consequences of the Construction of a Wall in the Occupied Palestinian Territory, this Court reminded Israel of its obligations under international law, reaffirming that it was “bound to comply with its obligation to respect the right of the Palestinian people to self-determination and its obligations under international humanitarian law and international human rights law”.\n\nBolivia considers that the General Assembly resolution 15 of August 2004 expands on fundamental aspects of this Court’s Advisory Opinion on the Legal Consequences of the Construction of a Wall in the Occupied Palestinian Territory, including as regards East Jerusalem and its surroundings. Accordingly, they form part of the context to be considered in relation to the legal consequences of Israel’s policies and practices in the Occupied Palestinian Territory which we are analysing during this period at the Court.\n\nThus, Mr President, Members of the Court, Bolivia contends that by continuously depriving and denying the Palestinian people’s right to self-determination for 75 years, Israel is in clear breach of its international obligations.\n\nMr President, Members of the Court, Article 2 of the United Nations Charter contains a general rule against the unlawful use of force and states that “[a]ll Members shall refrain in their international relations from the threat or use of force against the territorial integrity or political independence of any state, or in any other manner inconsistent with the Purposes of the United Nations”. The prohibition of aggression is binding on all States, and it constitutes a peremptory norm of international law.\n\nOn 22 November 1967, the Security Council unanimously adopted resolution 242 (1967), in which it insisted on the inadmissibility of the acquisition of territory by war and called for the withdrawal of Israeli armed forces.\n\nBy the same token, through resolution 252 of 21 May 1968, the Security Council reaffirmed the point, considering that “all legislative and administrative measures and actions adopted by Israel, including the expropriation of land and property therein, that tend to change the legal status of Jerusalem are invalid and cannot change that status”.\n\nIt is imperative to recall that the Security Council urged Israel to scrupulously observe the provisions of the Geneva Conventions and international law on military occupation, further reiterating that the Geneva Convention of 12 August 1949 on the Protection of Civilians in Time of War applied to the Arab territories occupied by Israel since 1967, including Jerusalem.\n\nIn particular, Article 49 of the Fourth Geneva Convention protects against colonization of occupied territory by providing that “[t]he occupying Power may not carry out the evacuation or transfer of any part of its own civilian population to the territory occupied by it”.\n\nYet, the transfer of 750,000 Israeli settlers and the building of settlements in East Jerusalem and the rest of the West Bank have been deliberately carried out with the intention of acquiring the territory through de facto and de jure annexation, including through colonization, confinement and fragmentation of the occupied Palestinian territories.\n\nNot only the Security Council and the Human Rights Council, but also the General Assembly, reaffirmed the principle of inadmissibility of the acquisition of territory by force, condemned and rejected Israeli measures aimed at altering the demographic composition, the character and status of Jerusalem and the Occupied Palestinian Territory. States in their international relations must refrain from resorting to the threat or use of force against the territorial integrity or political independence of any State or coerce another State to subordinate it in the exercise of its sovereign rights and obtain advantages of any type.\n\nBolivia considers that Israeli colonial settlements in the occupied Palestinian territory, including East Jerusalem, the West Bank, the Gaza Strip and the Syrian Golan, have been built by force, through the imposition of institutionalized, racially discriminatory régimes (including apartheid) and through the denial of the exercise of the right to self-determination in contravention of international law. As a result, they must be considered illegal. Similarly, Israel’s occupation results from an act of aggression and, as such, it must be considered illegal under both jus in bello and jus ad bellum.\n\nThe Committee on the Exercise of the Inalienable Rights of the Palestinian People, in its 2023 study of the legality of the Israeli occupation, endorsed the growing body of evidence that Israel’s belligerent occupation of the Palestinian territory is illegal in so far as it denies the inalienable right of the Palestinian people to self-determination, including their right to an independent State of Palestine.\n\nThe occupying Power lacks the right of sovereignty over the occupied territory, as confirmed by the principle of permanent inviolability of the rights of the protected population in the event of annexation, which is enshrined in Article 47 of the Fourth Geneva Convention of 1949. The occupying Power cannot alienate the land or the properties of the occupied State.\n\nThus, Bolivia considers that the Israeli colonialist occupations are clearly illegal according to jus in bello, and are illegal occupations because there is a violation of the normative order and the legal régime of the occupation such as the principles of temporality, the prohibition of annexation by force, serious violations of human rights and the right to self-determination, inalienability of sovereignty and the prohibition of racial discrimination, apartheid and, more recently, genocide.\n\nMr President, Members of the Court, Bolivia observes with concern that Israel’s actions of persecution, oppression and domination of the Palestinian people have been accompanied by systematic violations of fundamental human rights that have been observed by both the Security Council and the Human Rights Council. This includes a system of racial discrimination and a system of apartheid that has not abated despite repeated condemnations from the international community.\n\nThe Human Rights Council has repeatedly called for the immediate protection of Palestinian civilians in the Occupied Palestinian Territory in accordance with human rights standards and international humanitarian law. It has further stressed all policies and measures adopted by Israel to limit access of Palestinians to their holy sites, in particular in occupied East Jerusalem, on the basis of their national origin, religion, birth, sex or any other status, violate the relevant provisions set forth in the Universal Declaration of Human Rights, the International Covenant on Civil Rights and Political Human Rights, the International Covenant on Economic, Social and Cultural Rights and the Fourth Geneva Convention on the Protection of Civilians in Times of War; these measures must cease. “Israel is under an obligation to cease its wrongful conduct”.\n\nThe international community has repeatedly condemned Israel’s actions, including through the United Nations, in so far as they hinder the exercise of the Palestinian right to self-determination. These have included the construction of illegal settlements in occupied Palestinian territories, the construction of the separation wall in the West Bank, and other measures that affect the daily lives of Palestinians. Bolivia has consistently joined these condemnations.\n\nIsrael’s occupation, both in its means and its purpose, does not fall within the framework of legality established in international law. The de facto annexation of territory imposes restrictions on where Palestinians can live and travel, as well as a racially discriminatory legal and administrative régime that favours Israeli settlers and deprives Palestinians of their most basic rights.\n\nThe conclusion is unavoidable that Israel has used its prolonged occupation as a pretext to pursue its illegal objective of annexing the occupied Palestinian territories, in violation of the Charter of the United Nations. Therefore, the Israeli occupation must be considered illegal in its entirety.\n\nMr President, Members of the Court, the policies and practices of Israeli occupation in Palestinian territory are illegal and have legal consequences with obligations for Israel and for other States and the United Nations, since they violate the rights of the Palestinians as a people and of Palestine as a State and therefore they both demand the complete and immediate cessation of these illicit international acts."
    },
    {
        "voto": 1,
        "juez": "Bolivia",
        "pregunta": "Israel is under an obligation to terminate its breaches of international law; it is under an obligation to cease forthwith the works of construction of the wall being built in the Occupied Palestinian Territory, including in and around East Jerusalem, to dismantle forthwith the structure therein situated, and to repeal or render ineffective forthwith all legislative and regulatory acts relating thereto, in accordance with paragraph 151 of this Opinion",
        "texto": "Bolivia considers Israel’s ongoing illegal occupation to be in violation of international law. In particular, Bolivia considers that Israel’s illegal occupation infringes on the right of the Palestinian people to self-determination; that, through its prolonged occupation, settlements and annexation of the Palestinian territory occupied since 1967, it violates the fundamental principle of international law proscribing the acquisition of territory by force; and that it violates the international prohibition of racial discrimination and the establishing of a system of apartheid.\n\nBolivia considers that Israel, as the State responsible for these violations of international law, must cease the de jure and de facto acts and policies that prevent the exercise of the right to self-determination of the Palestinian people and fulfil its obligation to end the situation of illegal occupation and its discriminatory policies and practices designed and maintained to establish dominance in a peaceful, immediate and unconditional manner. Therefore, Israel is also obliged to stop development of the atrocities of genocide committed more recently in Gaza and to comply with the provisional measures set forth in the Order of this Court on 26 January 2024.\n\nIsrael must also comply with its international obligations and stop continued Israeli settlement activities that are jeopardizing the viability of the two-State solution based on the 1967 lines and retract Israel’s announcement in February of last year of a further construction and expansion of settlements and the “legalization” of advanced settlements. Israel must cease the armed occupation and cancel the annexation of Palestinian territories and reverse illegal settlements by establishing reparation and compensation. As the occupying Power, it must assume responsibility for 76 years of occupation and for the siege imposed on the Gaza Strip and the ongoing atrocities of crimes of genocide.\n\nBolivia considers that, within the framework of the resolutions mentioned in the advisory opinion brief, Israel must immediately and completely put an end to all settlement activities in the Occupied Palestinian Territory, and reaffirms that the establishment of settlements by Israel in the Palestinian territory occupied since 1967, including East Jerusalem, has no legal validity and constitutes a manifest violation of international law and a major obstacle to the achievement of the two-State solution and a comprehensive, just and lasting peace."
    },
    {
        "voto": 1,
        "juez": "Bolivia",
        "pregunta": "All States are under an obligation not to recognize the illegal situation resulting from the construction of the wall and not to render aid or assistance in maintaining the situation created by such construction; all States parties to the Fourth Geneva Convention relative to the Protection of Civilian Persons in Time of War of 12 August 1949 have in addition the obligation, while respecting the United Nations Charter and international law, to ensure compliance by Israel with international humanitarian law as embodied in that Convention",
        "texto": "Bolivia considers that the discriminatory measures of a colonial nature imposed by Israel prior to the legal status of the occupation, are aimed at the dispossession of the Palestinian population and to the denial of their rights by altering the demographic composition, character and status of the city of Jerusalem. The ongoing situation results in consequences, and obligations, for all States and for the United Nations.\n\nMr President, Members of the Court, the international community has, including through the United Nations, repeatedly condemned and must continue to condemn Israel’s actions that hinder the exercise of the Palestinian right to self-determination, such as the construction of illegal settlements in occupied Palestinian territories, the construction of the separation wall in the West Bank, and other discriminatory measures that affect the daily lives of Palestinians.\n\nIn this context, States and international organizations are under an obligation to prevent and take measures and co-operate to prevent Israel from continuing to violate the Palestinian right to self-determination and its discriminatory practices of domination and apartheid and to avoid any act of support for the genocide of the Palestinian people. These measures may include diplomatic actions, economic sanctions, political pressure and legal measures.\n\nStates have the obligation to contribute with separate or joint actions to the State of Palestine’s exercise of its right to self-determination. States parties to the Genocide Convention also have clear obligations to act to prevent, suppress and punish genocide, employing “all means reasonably available to them, so as to prevent genocide so far as possible within the limits permitted by international law”, also clarified in the 2024 Ukraine v. Russia case.\n\nThe Plurinational State of Bolivia considers that the Presidential Declaration of the Security Council of 20 February 2023 firmly underlines the need for all parties to comply with their international obligations and commitments. In this sense, States have the obligation not to recognize the illegal situation resulting from the acts of occupation of the territories of Palestine by Israel, the impediment to the right to self-determination of the Palestinian people, the prevention of discrimination, apartheid and genocide and avoid any act of complicity and action that contributes to the maintenance of these illegal situations.\n\nBolivia believes that all States must firmly oppose all unilateral measures that impede peace, including, among others, to refrain the arms trade, the construction and expansion of Israeli settlements, the confiscation of Palestinian lands and the “legalization” of settlements, the demolition of Palestinian homes and the displacement of Palestinian civilians. States have to reject the expansionist and colonialist policies that Israel has been developing for half a century, promoting a system of apartheid and constant suffocation and genocide against the Palestinian people, in violation of international law, the Charter of the United Nations and the respective resolutions approved by the Security Council, the Human Rights Council and the General Assembly.\n\nAs a pacifist country, the Plurinational State considers that the only alternative to guarantee a just and lasting peace in the conflict between Israel and Palestine must be the obligation for all States to contribute to dialogue and negotiation, with clear expressions of political will from both parties, to achieve a two-State solution, consolidating a free, sovereign and independent Palestinian\n\nState as it is established with the pre-1967 international borders, with East Jerusalem as its capital, in accordance with the relevant Security Council and the General Assembly resolutions. Following the principles of international law and peace, Bolivia recognized Palestine as an independent and sovereign State on 17 December 2010 along the 1967 border because it meets all the traditional criteria for statehood.\n\nAll States have common but differentiated responsibilities and the obligations to provide solidarity and assistance to the Palestinian people. Accordingly, and despite its economic limitations, the Plurinational State of Bolivia, is making an important effort by sending a contingent of humanitarian aid, which we hope can reach its destination without objection from the occupying\n\nPower.\n\nBolivia further considers that the Security Council, the Human Rights Council, the United Nations General Assembly and the International Court of Justice, as well as the relevant treaty bodies, must continue to call on Israel to comply with its obligations under international law, to cease the expansion of illegal settlements, and guarantee the full exercise, enjoyment and respect of the human rights of the Palestinian population.\n\nSimilarly, the United Nations has the obligation to implement all relevant resolutions and other necessary measures and additional resolutions to bring to an end to Israel’s illegal occupation and the present system of racial discrimination and apartheid.\n\nMr President, Members of the Court, every day we witness atrocities and an increasing irreparable loss of lives of the Palestinian people; the news documents daily the suffering, we know not what legal consequences these international crimes may yield, as they continue notwithstanding the Order on provisional measures of 26 January 2024.\n\nWith its advisory opinion, the Court has the power to establish what these consequences are."
    }
]
