[
    {
        "voto": 1,
        "juez": "Brazil",
        "pregunta": "Finds that it has jurisdiction to give the advisory opinion requested",
        "texto": "There seems to be no doubt, according to Article 65 (1) of the ICJ’s statute, that this Court is competent to issue the advisory opinion commissioned by the General Assembly, an equally competent body to request it. The subject of the consultation is intrinsically linked to relevant principles of international law, such as the right to self-determination and the prohibition of the annexation of territory by force, making the opinion of this judicial organ even more crucial for the entire international community."
    },
    {
        "voto": 1,
        "juez": "Brazil",
        "pregunta": "Decides to comply with the request for an advisory opinion",
        "texto": "From Brazil’s perspective, the current request for an advisory opinion, addressed to the highest judicial body in the United Nations system, could not be more timely. Brazil believes that the Court’s pronouncement is necessary so that not only Israel, as the occupying Power, but also all countries seeking to align their conduct within the limits of international law and justice can have clarity on the legal implications of Israel’s occupation and its policies and practices in the Palestinian occupied territories.\n\nIt is not surprising, therefore, that over fifty countries have decided to participate in the proceedings concerning this advisory opinion.\n\nMr President, esteemed judges, the importance of the matter and the gravity of the situation in the Palestinian occupied territories were indisputable even before 7 October 2023. The tragic events of that date, and the disproportionate and indiscriminate military operations that followed, however, make it glaringly clear that the mere management of the conflict cannot be considered an option, and that a two-State solution, with an economically viable Palestinian State living side by side with Israel, is the only way to provide peace and security for Israelis and Palestinians.\n\nWe know that the current request for an advisory opinion has a defined, restricted scope, excluding political considerations, as well as the legal definition of the events of 7 October and subsequent military operations. The consequences of these recent events notwithstanding, intrinsically linked to the Israeli occupation of Palestine, compels Brazil to mention them at this public hearing."
    },
    {
        "voto": 1,
        "juez": "Brazil",
        "pregunta": "The construction of the wall being built by Israel, the occupying Power, in the Occupied Palestinian Territory, including in and around East Jerusalem, and its associated régime, are contrary to international law",
        "texto": "The right of peoples to self-determination is enshrined in international law, including in the Charter of the United Nations, and widely recognized by the United Nations General Assembly. This Court, and the General Assembly, have expressly recognized that the existence of the Palestinian people, as much as their right to self-determination, is indisputable. Brazil would appreciate that the Court, within the scope of the present advisory opinion, could highlight the principled position that the Israeli occupation of Palestinian territories violates the right of the Palestinian people to self-determination.\n\nIn 1967, Security Council resolution 242 emphasized the inadmissibility of acquiring territory by force and directed Israel to withdraw its troops from the then recently occupied Palestinian territory. However, the occupation persists to this day and has been aggravated by the construction of the separation wall in Palestinian territory, the building of illegal settlements in the West Bank and the annexation of East Jerusalem. As recognized by the Court in the Wall Advisory Opinion, Israel has continued to have the status of occupying Power. The prolonged occupation, settlement and annexation of Palestinian territories, including measures aimed at altering the demographic composition, character and status of these territories, including Jerusalem, violate relevant rules of international law.\n\nThe Universal Declaration of Human Rights and the International Covenant on Civil and Political Rights foundational instruments of the international human rights protection system  guarantee the right of all individuals to be treated equally, without discrimination based on race, colour, gender or religion. By extending its jurisdiction over the Occupied Palestinian Territory and establishing two distinct legal systems one applied to Israeli settlers and another imposed, under military rule, to Palestinians Israel is practising discrimination against the Palestinian population, while impairing the recognition, enjoyment or exercise, on an equal footing, of their human rights and fundamental freedoms. This differential treatment is evident and well documented and should also be addressed by the Court."
    },
    {
        "voto": 1,
        "juez": "Brazil",
        "pregunta": "Israel is under an obligation to terminate its breaches of international law; it is under an obligation to cease forthwith the works of construction of the wall being built in the Occupied Palestinian Territory, including in and around East Jerusalem, to dismantle forthwith the structure therein situated, and to repeal or render ineffective forthwith all legislative and regulatory acts relating thereto, in accordance with paragraph 151 of this Opinion",
        "texto": "On the legal status of the occupation, Brazil expects that the Court reaffirms that the Israeli occupation of Palestinian territories is illegal and violates international obligations through a series of actions and omissions by Israel. The confiscation of Palestinian lands, the destruction of Palestinian properties, the construction of Israeli settlements and of the wall, and the adoption of measures aimed at changing the demographic composition of areas within Palestinian territories must all be taken into account by the Court. Those persistent practices are tantamount to annexation.\n\nOn the legal consequences: the practices described above, which have persisted for decades, result in obligations for Israel, the occupying Power, and for all other States seeking to conduct themselves in accordance with international law, as follows.\n\nFirst of all, Israel must put an end to the occupation of Palestine. Its primary obligation is to cease and not repeat the acts and omissions by which it occupies and prolongs the occupation of Palestinian territories."
    },
    {
        "voto": 1,
        "juez": "Brazil",
        "pregunta": "Israel is under an obligation to make reparation for all damage caused by the construction of the wall in the Occupied Palestinian Territory,including in and around East Jerusalem",
        "texto": "Secondly, according to the jurisprudence of this Court, a State violating principles and rules of international law must provide due reparation."
    },
    {
        "voto": 1,
        "juez": "Brazil",
        "pregunta": "All States are under an obligation not to recognize the illegal situation resulting from the construction of the wall and not to render aid or assistance in maintaining the situation created by such construction; all States parties to the Fourth Geneva Convention relative to the Protection of Civilian Persons in Time of War of 12 August 1949 have in addition the obligation, while respecting the United Nations Charter and international law, to ensure compliance by Israel with international humanitarian law as embodied in that Convention",
        "texto": "Thirdly, the illegality of the situation creates obligations not only on the occupying Power but also on all States.\n\nThe main obligation is that all States must abstain not only from formal recognition of this situation but also from acts that could imply such recognition.\n\nNo State should collaborate with Israeli actions or initiatives related to the illegal occupation of Palestinian territories.\n\nFinally, States must co-operate to bring an end through lawful means to the occupation at the earliest."
    }
]


