[
    {
        "voto": 1,
        "juez": "China",
        "pregunta": "Finds that it has jurisdiction to give the advisory opinion requested",
        "texto": "Mr President, I will now turn to address the matter of jurisdiction. In this regard, China submits that the Court has jurisdiction over this case and there is no compelling reason for the Court to decline to exercise its jurisdiction. /n/nChina is of the view that these two arguments are not tenable. First, the subject of the present request falls within the competence of the General Assembly and has always been on its agenda. Therefore, the Court, by rendering an advisory opinion in this case, would not circumvent the principle of consent in the settlement of bilateral disputes. The question of Palestine, with its origin in the mandate system under the League of Nations, goes beyond the scope of bilateral affairs between Palestine and Israel. It directly relates to the responsibility of the United Nations on international peace and security. The United Nations has a “permanent responsibility” toward the question of Palestine1."
    },
    {
        "voto": 1,
        "juez": "China",
        "pregunta": "Decides to comply with the request for an advisory opinion",
        "texto": "Second, the issuance of an advisory opinion by the Court would not contradict the established legal framework or disrupt negotiations to settle the question of Palestine in accordance with international law. The Court’s advisory opinion will not set up new legal frameworks or rules. Rather, it will find its basis in the established legal framework, including relevant Security Council resolutions and the Oslo Accords, and present an interpretation of relevant legal questions. Furthermore, the advisory opinion will offer clearer legal guidance on the legal issues involved in the negotiations, thus facilitating the relaunching of the negotiation process. /n/nChina supports the Court in discharging its jurisdiction in accordance with the law, with a focus on identifying, interpreting and applying existing rules, upholding the purposes and principles of the Charter of the United Nations, providing legal guidance to the UN in dealing with the question of Palestine, and fostering a proper settlement through peace talks."
    },
    {
        "voto": 1,
        "juez": "China",
        "pregunta":"The construction of the wall being built by Israel, the occupying Power, in the Occupied Palestinian Territory, including in and around East Jerusalem, and its associated régime, are contrary to international law",
        "texto": "The Palestinian-Israeli conflict stems from Israel’s prolonged occupation of Palestinian territory and Israel’s long-standing oppression of the Palestinian people. The Palestinian people fight against Israeli oppression and their struggle for completing the establishment of an independent State on the occupied territories are, essentially, just actions for restoring their legitimate rights. The right to self-determination serves as the precise legal foundation for their struggle. /n/nThe Palestinian people, being a group residing in territory under foreign domination2, is a sui generis international legal person as a whole3. The right to self-determination of the Palestinian people has been consistently reaffirmed in multiple United Nations resolutions4 and the Wall Advisory Opinion5. This is also widely recognized by most States and international organizations. /n/nEvery State is obliged to promote the realization of the right to self-determination and to refrain from any forcible action which deprives peoples of that right. In their pursuit of the right to self-determination, these peoples have the right to engage in struggles, seek and receive support11. On the basis of that right, the Palestinian people declared the establishment of the State of Palestine in 1988, which has been recognized by over 130 countries./n/nAgainst the backdrop of the Occupied Palestinian Territory, well-documented and widely recognized facts indicate that Israel’s oppressing policies and practices, throughout its prolonged occupation of Palestinian territory, have severely undermined and impeded the exercise and full realization of the Palestinian people’s right to self-determination. /n/nThe principle of non-use of force is at the core of jus ad bellum. As a corollary of this principle, the prohibition on the acquisition of territory by force is firmly established in customary international law. Using force to occupy and maintain such occupation for the purposes of territorial acquisition or annexing an occupied territory by force in whole or in part, is each illegal. These are confirmed by the Friendly Relations Declaration of 1970, the “Definition of Aggression” of 1974 and the Wall Advisory Opinion15. /n/nIsrael’s occupation has been explicitly recognized as unlawful by several United Nations resolutions. Following Israel’s occupation of the Palestinian territories in 1967, the Security Council adopted resolution 242 that “[e]mphasiz[es] the inadmissibility of the acquisition of territory by war”. Similarly, multiple General Assembly resolutions affirmed the illegality of Israel’s occupation16. /n/nObviously, the rules of belligerent occupation are applicable to the Occupied Palestinian Territory and should be followed by both parties to the conflict. Facts indicate that relevant Israeli policies and practices have violated international humanitarian law and international human rights law. /n/nChina is of the view that the temporary and non-sovereign nature of belligerent occupation means that an occupying Power cannot acquire sovereignty over the territory during the belligerency. Belligerent occupation, under any circumstances, does not have the effect of lawful annexation. The rules of acquisitive prescription in international law does not apply to belligerent occupation. Fifty- seven years have passed since Israel began its occupation of the Palestinian territory. Regardless of the duration of the occupation, the unlawful nature of the occupation and the sovereignty over the occupied territories remain unchanged."
    }
]