[
    {
        "voto": 1,
        "juez": "Hungary",
        "pregunta": "Finds that it has jurisdiction to give the advisory opinion requested",
        "texto": "Hungary duly submits that the United Nations General Assembly’s request for an advisory opinion contained in resolution 77/247 of 2022 satisfies the conditions set out in Article 65 of the Statute of the Court and in Article 96 of the United Nations Charter both regarding the competence of the requesting organ and the substance of the request. Accordingly, the Court has jurisdiction in this case. However, we also duly submit that, based on Article 96 of the United Nations Charter, it is at the discretion of this Court to decide whether it exercises its jurisdiction."
    },
    {
        "voto": 0,
        "juez": "Hungary",
        "pregunta": "Decides to comply with the request for an advisory opinion",
        "texto": "We put to the Court that there are compelling reasons to deny the request for an advisory opinion. All these reasons pertain to the issue of judicial propriety. The reasons include the specifics of the questions, the essentially bilateral nature of the dispute and the lack of consent of one of the parties, as well as the already existing legal framework for the resolution of pending issues and disputes between the parties.\n\nConsequently, the Hungarian Government is of the view that the Court should decline to exercise its jurisdiction.\n\nThere are three compelling reasons for the Court not to exercise its jurisdiction.\n\nMr President, we now turn to the second issue: the compelling reasons why the Court should reject to give an opinion on the request made by the General Assembly.\n\nWe recall the existing precedent for rejecting a request for an advisory opinion based on compelling reasons. The predecessor of the Court, the Permanent Court of International Justice, declined to issue an advisory opinion on the status of Eastern Carelia. This decision has never been overruled. We note that the Court, in its subsequent decisions, has always taken due care to demonstrate the factual differences from the Eastern Carelia case when considering the exercise of its jurisdiction. This must lead us to the conclusion that the legal criteria set out in that decision remain authoritative.\n\nAs to compelling reasons, we would like to bring the Court’s kind attention to the following three considerations that individually, as well as cumulatively, may compel the Court to refrain from issuing an advisory opinion to the present questions.\n\nFirst, we express sincere doubt that the nature of the question would allow for an appropriate advisory opinion. While the title of the General Assembly resolution 77/247 speaks of “Israeli practices affecting the human rights of the Palestinian people”, the question posed in operative paragraph 18 of the resolution says: “legal consequences arising from the ongoing violation by Israel of the right of the Palestinian people to self-determination” and “related discriminatory legislation and measures”. The questions encompass a wide range of subject-matters, touching upon the legal status of the occupied Palestinian territories, the unspecified Israeli practices and the legal consequences of both the status of the occupied Palestinian territories as well as those practices. While the questions do not specify the actual practices and legislation, they already provide a distinct qualification stating their illegality and unlawful nature. Replying to these questions would inherently entail an affirmation of the statements incorporated in the question. Advisory proceedings were designed as an instrument to contribute to, and facilitate the work of, the requesting organs. These proceedings are not an appropriate forum for making the kinds of determinations that are implied in the question. As the Court put it in the Kosovo Advisory Opinion: Article 65 of the Statute of the Court has not created “a form of judicial recourse for States”. In our view, should the Court decide to reply to these questions in the form of an advisory opinion, that would be “tantamount to adjudication on the very subject-matter of the underlying concrete bilateral dispute that undoubtedly exists between Israel and Palestine”.\n\nThis leads us to our second consideration concerning the essentially bilateral nature of the dispute. At the outset, we duly take note of the Wall Advisory Opinion, in which the Court concluded that the conflict between Israeli and Palestinian parties is “located in a much broader frame of reference than a bilateral dispute”. However, it must be pointed out that this “broader frame of reference” has fundamentally changed due to the shifting political dynamics within the conflict. The Wall Advisory Opinion was issued during ongoing peace negotiations between the parties that, alas, have not yielded the desired outcome. Unfortunately, in recent years, despite repeated calls for relaunching good faith negotiations between the parties by the international community, including this very Court, the process has stalled. Deadlock continues to ensue and the conflict thus remains an acute bilateral dispute between the parties.\n\nOn this basis, we argue that providing an advisory opinion would inevitably raise the question of circumventing consent of Israel as a party to this bilateral dispute. We refer to the fact that Israel voted against resolution 77/247 in the General Assembly in 2022. Israel’s attitude in the previous decades has demonstrated its readiness to participate in different negotiations and peace processes. This is the very way the esteemed Court itself suggested solving this dispute.\n\nFor these reasons, we recall our request for the Court to exercise its right to decline rendering an advisory opinion.\n\nAvoiding unduly politicization and maintaining the existing negotiating frameworks are necessary to uphold the judicial character of the Court.\n\nAs for our third and final query, we refer to the already existing and accepted institutional architecture for maintaining international peace and security. In this institutional fabric, each actor has its own distinct role and responsibilities, as institutional guarantors of peace and security. Within this intricate system, it is the United Nations Security Council that has the primary responsibility for the maintenance of international peace and security according to the United Nations Charter. Should the Court decide to render an advisory opinion on this matter, this would — in our opinion — inevitably result in the unduly politicization of the esteemed institution of an otherwise strictly judicial character. This could threaten to undermine its ability to contribute to the maintenance of global peace and security. Additionally, such an opinion, irrespective of its content, would inevitably become part of an already heated political debate, particularly in the aftermath of the barbaric Hamas terrorist attacks conducted on 7 October 2023.\n\nFurthermore, when discussing the institutional backdrop to this conflict, it must be pointed out, that there is, in fact, an established framework for negotiations aimed at the political settlement of the conflict, emanating from the various United Nations Security Council resolutions, such as resolutions 242 and 338. Moreover, to this day, this established negotiation framework, built around the Oslo Accords, remains the recognized framework by both parties to the conflict.\n\nIt is crucial to also mention the involvement of other international mechanisms and actors in the resolution of the Israeli-Palestinian conflict, including the United Nations Special Coordinator for the Middle East Peace Process (UNSCO). The role of the Special Coordinator is important in facilitating dialogue and negotiations, promoting peace and coordinating international efforts towards a just, lasting and comprehensive resolution.\n\nTherefore, one must come to the conclusion that if we are to stay true to this very Court’s ruling issued in the Wall Advisory Opinion, what is needed today is not a new legal interpretation, but a renewed effort to restart peace negotiations, implementing in good faith all relevant existing United Nations Security Council resolutions."
    },
    {
        "voto": 0,
        "juez": "Hungary",
        "pregunta": "Israel is under an obligation to terminate its breaches of international law; it is under an obligation to cease forthwith the works of construction of the wall being built in the Occupied Palestinian Territory, including in and around East Jerusalem, to dismantle forthwith the structure therein situated, and to repeal or render ineffective forthwith all legislative and regulatory acts relating thereto, in accordance with paragraph 151 of this Opinion",
        "texto": "In discussing the Israeli-Palestinian conflict, one must reflect on the broader political context.\n\nHungary recalls that in 2004 this esteemed Court clearly stated in its Advisory Opinion concerning the Construction of a Wall case that the resolution of the Israeli-Palestinian conflict can only be achieved through direct negotiations between the parties, on the basis of international law and through the implementation of the relevant Security Council resolutions. Since 2004, this fundamental approach has not changed, although numerous aspects of the political context have shifted. As Hamas came to power in 2007, it rejected fundamental pillars of the existing political framework, in particular the Quartet principles, including Israel’s right to exist, as well as renouncing violence as a means of achieving goals, and adherence to previous agreements between the parties. This has significantly affected the existing peace initiatives and has induced intra-Palestinian divisions that have proven difficult to resolve over the years.\n\nWe must also note more recent developments that have yielded significant change in the broader political dynamics of the conflict. The Abraham Accords established in 2020 provided a novel approach that has allowed for the normalization of relations between Israel and a number of Arab countries. We believe that in a political sense the Abraham Accords represented an effort to create a more conducive environment for the negotiated settlement of the conflict. Moreover, it aimed to provide a solid foundation for enhancing regional peace, prosperity and stability.\n\nUnfortunately, the progress of these promising developments were imperilled by the horrendous terrorist attacks conducted against Israel by Hamas on 7 October 2023. What happened on 7 October was one of the worst terrorist attacks and sexual barbarism the world has seen in a hundred years. On that Saturday morning, innocent Israeli civilians were awakened by an unprecedented brutal terrorist attack, the launching of thousands of rockets, the torturing and killing of hundreds, among them babies, and Hamas taking more than 200 hostages. Hungary strongly condemns these horrific terrorist attacks and calls for the immediate and unconditional release of all hostages. These actions are not just an attack on a democratic country—they represent an assault on all democracies around the world. These actions are not just a clear violation of international law, they are also crimes against humanity. Israel has since been fighting the terrorist organization Hamas, with the aim to eradicate terrorists and to prevent such horrific terrorist attacks ever happening again. The evil of terrorists is well shown by the fact that they use innocent civilians, education and healthcare facilities as shields. Sparing the lives of both Israeli and Palestinian civilians is of the utmost importance—now, as well as in the future, in the interest of a sustainable peace, free of terror.\n\nWe welcome that the esteemed Court has recently called for immediate and unconditional release of the hostages held by Hamas and underlined that all parties to the conflict must abide by international humanitarian law and international human rights law. Upholding the rules is non-negotiable. Nonetheless, we must also note that the proceedings brought before this esteemed Court may directly contribute to the escalation of the conflict. We are of the view that both the present proceedings, as well as the proceedings against the State of Israel in Application of the Convention on the Prevention and Punishment of the Crime of Genocide in the Gaza Strip, may be considered as provocations in the ongoing conflict, not contributing to the de-escalation and an eventual settlement of the conflict. A potential utilization of the Court in the communication war could create newer dividing lines and could continue to fuel tensions in one of the most severe conflicts of recent history.\n\nBearing in mind this aforementioned broader context, let me now turn to addressing three main issues that Hungary considers important to highlight."
    }
]
