[
    {
        "voto": 1,
        "juez": "Iran",
        "pregunta": "Finds that it has jurisdiction to give the advisory opinion requested",
        "texto": "Mr President, first we submit that the Court has jurisdiction to render the advisory opinion requested by the General Assembly in resolution 77/247 of 30 December 2022. /n/nHere we believe that the elements of Article 65 (1) of the Statute of the Court, namely the existence of the “legal question” and the authorized “body”, i.e. the General Assembly, are fulfilled in this case. That said, the International Court of Justice, as the principal judicial organ of the United Nations can assist the General Assembly to exercise its functions under the United Nations Charter by rendering the advisory opinion requested. /n/nTherefore, just as the Court has established its jurisdiction in the advisory opinion on the Legal Consequences of the Construction of a Wall in the Occupied Palestinian Territory, it has jurisdiction in the present case based on the same grounds; moreover, there is no compelling reason for declining to give an advisory opinion."
    },
    {
        "voto": 1,
        "juez": "Iran",
        "pregunta": "Decides to comply with the request for an advisory opinion",
        "texto": ""
    },
    {
        "voto": 1,
        "juez": "Iran",
        "pregunta":"The construction of the wall being built by Israel, the occupying Power, in the Occupied Palestinian Territory, including in and around East Jerusalem, and its associated régime, are contrary to international law",
        "texto": "first, according to the United Nations Secretary-General, as a result of Israeli military operations, the entire population is enduring destruction at a scale and speed without parallel in recent history and 2.2 million Palestinians there are struggling to simply make it through another day without proper shelter, heating, sanitary facilities, food and drinking water; second, according to the United Nations Under-Secretary-General for Humanitarian Affairs, “for children in particular, there is no food, no water, no school; nothing but the terrifying sounds of war, day in and day out, and its people are witnessing daily threats to their very existence — while the world watches on”; and third, according to the WHO, the population in Gaza is facing extreme hunger, with insufficient food and high levels of malnutrition. Yet, the conditions in Gaza are becoming much worse every day. /n/nMr President, now I turn to the first section of our reasoning regarding the merits of the matter; here, we first argue that the Israeli occupying régime has violated, and continues to violate, on several grounds, the Palestinians’ right to self-determination. /n/nThe legal status of the right to self-determination is generally understood to be attributed to “peoples” and grounded first in the United Nations Charter, in several United Nations General Assembly resolutions and its inclusion in common Article 1 of the two International Covenants of Human Rights. As such, “all peoples have the right freely to determine, without external interference, their political status and their place in the international community and to pursue their economic, social and cultural development, and every State has the duty to respect this right in accordance with the provisions of the Charter”. /n/nFirst and foremost, the prolonged occupation by the Israeli occupying régime confirms its intention to make it permanent, in violation of the principle of prohibition of the acquisition of territory by force. /n/nThe occupation of the Palestinian territories is the longest military occupation existing today. The right to self-determination of the Palestinian people continues to be violated as long as this occupation ages; this ongoing violation thwarts the Palestinians’ ability to rely on State-based rights and obligations under international law, depriving them of their inalienable right to self-determination, including their right to live in freedom, justice and dignity. /n/nThus, we request the Court to consider the very fact of prolongation of the occupation as an indicator of the violation of the right of Palestinians to self-determination. /n/nMr President, apart from prolonged occupation, altering the demographic composition in the occupied territories has led to violation of the Palestinians’ right to self-determination. The United Nations Security Council has a bulk of resolutions concerning the occupation of Palestinian territories, all condemning, among others, altering the demographic composition of these territories by the Israeli occupying Power. Hence, it is a well-established fact that the Israeli occupying régime has grossly violated international law on an ongoing basis. Article 49 of the Fourth Geneva Convention reads: “The Occupying Power shall not deport or transfer parts of its own civilian population into the territory it occupies.” Apart from that, the Court, in its opinion in the Wall case declared that: “[the] provision prohibits not only deportations or forced transfers of population such as those carried out during the Second World War, but also any measures taken by an occupying Power in order to organize or encourage transfers of parts of its own population into the occupied territory”. /n/nFurthermore, the Court affirmed, in the same case, the violation of the right to self-determination based on measures taken by the occupying Power which has led to a change in the demographic composition of Palestine. /n/nMr President, Members of the Court, forcible deportation of civilian populations, widely known for one of its most infamous instances as “Nakba Day”, has a long history. Essentially, with the illegal formation of the Israeli occupying régime in 1948 instead of the former British Mandate of Palestine, the demographic composition changed significantly with the displacement of more than 700,000 Palestinians. In fact, the Israeli occupying régime was illegally established that year through a violent, arbitrary process and involved the deportation or forcible transfer of hundreds of thousands of native Palestinians from their land to create a majority Jewish colony, in line with the demands of the Zionist movement. /n/nBy denying the right to return of forcibly deported Palestinians to Palestine, the Israeli régime continues to deprive those Palestinians of their right to live in their homeland. The majority of Palestinians live outside Palestine mainly in Jordan, Syria and Lebanon, with many of them remaining stateless, living in crowded refugee camps that lack basic infrastructure. /n/nNeedless to say, forcible displacement of civilian population is of such a high significance that it has been defined as a war crime under Article 8 of the Statute of the International Criminal Court. /n/nMr President, the next measure that has violated the right of self-determination of Palestinians, is altering the character and status of the Holy City of Al-Quds. The actions taken by the Israeli occupying régime with regard to the Holy City of Al-Quds have utterly disregarded the right to self-determination of the Palestinian people. /n/nAltering the character and status of Al-Quds has had significant religious and cultural implications for the Palestinian people. Al-Quds Al-Sharif has a remarkable religious and historical significance for Palestinians, as well as for Muslims, Christians and Jews worldwide. By altering the status quo of the City and its holy sites, the Israeli occupying régime has undermined the cultural heritage and identity of the Palestinian people and has further violated their right to self-determination. /n/nThe construction and expansion of the settlements, along with the violation of Palestinians’ right to free movement and the revocation of residency permits, have altered the demographic and cultural character of the City as well. /n/nMr President, Members of the Court, the next series of measures depriving the Palestinian people of their right to self-determination comprise of discriminatory measures targeting the basic rights of the people in the occupied territories. This has been underlined by the United Nations General Assembly and recorded extensively to include the killing and injury of civilians, the forced displacement of civilians and a systematic policy of obstruction of humanitarian assistance. /n/nThe Israeli occupying régime’s action, as manifested in various laws and policies, has created a system of discrimination that has negatively affected the Palestinian population. In Palestine, the occupying régime’s expansionism has consolidated into apartheid through the longest occupation in modern history. It is well established that apartheid is a crime against conscience and dignity of mankind, and is further in violation of fundamental principles of international law enshrined in the United Nations Charter and crystalized in international human rights law, and seriously threatens international peace and security. /n/nThe Special Rapporteur on the situation of human rights in Palestine has concluded that the political system of entrenched rule in occupied Palestine, which endows one racial-national-ethnic group with substantial rights, benefits and privileges while intentionally subjecting another group to live behind walls and checkpoints under a permanent military rule, satisfies the prevailing evidentiary standard for the existence of apartheid. Many laws, policies and practices implemented since 1948 by the Israeli occupying régime have been aimed at fragmenting the Palestinian people and dividing them into various groups; this clearly denies the Palestinian people its right to self-determination. /n/nIn tandem with the above, construction and expansion of the settlements, segregated roads, barriers and checkpoints has created a system of apartheid, effectively isolating Palestinian communities, which manifestly violates multiple provisions of the Convention on the Elimination of All Forms of Racial Discrimination. /n/nThe Court is, therefore, requested to opine that such policies and practices must be ceased immediately as they continue to violate the right of self-determination of the Palestinian people. /n/nMr President, Members of the Court, the right to exercise permanent sovereignty over natural resources is an inevitable component of the right to self-determination. The two international covenants of human rights and a number of United Nations General Assembly resolutions recognize this right. The United Nations General Assembly has expressed grave concern over a range of practices by the Israeli occupying régime negatively impacting Palestinians’ natural resources. /n/nIt has been affirmed that the right of the Palestinian people to permanent sovereignty over their natural wealth and resources is an integral component of the right to self-determination. It has been further confirmed that the right should be used in the interest of their national development, the well-being of the Palestinian people and as part of their right to self-determination. /n/nYet, Palestinians do not enjoy their own natural resources, which include land, fresh water and mineral resources. Imposing restrictions, by the Israeli régime, on access of Palestinians to water resources, groundwater and hydrocarbon deposits are all instances of flagrant violation of the right to self-determination."
    },
    {
        "voto": 1,
        "juez": "Iran",
        "pregunta": "All States are under an obligation not to recognize the illegal situation resulting from the construction of the wall and not to render aid or assistance in maintaining the situation created by such construction; all States parties to the Fourth Geneva Convention relative to the Protection of Civilian Persons in Time of War of 12 August 1949 have in addition the obligation, while respecting the United Nations Charter and international law, to ensure compliance by Israel with international humanitarian law as embodied in that Convention",
        "texto": "Mr President, Members of the Court, this Court has, in several cases, in particular in the Wall case, identified the obligation to respect the right of self-determination having an erga omnes character as “one of the essential principles of contemporary international law”. /n/nAs a general rule, where erga omnes obligations of international law are breached, third States have mainly three obligations: firstly, “non-assistance”; secondly, “non-recognition”; and lastly, “cooperation to bring to an end such a violation”. In this context, an “interested” or “third” State, in accordance with the jurisprudence of the International Court of Justice, could be defined as one which is not directly affected or injured by an internationally wrongful act, and which has yet a legal interest in the protection and compliance of the rights by the very reason “of the importance of the rights involved . . . and their very nature” which makes them “the concern of all States”. /n/nAs regards the primary obligations of third States towards prolonged occupation of Palestine, the three obligations mentioned above remain relevant in accordance with paragraph 146 of the 2004 Advisory Opinion in the Wall case. /n/nIn addition to the jurisprudence of the International Court of Justice, the primary triple obligations of third States towards serious breaches of erga omnes obligations find support in the practice of other United Nations organs as well. In its resolution 2334, the United Nations Security Council unequivocally reiterated the importance of States abstaining from recognizing the occupying Power’s internationally wrongful acts. /n/nThe International Law Commission, in Draft Article 41 (1) of its 2001 Draft Articles on Responsibility of States for Internationally Wrongful Acts, along with underlining the duty of a State to not recognize as lawful a situation created by a serious breach of erga omnes rules, and not to render aid or assistance in maintaining that situation, emphasized the duty of all States to co-operate through lawful means, in a joint and co-ordinated effort, to counteract the effects of these breaches. /n/nFirst, not to aid or assist, directly or indirectly, the Israeli occupying régime enabling it to continue its prolonged occupation of Palestine and/or any of its continued policies and practices that violate the right to self-determination of the Palestinian people; this may include in particular avoiding any kind of political, military, economic or other co-operation with the Israeli régime enabling it to continue such violations. Second, not to recognize the illegal situation resulting from prolonged occupation, by the Israeli occupying régime, of Palestinian territory and/or any of its continued measures that violate the right to self-determination of the Palestinian people; and Third, to co-operate effectively with one another in all relevant fields and forums to bring to an end any impediment resulting from the ongoing violation by the Israeli occupying régime of the right of the Palestinian people to self-determination, including from its prolonged occupation, and any of its measures aimed at altering the demographic composition, character and status of the Holy City of Al-Quds; obviously, such co-operation is of utmost urgency and importance given the ongoing situation in the Gaza Strip, where, according to one estimate, Israel’s military is killing Palestinians at an average rate of 250 people a day, which exceeds the daily death toll of any other major conflict of recent years. /n/nIn this context, I recall this honourable Court’s important Order of 26 January 2024 on the request by South Africa for the indication of provisional measures. The Order concerns the application of the Convention on the Prevention and Punishment of the Crime of Genocide and, as such, all States, in particular those providing support to Israel, are legally under the duty to prevent genocide, particularly by ceasing to provide any aid to the genocider. They are under a duty to punish perpetrators of the crime of genocide. Given the current extremely tragic conditions in the Gaza Strip, the Court is respectfully requested to, once again, call on the occupying régime to fully comply with the Order. Evidently, in practical terms, even the partial compliance of the Israeli régime with only subparagraph 1 of paragraph 86 of that Order is possible only through complete termination of all its military operations in the Gaza Strip."
    },
    {
        "voto": 1,
        "juez": "Iran",
        "pregunta": "The United Nations, and especially the General Assembly and the Security Council, should consider what further action is required to bring to an end the illegal situation resulting from the construction of the wall and the associated régime, taking due account of the present Advisory Opinion",
        "texto": "Mr President, I would like to recall the primary responsibility of the Security Council for the maintenance of international peace and security under Article 24 of the United Nations Charter. I submit that the inaction or insufficient action of the Security Council, if not the main, is one of the main causes of the prolonged occupation of the Palestinian territories. All the atrocities and crimes committed by the Israeli régime in the past almost 80 years are a consequence of such inaction. Even today, the Security Council is paralysed due to the stalemate caused by a certain permanent Member. Other relevant United Nations bodies have also the responsibility to monitor and document human rights violations, and to facilitate bringing the perpetrators to justice. /n/nThis fact alone underscores how essential it is for the Court to remind the Security Council of its Charter-based obligation. It must also be made clear that such an obligation cannot be fulfilled by convening meetings or issuing certain impotent procedural resolutions; rather, it needs conclusive decisions under Chapter VII of the United Nations Charter and a follow-up mechanism to ensure its full and prompt implementation by the Israeli régime."
    }
]