[
    {
        "voto": 1,
        "juez": "Iraq",
        "pregunta": "Finds that it has jurisdiction to give the advisory opinion requested",
        "texto": "Mr President, Members of the Court, Iraq believes that the Court has the jurisdiction to issue the advisory opinion, as the request for the opinion is submitted by the United Nations General Assembly, an authorized body to seek advisory opinions under paragraph 1 of Article 96 of the United Nations Charter. The subject-matter of the advisory opinion falls within the competence of the General Assembly of the United Nations, given that Article 10 of the Charter grants the General Assembly authority regarding “any questions or any matters” falling within the scope of the Charter. Moreover, paragraph 2 of Article 11 specifically grants the General Assembly jurisdiction concerning “any matter relating to the maintenance of international peace and security”."
    },
    {
        "voto": 1,
        "juez": "Iraq",
        "pregunta": "Decides to comply with the request for an advisory opinion",
        "texto": "Mr President, Members of the Court, we would like to bring to the attention of your distinguished Court the decision of the United Nations General Assembly, resolution 77/247, adopted during its 56th session on 30 December 2022, under agenda item 47, pursuant to Article 96 of the United Nations Charter and in accordance with Article 65 of the Statute of the International Court of Justice. The General Assembly has decided to request an advisory opinion from your esteemed Court on the matters referred to in paragraph 18 of the aforementioned resolution. /n/nThe request for the advisory opinion is related to a legal issue, as paragraph 18 of the United Nations General Assembly resolution 77/247  which has been adopted correctly in procedural terms  signifies. We trust and hope in the justice of the Court, anticipating it to not see compelling reasons for the Court to use its discretion to refrain from issuing an advisory opinion."
    },
    {
        "voto": 1,
        "juez": "Iraq",
        "pregunta":"The construction of the wall being built by Israel, the occupying Power, in the Occupied Palestinian Territory, including in and around East Jerusalem, and its associated régime, are contrary to international law",
        "texto": "Mr President, recalling today your distinguished Court Order, dated 26 January 2024, on the application of the Convention on the Prevention and Punishment of the Crime of Genocide in the Gaza Strip (South Africa vs Israeli occupying entity), we are convinced that the Court’s orders under Article 41 of the Statute of the Court are of binding effect under Article 94 of the Charter of the United Nations, and we call for the respect of and compliance with these decisions under any circumstance or in any place in order to stop the systematic killing machine against the Palestinian people. /n/nMr President, Members of the Court, international human rights law and international humanitarian law apply to the occupied Palestinian territories and the Israeli occupying entity has the responsibility to fulfil its obligations with regard to the convention to which it has acceded, including the Convention on the Elimination of All Forms of Racial Discrimination, the International Covenant on Civil and Political Rights, the International Covenant on Economic, Social and Cultural Rights, the Convention on the Rights of the Child, the Convention on the Elimination of All Forms of Discrimination against Women and the Convention on the Rights of Persons with Disabilities. /n/nThe Israeli occupying entity is also obliged to do so on the basis of the four Geneva Conventions (Annual Report of the Secretary-General submitted to the Human Rights Council at its 34th session on 27 February 2017, pursuant to Human Rights Council resolution 31/34 on the human rights situation in the occupied Palestinian territories, emphasizing the continuous and chronic nature of human rights violations leading to these patterns of violations). /n/nIn this regard, we would like to emphasize that the Israeli occupying entity exercises regional jurisdiction over the occupied Palestinian territories as an occupying entity. Therefore, we call for and emphasize the necessity of compliance with the rules of international law and the decisions issued by your esteemed Court. We specifically refer to the Advisory Opinion issued by your esteemed Court regarding the legal consequences of the construction of the wall in the occupied Palestinian territories in the year 2004. /n/nMr President, Members of the Court, the Israeli occupying entity commits many violations and breaches of the principles of international law, and the international community has documented these violations, including those substantiated in reports by the Secretary-General of the United Nations submitted to the General Assembly or the Human Rights Council. These reports focus on investigating Israeli practices that impact the human rights of the Palestinian people and other Arab inhabitants in the occupied territories, examining the human rights situation in the occupied Palestinian territories. /n/nThe Israeli occupying entity adopts multiple practices that rise to the level of genocide, referring specifically to the Convention on the Prevention and Punishment of the Crime of Genocide of 1948, in particular, under Article II of the convention, which defines acts classified as genocide, the killing practices that have targeted civilians in residential areas, hospitals, schools and refugee shelters in Palestine in general, and in the Gaza Strip in particular, fall under the provisions of paragraphs (a), (b) and (c) of that Article. Additionally, the Fourth Geneva Convention relative to the Protection of Civilian Persons in Time of War of 1949, under Articles 146, 147 and 148, stipulates the imposition of criminal sanctions on parties to the convention in case of non-compliance with its provisions. /n/nThe oppressive practices affecting the city of Al-Quds, the capital of the Palestinian State, as well as the Holy Al-Aqsa Mosque, as the occupying entity attempts to impose a demographic reality aimed at a subsequent stage, which involves emptying the city of its original inhabitants and settling extremists and racists in it. This constitutes a violation of numerous resolutions, the latest being the United Nations General Assembly decision adopted on 21 December 2017. This decision came after a series of resolutions emphasizing the necessity of not to prejudice the demographic character of the Holy City of Al-Quds. /n/nImposing a suffocating economic blockade on all industrial, agricultural and commercial activities is evident in campaigns of land confiscation and seizure of homes and private property, supported by an official policy aimed at displacing the indigenous Palestinian population from their lands and demolishing their homes. These practices fall within the scope of crimes that amount to the destruction of an entire people. These actions have been documented by multiple reports, including those of the Secretary-General, the Human Rights Council and international organizations, particularly the United Nations Relief and Works Agency for Palestine Refugees in the Near East (UNRWA). /n/nThe continuous aggression on the Gaza Strip and the imposition of a land, sea and air blockade, along with a series of decisions, policies and procedures that target civilians, with the aim of changing the demographic reality on the ground, represent a flagrant violation of international law and human rights principles. The occupying entity has undertaken systematic measures, including mass arrests, demolition of homes, killing civilians, children, women, and the elderly. The right of the Palestinian people to their land has been subjected to a policy of deprivation and subjugation by force."
    },
    {
        "voto": 1,
        "juez": "Iraq",
        "pregunta": "Israel is under an obligation to terminate its breaches of international law; it is under an obligation to cease forthwith the works of construction of the wall being built in the Occupied Palestinian Territory, including in and around East Jerusalem, to dismantle forthwith the structure therein situated, and to repeal or render ineffective forthwith all legislative and regulatory acts relating thereto, in accordance with paragraph 151 of this Opinion",
        "texto": "Mr President, Members of the Court, we would like to bring to the attention of your distinguished Court the decision of the United Nations General Assembly, resolution 77/247, adopted during its 56th session on 30 December 2022, under agenda item 47, pursuant to Article 96 of the United Nations Charter and in accordance with Article 65 of the Statute of the International Court of Justice. The General Assembly has decided to request an advisory opinion from your esteemed Court on the matters referred to in paragraph 18 of the aforementioned resolution. /n/nThe request for the advisory opinion is related to a legal issue, as paragraph 18 of the United Nations General Assembly resolution 77/247  which has been adopted correctly in procedural terms  signifies. We trust and hope in the justice of the Court, anticipating it to not see compelling reasons for the Court to use its discretion to refrain from issuing an advisory opinion."
    }
]