[
    {
        "voto": 1,
        "juez": "Ireland",
        "pregunta": "Finds that it has jurisdiction to give the advisory opinion requested",
        "texto": "On the threshold question of jurisdiction, Ireland’s view is that the questions put to the Court are legal questions within the meaning of Article 96 (1) of the Charter of the United Nations. Further, the request for an advisory opinion is, in our view, within the competence of the General Assembly. Finally, and as the Court has itself previously acknowledged, the fact that a legal question may have a political dimension does not oust the Court’s jurisdiction. /n/nSeveral States have suggested that this request for an advisory opinion is an attempt to resolve a bilateral dispute without the consent of one of the parties to that dispute. We very much regret that Israel has chosen not to engage with the subject-matter of the request in our discussions with the Israeli Government, we encouraged it to participate in these oral hearings so that the Court could have the benefit of its perspective. However, in our view, the issue of the Occupied Palestinian Territory is directly of concern to the United Nations itself and it goes much further than a mere bilateral dispute. As this Court noted in its Advisory Opinion on the Interpretation of Peace Treaties with Bulgaria, Hungary and Romania, even where a request for an advisory opinion relates to a legal question actually pending between States, its opinion is given not to the States but to the organ requesting it, in this case the General Assembly. /n/nIt has also been suggested that this Court ought not to opine because the questions are one- sided in nature. However, it is well established that the Court may interpret or even reformulate a question if it is not adequately formulated, or where the question does not reflect the “legal questions really in issue”. Similarly, where a question is vague or ambiguous, the Court may clarify it before providing its opinion."
    },
    {
        "voto": 1,
        "juez": "Ireland",
        "pregunta": "Decides to comply with the request for an advisory opinion",
        "texto": "Moreover, while it is well established that the Court enjoys a discretionary power not to provide an advisory opinion, it should only so decline for compelling reasons, which has never happened before, and in Ireland’s view, should not happen now. /n/nA further argument advanced by some is that the Court should narrow the question to a request for advice regarding the role of the General Assembly in promoting a resolution to the conflict within the established negotiating framework. However, the Court has previously rejected a similar submission, holding that “it is not for the Court itself to purport to decide whether or not an advisory opinion is needed by the Assembly for the performance of its functions. The General Assembly has the right to decide for itself on the usefulness of an opinion in the light of its own needs.” /n/nWe do not agree therefore that a ruling by this Court would undermine the established negotiating framework. On the contrary, this Court’s authoritative clarification of the important legal issues raised would provide the essential foundation upon which to build a lasting, comprehensive and just resolution of the Israeli-Palestinian conflict."
    },
    {
        "voto": 1,
        "juez": "Ireland",
        "pregunta":"The construction of the wall being built by Israel, the occupying Power, in the Occupied Palestinian Territory, including in and around East Jerusalem, and its associated régime, are contrary to international law",
        "texto": "Mr President, Israel has been in occupation of the Palestinian Territory since 1967. Accordingly, in that territory, it is obliged to respect applicable international humanitarian law, including the law of military occupation, and international human rights law. /n/nThe defining feature of Israel’s occupation of Palestinian territory in the West Bank, including East Jerusalem, has been continuous settlement activity. In our Written Statement, we have drawn on the authoritative reports of the Secretary-General and the High Commissioner for Human Rights, to set out the numerous different ways in which this has occurred. But in summary, we say the following: /n/nIsrael has used different means to take and exercise control for non-military purposes over as much land in the Occupied Palestinian Territory as possible. /n/nOnce in control, Israel has undertaken permanent construction on this land, in particular developing or encouraging the development of permanent settlements, onto which it has incentivized large numbers of its own citizens to transfer. /n/nThrough its actions, Israel has fundamentally altered the demographics of the West Bank. As of 2022, almost 700,000 Israeli citizens were living in settlements in the West Bank, including in East Jerusalem. /n/nIsrael has extended the application of domestic Israeli law to those living in settlements, blurring the distinction between Israel and the Occupied Palestinian Territory /n/nIsrael has transferred the exercise of authority in the Occupied Palestinian Territory in certain areas from military command to civilian control, integrating administration of the territory into that of Israel. /n/nBy transferring parts of its own civilian population into the Occupied Palestinian Territory, Israel has violated Article 49 (6) of the Fourth Geneva Convention. It has continued to do this notwithstanding the Court’s confirmation of its unlawfulness in the Wall case and despite being exhorted by both the Security Council and the General Assembly to cease this practice. /n/nIsrael has also continued to unlawfully destroy and appropriate property throughout the Occupied Palestinian Territory as part of its policy of encouraging and facilitating the expansion of settlements. This destruction and appropriation of property cannot reasonably be justified by military necessity. Rather, it is clear that it has been done to facilitate and indeed encourage the expansion of settlements. Such destruction and appropriation of property clearly breaches the Fourth Geneva Convention and the laws and customs of war codified by the 1907 Hague Regulations. /n/nThere has also been a recent, marked increase in reports of Palestinian civilians being subjected to sustained, serious violence by Israeli settlers, with little or no protection from the Israeli security forces, contrary to international humanitarian law. The security forces have been reported, and recorded, not only watching this violence without intervening, but in some instances, even participating in it themselves. This has escalated since 7 October and the Secretary-General has warned that tensions have now reached “boiling point”. /n/nThe Secretary-General and High Commissioner have expressed concern that this violence, particularly when considered in light of the appropriation and destruction of Palestinian property, has compelled Palestinians to leave their homes, their farms and their grazing grounds. The Secretary-General has noted that the coercive environment created by Israel could amount to forcible transfer, a grave breach of the Fourth Geneva Convention which may amount to a war crime. /n/nThe evident permanence of the settlements can only be explained, in Ireland’s assessment, by Israel’s intention of annexing the land upon which they are built. In our view, the development and expansion of settlements clearly demonstrate that Israel is and has been engaged in a process of annexation of that land for decades. The absence of any declaration of annexation or formal de jure act of incorporation over most of the West Bank is immaterial. Despite references in the current Israeli Government’s coalition agreements, which the Secretary-General describes as promoting a policy of “application of sovereignty” over the West Bank, previous history suggests that no announcement or formal act of incorporation may occur in the near future. /n/nNevertheless, in Ireland’s view, Israel is already engaged in the process of annexing Palestinian territory. It is doing so de facto, through its policy of encouraging demographic change in that territory by population transfer and by the continuous development and maintenance of permanent settlements and infrastructure. Ireland is concerned that it may also be doing so de jure, by increasingly extending the application of domestic Israeli law and civilian administration to the settlements in the Occupied Palestinian Territory, thereby integrating them into its own territory and erasing the differences in law between Israel and the settlements. /n/nBut whether de facto, de jure or both, this process of annexation is in clear breach of the prohibition in international law against the acquisition of territory by threat or use of force, a fundamental principle of international law. To assert that this is not the case simply because Israel has not formally declared annexation would render the prohibition devoid of all meaning. That would permit States to acquire territory by force, without legal consequence, simply by declining to adopt a formal act of annexation or incorporation. /n/nInternational humanitarian law does not classify a military occupation as either lawful or unlawful per se rather it recognizes that military occupation may occur during the course of an armed conflict and it sets down rules to regulate the conduct of the occupying Power, in particular its armed forces. Military occupation is necessarily temporary in so far as international law prohibits the acquisition of territory by force. Occupation does not confer sovereignty rather, it is a temporary exception to sovereignty and, accordingly, it cannot be of indefinite duration. /n/nProlonged occupation over an extended period of time therefore unavoidably raises legal questions, in particular whether it constitutes a disguised form of annexation and/or a determined effort to deny the people of an occupied territory the exercise of their right to self-determination. In either case, the legality of the occupying Power’s presence in the territory inevitably arises. While it is of course possible that a military occupation effected by force may be undertaken in exercise of the right in international law to the use of force in self-defence, any such occupation may involve no more and may endure no longer than is necessary and proportionate to the armed attack to which it is a response. /n/nIn the case of the Occupied Palestinian Territory, Israel’s military occupation commenced in 1967 and has continued now, uninterrupted, for some 57 years. It has also entailed, as I have said, extensive and continuous, permanent and deliberate settlement building. Neither the duration of the occupation nor the scale and extent of settlement activity is, in Ireland’s view, justified or permitted by the law regulating the use of force in self-defence. Indeed, if the security of one people can only be achieved by the occupation over so many decades of the territory of another people, one has to wonder whether there can be any military solution to the problem that it purports to address. In our view, the only effective solution to the problem can be a political one. /n/nMr President, I wish to turn now to the question of self-determination. As submitted in our Written Statement, Ireland has concluded that by its prolonged occupation of Palestinian lands and continuous settlement activity on those lands, Israel has prevented the exercise by the Palestinian people of their right to self-determination. The principle of self-determination is a fundamental principle of international law, enshrined in the Charter of the United Nations and the two 1966 International Covenants on Civil and Political Rights and on Economic, Social and Cultural Rights. The content of that principle was elaborated in the 1970 Declaration on Friendly Relations, adopted by consensus at the General Assembly. That declaration makes clear that “Every State has the duty to promote, through joint and separate action, realization of the principle of equal rights and self-determination of peoples bearing in mind that subjection of peoples to alien subjugation, domination and exploitation constitutes a violation of the principle, as well as a denial of fundamental human rights, and is contrary to the Charter”. /n/nIn the Wall case, the Court found that the construction of the wall and its associated régime severely impeded the exercise by the Palestinian people of their right to self-determination. It therefore breached Israel’s obligation to respect that right. In Ireland’s view, the combination of Israel’s prolonged occupation of the Occupied Palestinian Territory and its escalating settlement activity has done so on a far greater scale. That escalating activity has increasingly fragmented Palestinian presence upon and restricted Palestinian use of the land and the natural resources of the Palestinian people. It threatens the viability of a future Palestinian State. The nature, scale and duration of settlement activity is such that its purpose can only be to permanently obstruct the exercise of the Palestinian people’s right to self-determination. /n/nIreland has, with regret, concluded that by its prolonged occupation of Palestinian territory and the settlement activities it has conducted there for more than half a century, Israel has committed serious breaches of a number of peremptory norms of general international law and the corresponding erga omnes obligations to which they give rise, namely: /n/nthe basic rules of international humanitarian law; the right to self-determination of the Palestinian people; and the prohibition of acquisition of territory by force."
    },
    {
        "voto": 1,
        "juez": "Ireland",
        "pregunta": "Israel is under an obligation to terminate its breaches of international law; it is under an obligation to cease forthwith the works of construction of the wall being built in the Occupied Palestinian Territory, including in and around East Jerusalem, to dismantle forthwith the structure therein situated, and to repeal or render ineffective forthwith all legislative and regulatory acts relating thereto, in accordance with paragraph 151 of this Opinion",
        "texto": "The Declaration solemnly proclaims that “(e)very State has the duty to refrain from any forcible action which deprives peoples in the elaboration of the present principle of their right to self-determination and freedom and independence”. /n/nIn the Wall case, the Court found that Israel was obliged to end the breaches of its legal obligations, including those under international humanitarian law, and its duty to respect the right of the Palestinian people to self-determination, and to make reparation for the damage caused by those breaches."
    },
    {
        "voto": 1,
        "juez": "Ireland",
        "pregunta": "Israel is under an obligation to make reparation for al1 damage caused by the construction of the wall in the Occupied Palestinian Territory,including in and around East Jerusalem",
        "texto": "Under the customary international law of State responsibility, where a State breaches an international obligation it commits an internationally wrongful act. Unless its wrongfulness is otherwise precluded, that act entails the international responsibility of the State concerned and it involves legal consequences. Where the act amounts to a serious breach of both a peremptory norm and a corresponding obligation erga omnes, this Court has concluded that it involves legal consequences for all States, namely: /n/nfirst, the “obligation not to recognize the illegal situation resulting from” the serious breach; /n/nsecond, the “obligation not to render aid or assistance in maintaining the situation created by” the serious breach;/n/nthird, the obligation to co-operate to bring the serious breach to an end, or as the Court put it in the specific circumstances of the Wall case, “to see to it that any impediment, resulting from the construction of the wall, to the exercise by the Palestinian people of their right to self-determination is brought to an end”."
    },
    {
        "voto": 1,
        "juez": "Ireland",
        "pregunta": "All States are under an obligation not to recognize the illegal situation resulting from the construction of the wall and not to render aid or assistance in maintaining the situation created by such construction; all States parties to the Fourth Geneva Convention relative to the Protection of Civilian Persons in Time of War of 12 August 1949 have in addition the obligation, while respecting the United Nations Charter and international law, to ensure compliance by Israel with international humanitarian law as embodied in that Convention",
        "texto": "Both the prohibition of acquisition of territory by threat or use of force and the principle of self-determination are fundamental principles of international law, as are the basic rules of international humanitarian law. It is widely recognized that these fundamental principles have the charactery of peremptory norms of general international law, or jus cogens, from which derogation is never permitted or, as the Court described them in its Advisory Opinion on the Threat or Use of Nuclear Weapons, “intransgressible principles of international customary law”. In turn, peremptory norms of general international law give right to obligations owed to the international community as a whole (obligations erga omnes), in relation to which all States have a legal interest, a conclusion also recently reached by the International Law Commission. /n/nFor all States, as members of the international community as a whole to which the relevant obligations erga omnes are owed, the legal consequences of these serious breaches are, in Ireland’s view, straightforward. All States are obliged to co-operate to bring these breaches to an end through lawful means, not to recognize as lawful the situation created by them and not to render aid or assistance in maintaining that situation. /n/nIn particular, States are obliged to co-operate to bring to an end Israel’s serious breach of its obligation to respect the right of the Palestinian people to self-determination or, as the Court found in the Wall case, to see to it that any impediment to the exercise of that right is brought to an end. This includes co-operation by States through the United Nations and, as appropriate, other international organizations, including the European Union. /n/nAs regards the obligation not to recognize as lawful the situation created by these serious breaches, the Court has provided an example of how this may be achieved in its Advisory Opinion on the Legal Consequences for States of the Continued Presence of South Africa in Namibia. There, the Court found that the duty of non-recognition obliged States, inter alia, “to abstain from entering into economic and other forms of relationship or dealings with South Africa which may entrench its authority over the territory of Namibia”. /n/nIn the present case, we say that States are obliged not to render aid or assistance in maintaining the situation created by Israel’s breach of its obligation to respect the right of the Palestinian people to self-determination. The General Assembly and Security Council have, in the past, called upon all States to refrain from rendering any assistance to the maintenance of situations of denial of self-determination. /n/nIn Ireland’s view, these obligations require all States, as well as international organizations with external trade competence (in the case of Ireland, the European Union), to review their trading relationships with the settlements in the Occupied Palestinian Territory. It requires them to take steps to prevent trade that assists in the maintenance of the situation created by the settlement activity, or that implicitly recognizes or serves to entrench or legitimize Israel’s settlement or annexation of that territory."
    },
    {
        "voto": 1,
        "juez": "Ireland",
        "pregunta": "The United Nations, and especially the General Assembly and the Security Council, should consider what further action is required to bring to an end the illegal situation resulting from the construction of the wall and the associated régime, taking due account of the present Advisory Opinion",
        "texto": "This was also the approach taken by the European Union in the case of the annexation by the Russian Federation of Crimea in 2014, when it implemented a broad range of diplomatic, economic and other measures intended to preclude any implied recognition of the annexation. Those measures included a ban on imports of goods originating in the annexed territory and a prohibition against investing in it."
    }
]