[
    {
        "voto": 0,
        "juez": "Japan",
        "pregunta":"The construction of the wall being built by Israel, the occupying Power, in the Occupied Palestinian Territory, including in and around East Jerusalem, and its associated régime, are contrary to international law",
        "texto": "Now, in the following oral submissions, Japan wishes to focus exclusively on the issues relating to the acquisition of territory by force in so far as they are relevant to the questions put to the Court by the General Assembly. Japan considers that the prohibition of the acquisition of territory by force is an essential element of the rule of law among nations to which Japan is profoundly attached, and of particular importance to the peace and stability in the region and the international community. Japan believes that this prohibition provides an important safeguard for the international community against the return of rule by force. /n/nUnited Nations General Assembly resolution 2625 (XXV), which is commonly called “the Friendly Relations Declaration”, states that “[n]o territorial acquisition resulting from the threat or use of force shall be recognized as legal”. The Court clarified in the Wall Advisory Opinion that the illegality of the acquisition of territory by force is a corollary of the prohibition of use of force incorporated in the Charter of the United Nations. In the same vein, on 18 April 2023, G7 Foreign Ministers, under the Japanese presidency, reaffirmed this prohibition. The relevant paragraph of the Communiqué stated: “The prohibition on the acquisition of territory resulting from the threat or use of force, reaffirmed in the Friendly Relations Declaration of 1970, should be observed in good faith.”79 /n/nMr President, let me begin with the first point that Japan wishes to make. The prohibition of territorial acquisition by force does not apply only to territory of States within settled or internationally recognized borders. Even in the cases of territory where internationally recognized borders do not exist, that prohibition extends to territory that is under the peaceful administration and could also apply to uses of force across international lines of demarcation. /n/nThe paragraph of the Friendly Relations Declaration relating to the principle of non- acquisition of territory by force states that “the territory of a State shall not be the object of acquisition by another State”. It is not surprising to find the focus on attempts by States to acquire territory of another State. As an example, in October 2022, the United Nations General Assembly condemned the attempted illegal annexation of four regions of Ukraine80. In that situation, the prohibition of acquisition of territory by force clearly applies to those territories as they are within the internationally recognized borders of Ukraine. /n/nHowever, the Friendly Relations Declaration seems to go further than acknowledging the prohibition of the acquisition of the territories within the internationally recognized borders of States by force. In the same paragraph, it proclaims that “[n]o territorial acquisition resulting from the threat or use of force shall be recognized as legal”, without reference to “the territory of a State”. /n/nJapan takes the position that where sovereignty over a territory is not internationally recognized, but where the territory is under peaceful administration by a State that has not itself occupied the territory by force, the prohibition of acquisition of territory by force applies also. This principle follows from the reasoning adopted in the decision of the Eritrea-Ethiopia Claims Commission81. As this Court has recognized in the Wall Advisory Opinion, the prohibition of territorial acquisition by force follows from the prohibition of force. Therefore, the scope of the prohibition should be determined with reference to the interpretation of Article 2, paragraph 4, of the United Nations Charter. The Eritrea-Ethiopia Claims Commission found that Eritrea violated Article 2, paragraph 4, of the United Nations Charter by attacking and occupying in 1998 the town of Badme, which the Commission found was under “peaceful administration” by Ethiopia at the time. In this regard, the G7 Foreign Ministers’ Communiqué in April 2023 also stated: “We strongly oppose any unilateral attempts to change the peacefully established status of territories by force or coercion anywhere in the world.” /n/nFurthermore, the Friendly Relations Declaration states that “[e]very State likewise has the duty to refrain from the threat or use of force to violate international lines of demarcation, such as armistice lines, established by or pursuant to an international agreement to which it is a party or which it is otherwise bound to respect”. This declaration indicates that the prohibition of acquisition of territory by force could also apply to a territory where internationally recognized borders do not exist but where parties are bound to respect certain international lines of demarcation. /n/nMr President, the acquisition of territory by force consists of two elements, namely (i) the establishment of control over the territory through forcible measures and (ii) the intention to appropriate that territory permanently82. By “acquisition” or indeed “annexation” of territory by force, we mean a situation where a State attempts to acquire territorial title on the basis of forcible acts and where the State does not otherwise have valid title to that territory. /n/nThe clearest case of annexation is an attempt to annex occupied territory de jure. In such a circumstance, the occupying State formally declares its sovereignty over the annexed territory. /n/nHowever, in the Wall Advisory Opinion, this Court indicated that annexation could also take place de facto where the actions of a State lead to what the Court called a “fait accompli”, that is, a situation on the ground which becomes permanent and which others are compelled to accept83. A State seeking to avoid the denunciation of the international community may be incentivized to refrain from formally declaring the annexation of territory. Without clearly expressing its intention to annex the territory, it may seek to gain permanent control over a territory it occupies by engaging in military operations and taking a series of measures that make it materially impossible for other claimants to restore the status quo ante without risking death, physical injury or damage to property. In other words, the occupying State may create what you called a “fait accompli” through these measures. /n/nThe effect of the prohibition of acquisition of territory by force would be seriously undermined if States were allowed to circumvent the prohibition by simply obfuscating their true intentions to annex a territory and coercing other claimants to accept its permanent control over the territory through measures that create a “fait accompli”. It is therefore important to clarify in what circumstances such measures would constitute de facto annexation and amount to an unlawful attempt to acquire territory by force. /n/nIn the Wall Advisory Opinion, the Court considered that Israel’s construction of a wall in the Occupied Palestinian Territory as well as the creation of an administrative régime facilitating the establishment of settlements of Israeli citizens in areas lying between the Green Line and the wall are the types of actions which would be tantamount to de facto annexation if it created a “fait accompli” that had effectively become permanent84. /n/nJapan considers that certain acts which have continuous coercive effect in imposing control over territory may create a “fait accompli” and are likely to indicate intention to maintain permanent control over the territory. The following acts by occupying States may have such continuous coercive effects: /n/nFirst, large-scale alteration of the demographic composition of the territory, backed by military and other physical power, including through expropriation of land and eviction of the population. /n/nSecond, the construction and continued maintenance by an occupying Power of a network of physical infrastructure, particularly where these represent such significant financial investment that they may be deemed to be intended to subsist over a significant period of time. This may include, for example, roads, communication systems, healthcare facilities or large-scale military or law enforcement facilities. /n/nThird, the continuous forcible seizure and exploitation of the natural resources, including water, by an occupying Power. /n/nThese acts do not necessarily cause death, injury or destruction, but when they are implemented cumulatively at a significant scale and sustained for a long period, they would have continuous, even irreversible, effect on the territory. In such a case there may be evidence that the occupying State’s intention is to permanently establish sovereignty over the relevant area, even if it is doing so incrementally. If such acts are accompanied by statements of State officials affirming the irreversibility of measures or even asserting the intent to establish sovereignty over the occupied territories, the measures I have just mentioned above are even more likely to indicate intention to acquire territory and thus amount to a prohibited attempt to acquire territory by force. /n/nThe key question here is whether a State that does not otherwise have valid title to territory can acquire title through a use of force because the State claims to be acting in self-defence. Japan rejects this argument. Two alternative but interlinked arguments support this position. The first is that the principle prohibiting acquisition of territory by force precludes any acquisition of territorial title through force, regardless of whether that force is unlawful or permitted as an exercise of self-defence. Alternatively, and in any event, uses of force resulting in the annexation of territory will never be lawful as exercises of self-defence since permanent annexation can never be a proportionate response to an armed attack. /n/nI begin by outlining the first argument. Japan submits that the principle prohibiting forcible acquisition of territory is properly understood as providing that the use of force is never a valid basis for acquiring title, even if the initial use of force by the State could have been lawful85. /n/nThis blanket prohibition is a necessary consequence of the complete abolition of the right of territorial conquest in the context of the United Nations Charter. In the Wall Advisory Opinion, the Court described the principle on the illegality of territorial acquisition resulting from the use of force as the “corollary” of the prohibition against the use of force itself86. It is also connected to other fundamental principles of international law, in particular the right to self-determination of peoples as set out in the Friendly Relations Declaration87 and recognized by this Court88. It accordingly reflects a fundamental shift in international law in the twentieth century, particularly after the entry into force of the United Nations Charter, which sought to minimize unilateral recourse to force in international relations. /n/nThe prohibition on the use of force and the prohibition on acquiring territory by force form part of a coherent scheme with the right to self-defence. The right to self-defence provides for States to have recourse to force in order to defend their people and to preserve territory they already have. It does not allow a right to use force to gain additional territorial title89. /n/nI would also like to highlight that a finding by the Court that conquest could confer title upon a State where force was used in self-defence would, in practice, be liable to widespread abuse90. The proper scope of self-defence in international law is controversial. States frequently make contested claims that some use of force or another is lawful as an exercise of self-defence. States seeking to acquire territory by force could accordingly seek to exploit this ambiguity. This would threaten to undermine the principle and, alongside it, the prohibition on the use of force. /n/nJapan’s view on the proper scope of the principle is supported by the General Assembly’s Friendly Relations Declaration, which states and I quote, again, because you’ve heard it many times: “The territory of a State shall not be the object of acquisition by another State resulting from the threat or use of force . . . No territorial acquisition resulting from the threat or use of force shall be recognized as legal.”91 /n/nThis part of the declaration contains no exception for force used in self-defence and does not limit the principle prohibiting territorial acquisition by force to unlawful uses of force. By contrast, in the sentence immediately prior to the one that I have just quoted, the declaration prohibits “military occupation resulting from the use of force in contravention of the provisions of the Charter”92, indicating that where the use of force is not prohibited by the Charter, military occupation may be lawful93. /n/nThis conclusion  conclusion that the declaration endorses a blanket prohibition on acquisition of territory by force  is not affected by the declaration’s subsequent reaffirmation that it “shall [not] be construed as affecting” provisions of the Charter. The right of self-defence regulates the permissibility of uses of force in response to an armed attack, rather than dealing with the question of whether States can, through such use of force, acquire title to territory. The Friendly Relations Declaration accordingly clarifies that the answer to the latter question is “no” without purporting to affect the scope of self-defence as a justification for the use of force. /n/nMr President, Members of the Court, let me turn to the alternative point with regard to the relationship between the prohibition of territorial acquisition by force and the right of self-defence  and this is my final point: annexation of territory can never meet the narrowly drawn requirements of the right of self-defence. /n/nAs the Court has repeatedly pointed out, any purported exercise of the right to self-defence must be necessary and proportionate94. Self-defence, by definition, can only justify the taking of temporary measures in order to achieve its aims. The aim of self-defence is limited to defending the attacked State and its people. Thus, even when a State has suffered an armed attack, it can never be proportionate to permanently deprive a people of its territory95. /n/nIn this regard, it is worth recalling that the acquisition of territory by force has been rejected in the context of States claiming to act in self-defence. The Security Council’s response to Iraq’s invasion and purported annexation of Kuwait in 1991 is worth noting. While demanding that Iraq “rescind immediately its actions”, the Security Council, in its resolution 686, simultaneously affirmed “the commitment of all Member States to the independence, sovereignty and territorial integrity of Iraq and Kuwait”96. It is thus clear that the territory of Iraq had not become liable to annexation even if States were to act in defence of Kuwait97. Another relevant example is, of course, Security Council resolution 242, which emphasized “the inadmissibility of the acquisition of territory by war” without drawing any distinction between lawful and unlawful uses of force98."
    },
    {
        "voto": 0,
        "juez": "Japan",
        "pregunta": "The United Nations, and especially the General Assembly and the Security Council, should consider what further action is required to bring to an end the illegal situation resulting from the construction of the wall and the associated régime, taking due account of the present Advisory Opinion",
        "texto": "Article 2, paragraph 4, of the United Nations Charter itself refers to “the Purposes of the United Nations”, and Japan takes the position that Article 1, paragraph 1, of the UN Charter must constitute an important context and object and purpose for the interpretation of Article 2, paragraph 4. The Security Council has the primary responsibility for the maintenance of international peace and security, and its view should be given significant weight in determining whether the prohibition of acquisition of territory by force applies to a territory. /n/nWith regard to the Occupied Palestinian Territory, preambular paragraph 2 of Security Council resolution 242 emphasizes “the inadmissibility of the acquisition of territory by war”. It also affirmed that the fulfilment of Charter principles requires the establishment of a just and lasting peace in the Middle East which should include the application of principles including the “[w]ithdrawal of Israel armed forces from territories occupied in the recent conflict”. Japan is of the view that due consideration should be given to the relevant resolutions of the Security Council when examining the question of whether the prohibition of acquisition of territory by force applies to a certain territory."
    }
]