[
    {
        "voto": 1,
        "juez": "Jordan",
        "pregunta": "Finds that it has jurisdiction to give the advisory opinion requested",
        "texto": "First, a small number of States have suggested that, in giving its opinion, the Court should take care not to undermine the negotiating framework. Yet both in its 2004 Opinion and in Kosovo, the Court rejected, in no uncertain terms, the argument that an advisory opinion could have a detrimental effect on negotiations118. Your case law confirms that it is not for the Court to substitute its own views for those of the General Assembly on whether an advisory opinion may have such an impact; there is, moreover, no basis for making such an assessment in the present case. On the contrary, as the Court itself said in 2004, any negotiated solution must be achieved “on the basis of international law”119."
    },
    {
        "voto": 1,
        "juez": "Jordan",
        "pregunta":"The construction of the wall being built by Israel, the occupying Power, in the Occupied Palestinian Territory, including in and around East Jerusalem, and its associated régime, are contrary to international law",
        "texto": "A serious, and more serious, violation that has been going on for decades is the extensive and systematic digging and tunnelling works around and underneath Al Aqsa Mosque, which threatens its structural integrity111. On 10 September 2023, a UNESCO decision criticized Israel for failure to cease these activities and described them as “persistent” and “illegal under international law”112. /n/nIn April 2022, during the holy month of Ramadan, the Israeli forces “raided the Al-Aqsa Mosque . . . during dawn prayers and attacked Palestinian worshippers with rubber bullets, stun grenades and tear gas, causing injuries to more than 150 people” and made more than 400 arrests113. In the same month, the ancient Qibli Mosque was subject to a similar attack and significant damage was caused to historic glass windows, the minbar and the carpet114. /n/nOn 13 December 2021 and on 31 March 2023, the Patriarchs and the Heads of Churches of Jerusalem issued a statement expressing their concern that Christians and their holy sites have become the target of frequent and sustained attacks by Jewish radical groups, “with the aim of diminishing Christian presence”115. /n/nMr. President, Members of the Court, Israeli violations in the Muslim and Christian holy sites violate the rules of international law, including Articles 27 and 53 of the Fourth Geneva Convention, as we have stated in depth in our Written Statement116. /n/nFurthermore, Israeli violations of the historic status quo at the Muslim and Christian holy sites in Jerusalem threaten their integrity. They inflame global religious tension and create confrontations along religious lines. /n/nMy second point concerns the right to self-determination. This right is well established in customary international law and is a norm of jus cogens120, from which there can be no derogation. It goes hand in hand with the obligation to respect the territorial integrity of the self-determination unit121, as well as the right to permanent sovereignty over natural resources122. /n/nRegrettably, Israel’s occupation has now lasted for well over half a century. During this period, Israel has intentionally breached fundamental principles of the law of occupation; the raison d’être of these breaches is to deny the right to self-determination of the Palestinian people. /n/nThe Occupied Palestinian Territory has been progressively fragmented. Its demographic composition has been and continues to be altered. Settlements and “outposts” expand rapidly, while the Palestinian people’s access to natural resources is denied and water resources are depleted124. /n/nAll this, Mr. President, Members of the Court, severely violates the Palestinian people’s right to self-determination, including their right to an independent State on the 4 June 1967 lines, with East Jerusalem as its capital. The only way, Mr. President, for the right to self-determination to be exercised is for the occupation to come to an end. /n/nTurning to my third point, Israel’s policies and practices also violate the law of occupation, which applies throughout the Occupied Palestinian Territory. Israel has engaged in a policy of progressively establishing settlements and so-called “outposts”. Israel’s 2018 Basic Law declares: “[t]he State views the development of Jewish settlement as a national value, and shall act to encourage and promote its establishment and consolidation”125. As others have said, 2023 was a record year for settlement expansion. And just recently, in late January, senior Israeli officials called for resettlement of Gaza and for the expanding settlement in the West Bank126. /n/nIsrael’s settlements have created a patchwork of territorial units throughout the West Bank; they seek to create facts on the ground and they undermine the establishment of a sovereign, independent, contiguous and viable Palestinian State. As many others have said, they are often accompanied by brutal settler violence, tolerated or even supported by the Israeli authorities; one effect is to instil a sense of terror and fear in Palestinians, leading to displacement from their own land127. /n/nThis brings me to the fourth point: Israel’s policies and practices, when considered in their entirety, leave no doubt as to Israel’s intention to annex the Occupied Palestinian Territory. /n/nThe facts speak for themselves: Israel’s 1980 Basic Law, which purported to annex Jerusalem de jure; the continued construction of the wall in the West Bank despite the Court’s 2004 Opinion; the scale, infrastructure and location of Israeli settlements; the expansion of Israel’s direct civilian legal authority across the West Bank; and the continued displacement of Palestinians and the difficulties they face to return to their homes128. If there were any doubt, the map shown by the Prime Minister of Israel before the General Assembly last September129, which you have seen earlier this week, and his rejection of the two-State solution130 confirm Israel’s intention to annex. /n/nThe annexation of any part of the Occupied Palestinian Territory is a serious breach of the prohibition of the acquisition of territory by force — a peremptory norm of general international law. /n/nMr. President, my fifth point is that Israel’s discriminatory laws and practices severely affect the lives of Palestinians and demonstrate a total disregard for the occupying Power’s duty to protect the rights and well-being of the Palestinian people131. /n/nSpecifically, the policy of discrimination constitutes a serious violation of treaty obligations and of customary international law, tantamount to apartheid. The CERD Committee, the Human Rights Committee and the Committee on Economic, Social and Cultural Rights have each urged Israel to amend the 2018 “Basic Law” so as to eliminate its discriminatory effects and to ensure equal treatment of all persons within its territory and subject to its jurisdiction132. This has not been done. /n/nDiscriminatory expropriation laws have been supplemented by a vast catalogue of military orders that have little or nothing to do with security or public order. Instead, they permit discriminatory treatment in practically every aspect of daily life — a discriminatory planning régime in which permits are routinely denied to Palestinians; the discriminatory practice of demolitions; and the use of zoning to designate military areas or so-called “nature reserves”, access to which is either denied to Palestinians or subject to Israeli permission133. /n/n All of this is backed up by increasingly frequent interventions by Israeli armed forces to suppress protests, often with lethal fire; by the apparent impunity of those who engage in violence against Palestinians; by the use of excessive force; by attacks on health services; and by the ever-increasing arbitrary detention and ill-treatment of Palestinians, including children134. /n/nFurther, as explained in our written pleadings135, Israel has engaged in acts that constitute crimes against humanity and has failed to prevent and punish such crimes."
    },
    {
        "voto": 1,
        "juez": "Jordan",
        "pregunta": "Israel is under an obligation to terminate its breaches of international law; it is under an obligation to cease forthwith the works of construction of the wall being built in the Occupied Palestinian Territory, including in and around East Jerusalem, to dismantle forthwith the structure therein situated, and to repeal or render ineffective forthwith all legislative and regulatory acts relating thereto, in accordance with paragraph 151 of this Opinion",
        "texto": "Mr. President, I now turn to the legal consequences arising from the unlawful occupation of the Occupied Palestinian Territory. A principal consequence is that Israel must end its occupation of the whole of the Occupied Palestinian Territory, that is, the West Bank, including East Jerusalem and Gaza137. This must be done, as we said in our written pleadings, as a matter of urgency and as rapidly as possible."
    },
    {
        "voto": 1,
        "juez": "Jordan",
        "pregunta": "All States are under an obligation not to recognize the illegal situation resulting from the construction of the wall and not to render aid or assistance in maintaining the situation created by such construction; all States parties to the Fourth Geneva Convention relative to the Protection of Civilian Persons in Time of War of 12 August 1949 have in addition the obligation, while respecting the United Nations Charter and international law, to ensure compliance by Israel with international humanitarian law as embodied in that Convention",
        "texto": "Another legal consequence is that all States are obliged not to recognize the unlawful situation created by Israel’s policies and practices, and not to render any assistance that may serve to further those policies and practices. The content of these obligations was set out by Palestine on Monday in some detail138. States must moreover co-operate with the competent organs of the United Nations to bring the unlawful occupation to an end. /n/nA further obligation binds States to investigate, prosecute, and punish any individuals subject to their jurisdiction, for grave breaches of the Geneva Conventions and crimes against humanity."
    },
    {
        "voto": 1,
        "juez": "Jordan",
        "pregunta": "The United Nations, and especially the General Assembly and the Security Council, should consider what further action is required to bring to an end the illegal situation resulting from the construction of the wall and the associated régime, taking due account of the present Advisory Opinion",
        "texto": "The United Nations, and especially the General Assembly and the Security Council, must take measures to end the illegal occupation, taking due account of the advisory opinion to be given."
    }
]