[
    {
        "voto": 1,
        "juez": "League of Arab States",
        "pregunta":"The construction of the wall being built by Israel, the occupying Power, in the Occupied Palestinian Territory, including in and around East Jerusalem, and its associated régime, are contrary to international law",
        "texto": "The persistence of this occupation, acts of genocide, ethnic cleansing, war crimes, crimes against humanity, displacement of populations, imprisonment of Palestinians behind illegal segregation walls, expansion of illegal settlements, creating new political realities on the ground aiming at complicating the dismantling of the occupation  all  will never discourage Palestinians from claiming their legitimate inalienable rights. /n/nThe insistence on placing Israel above the law, through the politicization of accountability and adopting double standards in the application of justice is a direct threat to international peace and stability./n/nThis prolonged occupation is an affront to international justice. The failure to bring it to an end has led to the current horrors perpetrated against the Palestinian people, amounting to genocide. There can be no moral or juridical justification for occupying lands, killing, terrorizing and displacing their populations. /n/nWhen this began after the First World War, the Jewish population of that land was 11 per cent. Forcibly implementing Zionism in this demographic context has necessarily involved the extermination, or forced displacement of, some of the non-Jewish Palestinian population; the exercise of domination over, and subjugation, dispossession and immiseration of, remaining non-Jewish Palestinians; the emigration to that land of Jewish people, regardless of any direct personal link; and the denial of Palestinian refugees the right to return. All operating through a racist distinction privileging Jewish people over non-Jewish Palestinian people. /n/nThis has necessitated serious violations of all the fundamental, jus cogens and erga omnes norms of international law — the right of self-determination, the prohibitions on aggression, genocide, crimes against humanity, racial discrimination, apartheid and torture  and the core protections of international humanitarian law. /n/nDespite this, a State of Israel, specifically for Jewish people, was proclaimed in 1948 by those controlling 78 per cent — more than three quarters — of Palestine, accompanied by the forced displacement of a significant number of the non-Jewish Palestinian population — the Nakba, catastrophe. This illegal secession was an egregious violation of Palestinian self-determination. Israel’s statehood was recognized, and Israel admitted as a United Nations Member, despite this illegality. Israel is not the legal continuation or successor of the Mandate. /n/nFirst, Palestinian people not displaced from the land proclaimed to be of Israel in 1948, and their descendants, have been forced to live as citizens — presently they constitute 17.2 per cent — of a State conceived to be of and for another racial group, under the domination of that group, necessarily treated as second class, because of their race. /n/nSecond, Palestinian people displaced from that land, and their descendants, cannot return /n/nFor more than half a century, then, a State defined to be of and for Jewish people exclusively has governed the entire land of historic Palestine and the Palestinian people there. And the régime of racial domination — apartheid — and denying return, has been extended throughout. In the case of Palestinians living in the occupied territory, this has involved the same serious violations of international law, supplemented by serious violations of norms applicable in occupied territory. /n/nIndeed, these people are subject to an even more extreme form of racist domination, as they are not even citizens of the State exercising authority over them. Even in East Jerusalem, which Israel has purported to annex, the majority non-Jewish Palestinian residents do not have citizenship, whereas Jewish residents, including illegal settlers, are citizens. /n/nFirst, the law on the use of force. Here, the occupation is illegal both as a use of force without valid justification, and because it is enabling an illegal purported annexation. As such, it is an aggression. /n/nSecond, the law of self-determination. Here, it is illegal again because of the association with illegal purported annexation, and also, more generally, because it is, quite simply, an exercise of authority over the Palestinian people that, by its very nature, violates their right to freedom."
    },
    {
        "voto": 1,
        "juez": "League of Arab States",
        "pregunta": "Israel is under an obligation to terminate its breaches of international law; it is under an obligation to cease forthwith the works of construction of the wall being built in the Occupied Palestinian Territory, including in and around East Jerusalem, to dismantle forthwith the structure therein situated, and to repeal or render ineffective forthwith all legislative and regulatory acts relating thereto, in accordance with paragraph 151 of this Opinion",
        "texto": "Only the rule of law  not the prevailing “law of the jungle”  will pave the way to peace in the whole region. Ending the occupation is the gateway to peaceful coexistence. /n/nThese are serious breaches of the right of self-determination, the prohibitions of racial discrimination and apartheid, and the right of return. They must end, immediately. /n/nJust as in territorial Israel, in occupied territory, these serious violations concerning how Israel exercises authority over the Palestinian people must end immediately. /n/nThe occupation is, therefore, existentially illegal because of its use to actualize purported annexation. To end this serious illegality, it must be terminated: Israel must renounce all sovereignty claims and all settlements must be removed. Immediately. /n/nBeginning with self-determination: this right, when applied to the Palestinian people in the territory Israel captured in 1967, is a right to be entirely self-governing, free from Israeli domination. /n/nConsequently, the Palestinian people have a legal right to the immediate end of the occupation. And Israel has a co-relative legal duty to immediately terminate the occupation. /n/nThis right exists and operates simply and exclusively because the Palestinian people are entitled to it. It does not depend on others agreeing to its realization. It is a right. /n/nIsrael cannot lawfully demand concessions on Palestinian rights as the price for ending its impediment to Palestinian freedom. This would mean Israel using force to coerce the Palestinian people to give up some of their peremptory legal rights: illegal in the law on the use of force and, necessarily, voiding the relevant terms of any agreement reached. The Palestinian people are legally entitled to reject a further loss of land over which they have an exclusive, legal, peremptory right. Any such rejection makes no difference to Israel’s immediate legal obligation to end the occupation. /n/nFirst: the occupation must end: Israel must renounce its claim to sovereignty over the Palestinian territory; all settlers must be removed. Immediately. This is required to end the illegality, to discharge the positive obligation to enable immediate Palestinian self-administration, and because Israel lacks any legal entitlement to exercise authority. /n/nSecond, in the absence of the occupation ending, necessarily, everything Israel does in the Palestinian territory lacks a valid international legal basis and is, therefore (subject to the Namibia exception), invalid, not only those things violating the law regulating the conduct of the occupation. Those norms entitle and require Israel to do certain things. But this does not alter the more fundamental position, from the law on the use of force and self-determination, that Israel lacks any valid authority to do anything, and whatever it does is illegal, even if compliant with or pursuant to the conduct-regulatory rules."
    },
    {
        "voto": 1,
        "juez": "League of Arab States",
        "pregunta": "All States are under an obligation not to recognize the illegal situation resulting from the construction of the wall and not to render aid or assistance in maintaining the situation created by such construction; all States parties to the Fourth Geneva Convention relative to the Protection of Civilian Persons in Time of War of 12 August 1949 have in addition the obligation, while respecting the United Nations Charter and international law, to ensure compliance by Israel with international humanitarian law as embodied in that Convention",
        "texto": "The League of Arab States trusts the esteemed Court will confirm the illegality of this occupation and unambiguously rule on the legal consequences for all parties, especially those who turn a blind eye, facilitate, assist or participate in any way in perpetuating this illegal situation."
    },
    {
        "voto": 1,
        "juez": "League of Arab States",
        "pregunta": "The United Nations, and especially the General Assembly and the Security Council, should consider what further action is required to bring to an end the illegal situation resulting from the construction of the wall and the associated régime, taking due account of the present Advisory Opinion",
        "texto": "Ending Israel’s total impunity, and subjecting it  like any other State  to the universal rules of international law, will help annul its pretexts to systematically reject peace initiatives, the most serious of which is the Arab Peace Initiative of 2002, which offered full normalization of relations with all Arab States, in exchange of Israel only respecting its already established obligations, under the bodies of international law, human rights law, and the United Nations Security Council and General Assembly resolutions."
    }
]