[
    {
        "voto": 1,
        "juez": "Malaysia",
        "pregunta": "Finds that it has jurisdiction to give the advisory opinion requested",
        "texto": "Mr President, Members of the Court, as regards the Court’s jurisdiction to render this advisory opinion, Malaysia considers that the requirements of Article 65, paragraph 1, of the Statute of the Court, read together with Article 96, paragraph 1, of the Charter of the United Nations, are plainly satisfied in the present case. First, the General Assembly is competent to request an advisory opinion, given that the United Nations has “a permanent responsibility towards the question of Palestine until the question is resolved in all its aspects in a satisfactory manner in accordance with international legitimacy”. Second, the questions addressed to the Court are legal questions, “framed in terms of law and rais[ing] problems of international law”. The request that the Court determine the existence of violations of international law and their corresponding legal consequences is “by [its] very nature susceptible of a reply based on law”. /n/nMalaysia further submits that there are no compelling reasons preventing the Court from exercising its jurisdiction, which after all represents, in the Court’s own words “its participation in the activities of the United Nations”, which, “in principle, should not be refused”. /n/nMalaysia stresses, first and in principle, that questions of self-determination are never purely bilateral matters between States: they refer to a peremptory norm of international law, which produces erga omnes obligations, owed to the international community as a whole. That being so, all States and the United Nations have a legal interest in the protection of the rights involved. But quite apart from that, the questions before the Court are not at all concerned with settling disputes between Israel and Palestine. The Court is requested to set out the legal consequences of Israel’s “policies and practices” in the Occupied Palestinian Territory. Its advisory opinion will inform the exercise by the General Assembly of the “permanent responsibility” of the United Nations towards the question of Palestine. Such matters neither involve the determination of “permanent status” issues, nor are they for the parties to any “direct dialogue” to waive or disregard. /n/nAs a final point, Malaysia recalls that it was on these grounds that the Court decided to exercise its advisory jurisdiction in the Wall, rejecting these and other arguments which have been replayed in these proceedings, such as that the Court does not have sufficient information and evidence. Malaysia submits that the Court was correct then and that there are no more compelling reasons today for the Court to refuse to render the opinion requested than there were 20 years ago."
    },
    {
        "voto": 1,
        "juez": "Malaysia",
        "pregunta":"The construction of the wall being built by Israel, the occupying Power, in the Occupied Palestinian Territory, including in and around East Jerusalem, and its associated régime, are contrary to international law",
        "texto": "Malaysia’s submission today is straightforward. The “policies and practices” of Israel in the Occupied Palestinian Territory are a set of acts and measures that individually breach a number of rules of public international law. These “policies and practices”, however, taken together, also amount to a serious breach of the right to self-determination of the Palestinian people, which is protected by peremptory norm of international law. The occupation of Palestine, for its part, is nothing but these “policies and practices” itself. The occupation itself is thus in serious breach of peremptory norm of international law and must be brought to an end immediately. /n/nMalaysia submits that the “policies and practices” of Israel in the Occupied Palestinian Territory consist of a set of acts and of legislative, administrative and other measures. These include: the construction, maintenance and extension of a wall in the Occupied Palestinian Territory; the establishment, maintenance, expansion and protection of settlements in the Occupied Palestinian Territory along with their associated discriminatory legal régime; the demolition of Palestinians’ homes and of forced transfer of the Palestinians in that territory; the control and the provision of food, water, electricity and other amenities to the Occupied Palestinian Territory; and other acts and measures, detailed both by United Nations organs and by the States having chosen to appear before you. /n/nAll these “policies and practices” constitute in and of themselves violations of individual rules of international law, including international humanitarian law and the law of occupation, international human rights law, the prohibition of the use of force and the associated prohibition of acquisition of territory by the threat or use of force, and others. All of this is detailed in Malaysia’s Written Statement, as well as in other written statements submitted to the Court in these proceedings. And we have heard, over the last few days, many States argue before the Court along these lines. /n/nMalaysia submits that, taken together, these “policies and practices”, apart from breaching individual rules of international law, also constitute a serious breach of the Palestinian peoples’ right to self-determination, a jus cogens obligation incumbent on all States, and owed to the international community as a whole. /n/nMalaysia further submits that these “policies and practices” in and of themselves constitute the occupation of the Palestinian territory. These “policies and practices”, Mr President, are nothing but the means by which Israel is exercising its control over the Occupied Palestinian Territory, the means by which it is enforcing its occupation. These “policies and practices”, resulting as they do in a serious breach of the jus cogens right to self-determination, cannot but affect the legal status of the occupation of the Palestinian territory by Israel, rendering it unlawful. /n/nSecond, there can also be no doubt that the right to self-determination applies to the Palestinian people. As this Court noted in the Wall Advisory Opinion, “[a]s regards the principle of the right of peoples to self-determination, . . . the existence of a ‘Palestinian people’ is no longer in issue”. /n/nThe fourth submission that Malaysia wishes to make is that the “policies and practices” of Israel in the Occupied Palestinian Territory violate numerous individual rules of international law, as well as each one of the four core, substantive elements of the right to self-determination. I will demonstrate this as briefly as possible, Mr President. /n/nIsrael’s “policies and practices” with respect to the legal status of East Jerusalem, along with its establishment, facilitation and expansion of settlements in the Occupied Palestinian Territory, with their associated infrastructure and discriminatory legal régime, amount to attempts at de jure and de facto annexation, respectively. This is in clear breach of the prohibition of acquisition of territory by the threat or use of force, a corollary of the prohibition of the use of force in the United Nations Charter, which is a peremptory norm of international law. Israel’s transfer of civilians into the Occupied Palestinian Territory is a breach of Article 49, paragraph 6, of the Fourth Geneva Convention of 1949 and constitutes a war crime per the Rome Statute of the International Criminal Court. Apart from constituting individual breaches of international law, these “policies and practices” violate the territorial integrity of the Palestinian people, and thus the right to self-determination. /n/nIsrael’s “policies and practices” which aim at changing the demographic composition of the Occupied Palestinian Territory, along with the creation of enclaves of Palestinians, the demolition of their homes, the limitation of their freedom of movement, including the blockade, siege and purported evacuation of the Gaza Strip, constitute violations of international humanitarian law and of international human rights law. But they also violate the unity and integrity of the Palestinian people, and thus its right to self-determination. /n/nIsrael’s “policies and practices” of expropriation of Palestinian land for use as settlements, of control over all water resources in the West Bank and control of water provision in the Gaza Strip, of granting licences for oil and gas extraction, and of operating quarries in the Occupied Palestinian Territory constitute violations of international humanitarian law and of international human rights law. But they also violate the permanent sovereignty of the Palestinian people over its natural wealth and resources. They thus violate its right to self-determination. /n/nIsrael’s “policies and practices” of exploitation of natural resources, of restrictive zoning and planning régimes in the Occupied Palestinian Territory, of blockading Gaza and subsequently razing it to the ground, of hampering and limiting access of Palestinians to health services, educational establishments and primary sources of water, of preventing Palestinians from accessing sites of religious and cultural importance in the Occupied Palestinian Territory, of restricting their freedom of association and expression, and of condoning settler violence constitute violations of international humanitarian law and international human rights law. But they also violate the Palestinian people’s freedom to pursue their economic, social and cultural development, and thus its right to self-determination. /n/n“[A]long with measures taken previously”, the Court said. That was a reference, as is evident from the preceding paragraphs of the Advisory Opinion, to the “policies and practices” of Israel involving the establishment of settlements and their associated régime. If that was the case then, 20 years ago, a fortiori this must be the case now  how could it not be? If anything, Israel has maintained and extended the wall, and it has escalated the “measures taken previously”, ramping up the establishment of the settlements, expanding them, providing funding and amenities to them, as well as security, and extending the associated discriminatory legal régime. It has also continued and escalated the demolition of Palestinian homes, the practice of forced transfers and the transfers of its own civilians into the Occupied Palestinian Territory. /n/nThe “a fortiori” argument I made with respect to the existence of a violation of the right to self-determination applies here as well: this is not just any violation, Mr President. It is a serious breach of a peremptory norm of international law. If it were so with respect to the much more limited issue before the Court in 2004, it must certainly be so today. We are no longer talking about the construction of a wall; we are talking about the whole host of “policies and practices” of the acts and measures so well documented by the United Nations and by most of the States that have spoken in these proceedings. These could not amount to anything less than what the construction of a wall amounted to 20 years ago. Indeed, they underscore the devastating deterioration of the situation in the Occupied Palestinian Territory since then. /n/nMr President, Members of the Court, I will have to return to the legal consequences of Israel’s “policies and practices” in the Occupied Palestinian Territory in the final part of my presentation. But before I do so, I would like to conclude this part of the argument. I have established so far that Israel’s “policies and practices” in the OPT constitute not only violations of several rules of international law, but also violations of each core element of the right to self-determination of the Palestinian people. Malaysia submits that this serious breach of a most fundamental peremptory norm of international law renders unlawful the occupation as a whole. /n/nIn particular, Malaysia submits that it is the “policies and practices” discussed and assessed in these proceedings that constitute the occupation. These “policies and practices” are in fact the occupation itself. There are many means by which Israel enforces its control, the means by which it occupies the Palestinian territory. And they are also unlawful: they breach a great number of rules of international law and ultimately result in a serious breach of the Palestinian people’s right to self-determination. This must mean that the occupation as a whole is unlawful, as it constitutes a flagrant denial of the right to self-determination."
    },
    {
        "voto": 1,
        "juez": "Malaysia",
        "pregunta": "Israel is under an obligation to terminate its breaches of international law; it is under an obligation to cease forthwith the works of construction of the wall being built in the Occupied Palestinian Territory, including in and around East Jerusalem, to dismantle forthwith the structure therein situated, and to repeal or render ineffective forthwith all legislative and regulatory acts relating thereto, in accordance with paragraph 151 of this Opinion",
        "texto": "As regards the legal consequences for Israel arising from this serious breach, I will be brief: Israel must, first of all, cease the continuing violation. This means that it must cease all the relevant “policies and practices” I have already discussed. Consequently, it must withdraw immediately from the Occupied Palestinian Territory. Second, Israel offer assurances and guarantees of non-repetition. And third, Israel is under obligation to offer full reparation. This means that it must provide both actual and juridical restitution, including the annulment or repeal of all offending legislative and regulatory measures it has adopted for the Occupied Palestinian Territory. Israel must also offer compensation for all material and moral damage caused by the breach of the right to self- determination to the extent that this is not made good by restitution."
    },
    {
        "voto": 1,
        "juez": "Malaysia",
        "pregunta": "All States are under an obligation not to recognize the illegal situation resulting from the construction of the wall and not to render aid or assistance in maintaining the situation created by such construction; all States parties to the Fourth Geneva Convention relative to the Protection of Civilian Persons in Time of War of 12 August 1949 have in addition the obligation, while respecting the United Nations Charter and international law, to ensure compliance by Israel with international humanitarian law as embodied in that Convention",
        "texto": "Even in 2004, based on conduct less grievous than the one before the Court today, Israel’s breach of the right to self-determination of the Palestinian people was found to constitute a serious breach of a peremptory norm of international law. Reading the relevant paragraphs of the Court’s Opinion leaves no room for doubt in this respect. The Court called upon all States not to recognize the illegal situation resulting from the construction of the wall in the Occupied Palestinian Territory and not to render aid or assistance in maintaining the situation created by such construction. The Court also found that “[i]t is . . . for all States . . . to see to it that any impediment, resulting from the construction of the wall, to the exercise by the Palestinian people of its right to self-determination is brought to an end”. This language closely reflects Article 41 of the Articles on State Responsibility regarding the particular consequences of serious breaches of obligations under peremptory norms of international law. /n/nIn particular, all States must co-operate to bring to an end through lawful means the serious breach of the right to self-determination and, consequently, the unlawful occupation of the Palestinian territory. Further, all States must not recognize as lawful the situation created by the serious breach of the right to self-determination, that is, the occupation of the Palestinian territory. Finally, all States must not render aid or assistance to Israel in maintaining the unlawful denial of the Palestinian’s right to self-determination, thus the occupation of the Palestinian territory. Malaysia stresses the obligation of all States to support the United Nations Relief and Works Agency (UNRWA) and to halt any financial or military support to Israel that aids and assists in the denial of the right to self-determination and the unlawful occupation."
    },
    {
        "voto": 1,
        "juez": "Malaysia",
        "pregunta": "The United Nations, and especially the General Assembly and the Security Council, should consider what further action is required to bring to an end the illegal situation resulting from the construction of the wall and the associated régime, taking due account of the present Advisory Opinion",
        "texto": "As for the legal consequences that arise for the United Nations, these are none other than the obligation to pursue with vigour its permanent responsibility towards the question of Palestine, including its responsibility to ensure UNRWA’s continued effective functioning. The United Nations must continue to serve as a forum of internationalized co-operation for States working towards fulfilling their secondary obligation of bringing to an end the ongoing violation of the Palestinian people’s right to self-determination and the unlawful occupation of the Palestinian territory."
    }
]