[
    {
        "voto": 1,
        "juez": "Namibia",
        "pregunta": "Finds that it has jurisdiction to give the advisory opinion requested",
        "texto": "As a threshold matter, Namibia reiterates, as do the overwhelming majority of States in these proceedings, that the Court has jurisdiction to render the requested advisory opinion, and that there are no compelling reasons for the Court to decline the request."
    },
    {
        "voto": 1,
        "juez": "Namibia",
        "pregunta":"The construction of the wall being built by Israel, the occupying Power, in the Occupied Palestinian Territory, including in and around East Jerusalem, and its associated régime, are contrary to international law",
        "texto": "Today, Palestinians have had to endure the seizure of their land and property, illegal settlements, unlawful killings, forced displacement, drastic movement restrictions, the denial of refugees’ right to return and of equal nationality and citizenship. The lived reality of the people of Palestine evokes painful memories for many Namibians of my generation. Namibians still experience the entrenched and structural impact of inequality, as a direct consequence of colonialism and the prolonged unlawful occupation. /n/nMr President, Members of the Court, we ask you not to look away, either. Rather, we appeal to you: once again, end a historic and ongoing injustice by upholding the fundamental rights of a dispossessed people who have endured 57 years of a suffocating occupation. Today, Palestinians are enduring collective punishment in the besieged Gaza Strip, with civilians being killed in continuous and indiscriminate bombardments at a scale that is unprecedented in recent history. This state of affairs — this “hell on earth” — represents a stain on the collective conscience of the world. /n/nFirst, in so far as the law of occupation envisages any belligerent occupation as a temporary measure, immediately following military operations, Israel’s prolonged — or permanent — occupation breaches the law of occupation. It is a de facto annexation in all but name. /n/nSecond, Israel’s occupation, in and of itself, is unlawful under general international law. This is because it violates the Charter of the United Nations and peremptory norms; specifically, the prohibition on territorial acquisitions through illegal use of force, the principle of self-determination, and the prohibition of apartheid. /n/nThird, successive resolutions of the Security Council and the General Assembly have declared Israel’s occupation to be illegal and called on Israel to end it immediately. These resolutions provide an independent source of authority for the illegality of the occupation. /n/nFinally, the continuation of the illegal occupation does not absolve Israel of its obligations and responsibilities under international law. This is consistent with your own conclusions in the Namibia Advisory Opinion that “[p]hysical control of a territory, and not sovereignty or legitimacy of title, is the basis of State liability for acts affecting other States”. /n/nWe also do so on account of the fundamental importance of the Court’s 1971 Namibia Opinion, where this Court declared that the policies of apartheid “constitute a denial of fundamental human rights” and are “a flagrant violation of the purposes and principles of the [United Nations] Charter”. /n/nBut above all, we do this because, notwithstanding the egregious nature of apartheid — as a State delict, as a violation of a peremptory norm and as a crime — it has received virtually no clarification beyond the specific circumstances of southern Africa. An advisory opinion on threshold questions of apartheid will therefore assist the General Assembly in respect of its own action, in identifying the key elements of the illegality and in formulating appropriate responses to Israel’s discriminatory practices in the Occupied Palestinian Territory. /n/nFirst, we respectfully ask the Court to make it clear that the prohibition of apartheid is not limited to southern Africa in the last century. It extends to Israel’s policies in the Occupied Palestinian Territory today. Article 3 of CERD places all States parties, including Israel, under an obligation to prevent, prohibit and eradicate apartheid “in territories under their jurisdiction”. This is also the conclusion of the CERD Committee. The 1998 Rome Statute of the International Criminal Court, negotiated after the end of apartheid in South Africa, also recognized apartheid as a crime against humanity without temporal or geographical restriction. /n/nSecond, the Court should also confirm that the prohibition of apartheid binds all States as a peremptory norm. In your decision in the case under CERD brought by Qatar against United Arab Emirates, you acknowledged the “universal character [of CERD] is confirmed by the fact that 182 States are parties to it”. The International Law Commission and its Special Rapporteur on jus cogens (as Judge Tladi then was) have also expressly recognized the peremptory character of the prohibition of apartheid. /n/nFinally, Namibia invites the Court to clarify the definition of apartheid. Namibia aligns itself with other participants that the definition in Article 2 of the Apartheid Convention incorporates the three key elements of the delict under international law. /n/nFirst, the State must engage in one or more “inhuman acts”. Crucially, these take the form of violations of fundamental human rights within an institutionalized framework of systematic oppression and domination. /n/nSecond, these inhuman acts must be directed against a “racial group” or its members. /n/nFinally, the State must commit these inhuman acts “for the purpose of establishing and maintaining domination” by one racial group over the other and “systematically oppressing them”. /n/nOther participants have already made extensive statements on the discriminatory and inhuman acts carried out against the Palestinians as a racial group. These policies and practices are too many to enumerate in the time available. They include laws that discriminate in matters of citizenship, ownership and transfer of property, and freedom of movement. The systematic and excessive use of force against Palestinian civilians, the arbitrary killings and mass incarceration of Palestinians, including children; the illegal settlements; the discriminatory residency regulations; and, crucially, the denial of a Palestinian identity by refusing to recognize them as a people with a right to determine their own political destiny and to pursue social, economic and cultural development. /n/nNamibia’s submission will focus on the final requirement: the purpose of establishing, maintaining domination and systematic oppression. First, the term “domination” signifies a pervasive, all-encompassing, serious form of control over a group. Second, “oppression” implies prolonged cruelty, reflecting a sustained violation of human rights. Third, “systematic” implies the organized nature of violent acts and the improbability of their random occurrence. /n/nNamibia shares the view of other participants that Israel’s policies and practices meet the evidentiary standard for establishing the State delict of apartheid. The Israeli Government’s openly articulated aim is to ensure Jewish Israeli control of all facets of Palestinian life, as evidenced by legislation affirming Israel as the nation State of the Jewish people, with unique self-determination rights reserved for Jewish individuals only. /n/nIt is clear from all the available evidence that these discriminatory practices are not accidental or fortuitous but are designed for the specific purpose of privileging Jewish Israelis over Palestinians. The fact that the practices in question may have other collateral objectives, such as maintaining security, is irrelevant. It will suffice if the primary motive is discriminatory, even if it also serves ancillary purposes. /n/nIt follows in Namibia’s submission that Israel’s policies and practices are inconsistent with the prohibition of apartheid as a State delict under international law. Furthermore, these discriminatory practices, in the context of prolonged occupation of the Palestinian territories, violate the right of the Palestinian people to self-determination. /n/nAs other Participants have highlighted, these discriminatory policies and practices are directed at fragmenting the Palestinian people. These elaborate systems of administrative controls undermine group cohesiveness by dividing the Palestinian people into a number of administrative “domains” or groups, with varying degrees of rights. This strategic fragmentation of the Occupied Palestinian Territory into Bantustans makes Palestinian life burdensome and in many cases unbearable, forcing them to leave their homes. /n/nPerhaps the epitome of discriminatory laws negating the Palestinian right of self-determination is the 2018 Basic Law, passed with constitutional status, which boldly declares that Israel is the nation of the Jewish people and that Jewish settlement is a national value. /n/nSince Israel’s policies and practices violate peremptory norms of international law, the occupation itself is unlawful. This entails consequences for Israel, for third States and, for the United Nations."
    },
    {
        "voto": 1,
        "juez": "Namibia",
        "pregunta": "Israel is under an obligation to terminate its breaches of international law; it is under an obligation to cease forthwith the works of construction of the wall being built in the Occupied Palestinian Territory, including in and around East Jerusalem, to dismantle forthwith the structure therein situated, and to repeal or render ineffective forthwith all legislative and regulatory acts relating thereto, in accordance with paragraph 151 of this Opinion",
        "texto": "First, Israel must bear consequences for its violations. This is the most elementary requirement of the law on State responsibility. As others in these proceedings have highlighted, this includes the obligations of cessation and the duty to make reparation for more than five decades of harms inflicted on the Palestinian people. /n/nThe Government of Israel has a legal duty to dismantle all the vestiges of systematic racial discrimination and oppression that permeates all aspects of Palestinian life in the occupied territories. /n/nAs the State of Palestine itself said on Monday, Israel must bring to an end the annexation of Palestinian land, dismantle existing settlements and recognize the right of the Palestinian people to self-determination in a viable State of their own. /n/nIn the Wall Opinion, you observed that when Israel proclaimed its independence, it did so “on the strength of” the partition plan resolution of the General Assembly. As is well known, that plan envisaged two States, one Arab and one Jewish. The Israeli Declaration of Independence makes this plain, by recognizing “the natural right of the Jewish people to be masters of their own fate, like all other nations, in their own sovereign State”. If that logic applied to the self-determination and statehood of the Jewish people, it must by the same token also apply to the self-determination and statehood of the Palestinian people. /n/nCessation cannot be contingent on external factors such as the successful outcome of negotiations, as pointed out by some participants in these proceedings. A withdrawal contingent on the outcome of political negotiations effectively gives Israel a veto over the future of the Palestinian people."
    },
    {
        "voto": 1,
        "juez": "Namibia",
        "pregunta": "All States are under an obligation not to recognize the illegal situation resulting from the construction of the wall and not to render aid or assistance in maintaining the situation created by such construction; all States parties to the Fourth Geneva Convention relative to the Protection of Civilian Persons in Time of War of 12 August 1949 have in addition the obligation, while respecting the United Nations Charter and international law, to ensure compliance by Israel with international humanitarian law as embodied in that Convention",
        "texto": "Second, States are under an obligation not to recognize Israel’s breaches of peremptory norms of general international law vis-à-vis the Palestinian people. At the same time, the obligation of non-recognition is matched by a parallel and positive duty of recognition — of the Palestinian people’s right to self-determination realized through a viable and independent State of Palestine. /n/nWe further ask the Court to consider whether there may be circumstances where political discretion in matters of recognition gives way to a positive duty of recognition, especially when it is necessary to safeguard a peremptory norm. And here, Namibia aligns itself with Jordan’s Written Submission that all States are also under an obligation to recognize the right of the Palestinian people to self-determination, including by exercising that right within a viable and independent State of Palestine. /n/nIn the Namibia Opinion, you already set out the legal consequences of unlawful occupation. There, you said that, once the Court is faced with an illegal situation, “it would be failing in the discharge of its judicial functions if it did not declare that there is an obligation, especially upon Members of the United Nations, to bring that situation to an end.” /n/nIn that Opinion, you recognized the clear obligation on South Africa to put an end to the illegal occupation and withdraw its administration from the territory. The same consequences must of necessity attach to the illegal occupation by Israel of the Palestinian territories. /n/nMoreover, Namibia reaffirms the position held by the majority of participants that all States are under an obligation not to recognize, assist, support, or contribute to the continuation of the unlawful occupation. This is also in line with your own settled jurisprudence. /n/nIn the Wall Opinion, you confirmed that the obligations of third States include the “obligation not to render aid or assistance in maintaining the [illegal] situation”. That all States must refrain from all forms of assistance, including transfer of arms, and political support that de facto perpetuates the occupation. /n/nIn Namibia’s view, this means, in particular, that all States are under an obligation to ensure that companies under their jurisdiction or control do not trade in Israeli goods or with Israeli companies originating from or linked to Israel’s illegal occupation."
    },
    {
        "voto": 1,
        "juez": "Namibia",
        "pregunta": "The United Nations, and especially the General Assembly and the Security Council, should consider what further action is required to bring to an end the illegal situation resulting from the construction of the wall and the associated régime, taking due account of the present Advisory Opinion",
        "texto": "Namibia invites the Court to set a strict time-limit within which Israel must be asked by the General Assembly to bring the occupation to an end, without conditions. Failure to set a strict time-limit has the perverse effect of being treated as acquiescence in the present occupation, and permission for it to continue indefinitely. /n/nOf course, Israel has defied this Court and ultimatums issued by the United Nations organs many times. But it is precisely for this kind of egregious violations of peremptory norms that a régime of countermeasures was contemplated in the now widely accepted International Law Commission’s draft Articles on State Responsibility. Equality before the law is a cardinal principle of the Charter of the United Nations. No State — not Israel — should be exempt from the comprehensive régime of sanctions."
    }
]