[
    {
        "voto": 0,
        "juez": "Netherlands",
        "pregunta": "Finds that it has jurisdiction to give the advisory opinion requested",
        "texto": "The Kingdom would like to begin by underlining that, for the purposes of the present advisory proceedings, it leaves it to the discretion of the Court to satisfy itself that it has advisory jurisdiction and that it may exercise this jurisdiction with respect to the present request, in accordance with Article 65, paragraph 1, of the Statute of the Court and Article 102 of the Rules of Court. /n/nThe Kingdom would like to emphasize that it considers that “the object of the request before the Court is to obtain from the Court an opinion which the General Assembly deems of assistance to it for the proper exercise of its functions”67. Therefore, the request should be regarded in “a much broader frame of reference than a bilateral dispute”68. And it is with such broader frame of reference in mind that the Kingdom seeks to assist the Court in answering the questions contained in the request through the identification of the applicable international law and the presentation of the legal opinion of the Kingdom on the status and interpretation of that law."
    },
    {
        "voto": 0,
        "juez": "Netherlands",
        "pregunta":"The construction of the wall being built by Israel, the occupying Power, in the Occupied Palestinian Territory, including in and around East Jerusalem, and its associated régime, are contrary to international law",
        "texto": "According to the Kingdom, the prohibition of the use of force is a rule of jus cogens83 that applies erga omnes. Indeed, in the Advisory Opinion on the Construction of a Wall, the Court confirmed that the principles as to the use of force incorporated in the United Nations Charter reflect customary international law. In 1966, the International Law Commission noted that the law of the United Nations Charter concerning the prohibition of the use of force in itself constitutes a conspicuous example of a rule of international law having the character of jus cogens84. Consequently, the International Law Commission included the prohibition of aggression in its list of rules of jus cogens85. /n/nAn occupation which fulfils the requirements of the right of self-defence may be considered as lawful under jus ad bellum. An occupation which does not fulfil, or no longer fulfils, these requirements may lose its legal basis and, hence, violate the jus cogens prohibition of the use of force. /n/nFinally, the Kingdom underscores that occupation is an inherently temporary use of force, because if it were to be permanent, it would qualify as annexation. As the Security Council emphasized in 1967, in its unanimously adopted resolution 242, the acquisition of territory by war is inadmissible89. The Court recognized the customary status of the illegality of territorial acquisition resulting from the threat or use of force in the Advisory Opinion on the Construction of a Wall90. /n/nAccording to the Court, “a great many rules of humanitarian law applicable in armed conflict are so fundamental to the respect of the human person and ‘elementary considerations of humanity’” that they are “to be observed by all States whether or not they have ratified the conventions that contain them, because they constitute intransgressible principles of international customary law”91. In the Court’s view, “these rules incorporate obligations which are essentially of an erga omnes character”92. The Kingdom considers these principles, furthermore, to be a peremptory norm of general international law, and would like to refer in this respect to the conclusion of the International Law Commission to include “the basic rules of international humanitarian law” in its list of rules of jus cogens93. /n/nAs noted before, no sovereignty can be established over occupied territory  and occupied territory may not be annexed. In this regard, an important provision under the law of occupation is that the occupying Power shall not deport or transfer parts of its own civilian population into the territory it occupies102. Under international criminal law, such transfers, directly or indirectly, by the occupying Power, constitute a war crime, as reflected in the Rome Statute of the International Criminal Court103. It is also prohibited to deport protected persons from the occupied territory104. /n/nCertain rules of international human rights law can moreover be characterized as peremptory norms of international law. According to the International Law Commission, this includes the prohibition of genocide113, the prohibition of torture114, the prohibition of slavery, and the prohibition of racial discrimination and apartheid, as well as the right of self-determination115."
    },
    {
        "voto": 0,
        "juez": "Netherlands",
        "pregunta": "Israel is under an obligation to terminate its breaches of international law; it is under an obligation to cease forthwith the works of construction of the wall being built in the Occupied Palestinian Territory, including in and around East Jerusalem, to dismantle forthwith the structure therein situated, and to repeal or render ineffective forthwith all legislative and regulatory acts relating thereto, in accordance with paragraph 151 of this Opinion",
        "texto": "As a result, a State that occupies territory is under an obligation to respect and promote the right of self-determination of peoples residing in that territory. The obligation to respect and promote the right of self-determination means that, on the one hand, the occupying State shall refrain from measures that impede the exercise of the right of self-determination of the people concerned during the occupation, and, on the other hand, that the occupying State shall take measures aimed at creating the conditions under which the people concerned is able to freely and genuinely express its will in regard of its future political status80. /n/nA prolonged occupation obstructs the implementation of the right of external self-determination of a people residing in the occupied territory concerned. /n/nIf a struggle by a people for the implementation of its right of self-determination in the context of colonial domination or foreign occupation is accompanied by the use of armed force by such people, this use of armed force must be in accordance with international law. /n/nOnce an occupation has factually occurred, the occupying Power is obliged to act in accordance with the law of occupation. The occupying Power has to respect and protect the civilians in the occupied territory, who are regarded as protected persons100. Protected persons are, inter alia, entitled, in all circumstances, to respect for their persons and shall at all times be treated humanely. Private property is to be respected. At the same time, such measures of control and security may be taken by the occupying Power in regard to protected persons as may be necessary as a result of the war101. /n/nIt follows that an occupying power, for the purposes of international humanitarian law, is bound to respect, protect and fulfil the human rights of all those within the occupied territory. /n/nAs a final observation, it may be recalled that the Kingdom considers that all peremptory norms are applicable erga omnes. Therefore, the procedural legal consequence of a serious breach thereof is that all States, and international organizations, have legal standing to invoke responsibility for such a breach: they may claim cessation of continuing internationally wrongful acts, assurances and guarantees of non-repetition, and performance of the obligation of reparation. A claim concerning reparation is restricted in the sense that it must be in the interest of the injured State, or international organization, or of the beneficiaries of the obligation breached. Such beneficiaries may include individuals and peoples125."
    },
    {
        "voto": 0,
        "juez": "Netherlands",
        "pregunta": "Israel is under an obligation to make reparation for al1 damage caused by the construction of the wall in the Occupied Palestinian Territory,including in and around East Jerusalem",
        "texto": "As to the specific implementation of these rules, the Kingdom observes the following. First, the obligation to co-operate to bring to an end the consequences of the serious breach of a peremptory norm will in most cases, and particularly in cases concerning self-determination and decolonization, be implemented most effectively through the United Nations123. However, should co-operation in the context of the United Nations fail to materialize, or should the United Nations be unable to take appropriate action, States are not relieved from their obligation to co-operate to bring the consequences of the breach to an end. In that case, they are obliged to seek co-operation through regional or bilateral fora."
    },
    {
        "voto": 0,
        "juez": "Netherlands",
        "pregunta": "All States are under an obligation not to recognize the illegal situation resulting from the construction of the wall and not to render aid or assistance in maintaining the situation created by such construction; all States parties to the Fourth Geneva Convention relative to the Protection of Civilian Persons in Time of War of 12 August 1949 have in addition the obligation, while respecting the United Nations Charter and international law, to ensure compliance by Israel with international humanitarian law as embodied in that Convention",
        "texto": "The Kingdom underscores that all High Contracting Parties to the Geneva Conventions are under an obligation to ensure respect for the Geneva Conventions, with reference to Article 1 common to those Conventions105. As noted by the Court, “every State party to that Convention, whether or not it is a party to a specific conflict, is under an obligation to ensure that the requirements of the instruments in question are complied with”106. /n/nArticle 40 of the Articles on State Responsibility defines a serious breach as “a gross or systematic failure” by the responsible State to fulfil its obligation under a peremptory norm. Article 41 stipulates the particular substantive consequences of such a breach, not only for the responsible State but for the international community as a whole, including that State. In sum, States shall co-operate to bring the serious breach to an end, shall not recognize as lawful a situation created by such breach and shall not render aid or assistance in maintaining the situation. The Court has confirmed the binding nature of the rules reflected in Article 41 in Jurisdictional Immunities121. /n/nThus, the jurisprudence of the Court supports the obligations reflected in Article 41 of the Articles on State Responsibility: the Court has also identified the obligation of non-recognition and the prohibition to render aid and assistance, and the obligation to co-operate to bring the consequences of the serious breach of a peremptory norm to an end. /n/nThird, the rendering of unlawful aid and assistance contrary to the prohibition thereto does not give rise to international responsibility of the aiding or assisting State for the underlying situation or internationally wrongful act, but only for its unlawful aid or assistance. /n/nFourth, the obligation not to render aid or assistance includes an obligation not to undermine measures, including sanctions, taken by other States in their endeavour to bring to an end the serious breach of a peremptory norm, in particular when the State undermining those measures does so knowing that its conduct contributes to the maintenance of the unlawful situation."
    },
    {
        "voto": 0,
        "juez": "Netherlands",
        "pregunta": "The United Nations, and especially the General Assembly and the Security Council, should consider what further action is required to bring to an end the illegal situation resulting from the construction of the wall and the associated régime, taking due account of the present Advisory Opinion",
        "texto": "Finally, it is our view that a serious breach of a peremptory norm entitles States other than the injured State to take a countermeasure against the responsible State, as a legal consequence of that breach. Such resort to countermeasures by a non-injured State must be in accordance with the customary rules on countermeasures, including the conditions of proportionality and reversibility124."
    }
]