[
    {
        "voto": 1,
        "juez": "Oman",
        "pregunta": "Finds that it has jurisdiction to give the advisory opinion requested",
        "texto": "Oman supports United Nations General Assembly resolution 77/247 of 30 December 2022 in which the Assembly requested the Court to render an advisory opinion in relation to two specific issues namely: /n/n(a) The legal consequences arising from Israel’s ongoing violation of the right of the Palestinian people to self-determination, from its prolonged occupation of the Palestinian territory occupied since 1967, including the Holy City of Jerusalem, from its measures aimed at altering the demographic composition, character and status of the Palestinian territories and from its adoption of related discriminatory legislation and measures. /n/n(b) Israel’s policies and practices referred to in paragraph (a) affect the legal status of the occupation and the legal consequences that arise for all States and the United Nations from this status."
    },
    {
        "voto": 1,
        "juez": "Oman",
        "pregunta":"The construction of the wall being built by Israel, the occupying Power, in the Occupied Palestinian Territory, including in and around East Jerusalem, and its associated régime, are contrary to international law",
        "texto": "That the occupation, settlement and annexation of Palestinian territory occupied since 1967 by Israel obstructs the realization of the Palestinian people’s inalienable rights, including their right to self-determination and right to return. /n/nThere is an overwhelming international agreement on the existence of the right to self-determination and its continued denial in the Occupied Palestinian Territory. /n/nThe right to self-determination is enshrined, inter alia, in Article 1 (2) of the Charter of the United Nations. The United Nations General Assembly has consistently reaffirmed the right of the Palestinian people to self-determination. The United Nations Security Council has called for an end to the Israeli occupation and the establishment of two States based on the 1967 lines. The Human Rights Council consistently recognizes the “inalienable, permanent and unqualified right to self-determination of the Palestinian people”. /n/nThe consistent and systematic unlawful transfer of Israeli citizens to settlements in the Occupied Palestinian Territory over decades is designed to perpetuate the occupation and make it permanent. /n/nRelated to this policy is the displacement of Palestinians and the establishment of a coercive system of discriminations, zoning, planning, unlawful land appropriation, arbitrary arrest and arbitrary violence since 1967. /n/nThis forcible displacement of the occupied people and the transfer of citizens of the occupying Power to occupied territory is prohibited under Article 49 of the Fourth Geneva Convention on the Protection of Civilian Persons in Time of War. Article 1 of that Convention stipulates that every High Contracting Party to the Convention is under an obligation to ensure compliance in all circumstances. The United Nations General Assembly, United Nations Security Council and United Nations Human Rights Council have consistently and repeatedly condemned Israel’s efforts to alter the demographic character and status of the occupied Palestinian territories. /n/nI would like to conclude that the primary legal consequences arising from Israel’s behaviour is that there is now a de facto annexation by Israel of the Palestinian territories. There is no legal justification for continuing the Israeli occupation and denying the Palestinian people the right to self-determination."
    },
    {
        "voto": 1,
        "juez": "Oman",
        "pregunta": "Israel is under an obligation to terminate its breaches of international law; it is under an obligation to cease forthwith the works of construction of the wall being built in the Occupied Palestinian Territory, including in and around East Jerusalem, to dismantle forthwith the structure therein situated, and to repeal or render ineffective forthwith all legislative and regulatory acts relating thereto, in accordance with paragraph 151 of this Opinion",
        "texto": "Arising from these clear and consistent breaches of the international law in maintaining a 75-year occupation, the Court should determine that the Government of Israel should bring an immediate and unconditional end to all activities, policies and laws that prevent and impede Palestinian self-determination principally by ending the occupation of the Palestinian territory. The Court should recognize the clear responsibility on all States to support the establishment of Palestinian self-determination in line with United Nations resolutions and the United Nations Charter. /n/nThe Court should find that the legal consequences for the Government of Israel in this regard should include the immediate cessation of all illegal acts including settlements and associated legal and administrative frameworks. Clearly, reparations for, and dismantling of, illegal structures and legal frameworks is also an imperative. /n/nThe Sultanate of Oman requests that the following issues are to be taken into account: /n/n(a) The conduct and practices of an occupying Power are well documented and strictly regulated in international law. The fourth Geneva Convention is clear that an occupying Power may not transfer its civilian population to occupied territories. In addition, international law does not provide for permanent occupation or occupation legitimized through the establishment of demographic change through settlement. The 75-year duration of Israeli presence in the occupied Palestinian territories and the persistent policy of settlement renders the Israeli occupation illegal and in breach of the United Nations Charter. /n/n(b) The Court should determine that Israel should bring to an immediate and unconditional end to this unlawful situation. Third States should support these efforts. Thank you very much."
    },
    {
        "voto": 1,
        "juez": "Oman",
        "pregunta": "All States are under an obligation not to recognize the illegal situation resulting from the construction of the wall and not to render aid or assistance in maintaining the situation created by such construction; all States parties to the Fourth Geneva Convention relative to the Protection of Civilian Persons in Time of War of 12 August 1949 have in addition the obligation, while respecting the United Nations Charter and international law, to ensure compliance by Israel with international humanitarian law as embodied in that Convention",
        "texto": "The international community has an obligation to prevent unlawful annexation of Palestinian land. A fundamental principle of international law as reflected in the Charter of the United Nations is that the use of force in any form is prohibited. Consequently, acquisition of territory by use of force is illegal. The 75-year occupation and settlement policy of the State of Israel is preventing the establishment of a contiguous, viable Palestinian State and is an affront to international law. /n/nThird States are under a clear obligation not to recognize or assist the illegal situation present in the Occupied Palestinian Territory. State parties to the Geneva Convention relative to the Protection of Civilian Persons in Time of War are under obligation to ensure Israeli compliance with international humanitarian law as embodied in the convention, including the unlawful transfer of citizens to occupied territories."
    },
    {
        "voto": 1,
        "juez": "Oman",
        "pregunta": "The United Nations, and especially the General Assembly and the Security Council, should consider what further action is required to bring to an end the illegal situation resulting from the construction of the wall and the associated régime, taking due account of the present Advisory Opinion",
        "texto": "United Nations General Assembly resolution 77/25 called upon all States consistent with their obligations under the Charter and relevant Security Council resolutions to a policy of non-recognition, non-co-operation, non-assistance to the Israeli occupation and to ensure respect for international law in this regard."
    }
]