[
    {
        "voto": 1,
        "juez": "Pakistan",
        "pregunta":"The construction of the wall being built by Israel, the occupying Power, in the Occupied Palestinian Territory, including in and around East Jerusalem, and its associated régime, are contrary to international law",
        "texto": "Mr President, Members of the Court, I come to my first point. The Palestinian people have, as the Court itself has recognized, the right to self-determination. This right, which is codified in the two United Nations Human Rights Conventions, is “one of the essential principles of contemporary international law”. All States have a legal interest in protecting that right, which has the status of jus cogens. Israeli measures that severely impede the exercise by the Palestinian people of the right to self-determination are in breach of Israel’s obligations to respect that right. Pakistan strongly believes in the inherent right of people to live freely and in the justice of struggle for freedom from alien subjugation under the right of self-determination. /n/nI turn to my second point: the question of Israel’s occupation and annexation. It has always been the position of the United Nations that it “cannot condone a change in the status juris resulting from military action contrary to the provisions of the Charter. The Organization must, therefore, maintain that the status juris existing prior to such military action be re-established by a withdrawal of troops, and by the relinquishment or nullification of rights asserted in territories covered by the military action”. /n/nThus, after the Six-Day War, the Security Council determined in resolution 242 (1967) that Israel must withdraw its armed forces from territories occupied in the recent conflict. In resolution 476 (1980), the Security Council reaffirmed “the overriding necessity for ending the prolonged occupation of Arab territories occupied by Israel since 1967”. /n/nIsrael’s occupation is no longer, if it ever was, a military occupation; it is annexation. In East Jerusalem, the annexation is de jure; in the rest of the territory, it is de facto. But the formal characterization matters little. To use the words of the Court in the Wall case, the occupation is today, “notwithstanding the formal characterization . . . tantamount to de facto annexation”. This now applies to the entire territory. This may have been the intention all along. Prime Minister Ben-Gurion affirmed in 1950 that “the Israeli Empire must comprise all the territories between the Nile and the Euphrates”, and this was to be achieved as much by invasion as by diplomacy. More recently, Prime Minister Netanyahu has declared that his Government will be “applying Israeli sovereignty over all the communities formed through the transfer of Israeli settlers and not one residential community will be uprooted”./n/nThrough its settlement policy, Israel has sought to create “irreversible facts on the ground”. It has aimed to create physical facts which in practical terms make it as difficult as possible to bring an end to its prolonged occupation of the West Bank and East Jerusalem. Notwithstanding, the Security Council has reaffirmed that the settlements constitute “a flagrant violation under international law”. /n/nAs this Court said in the Namibia case: “A binding determination made by a competent organ of the United Nations to the effect that a situation is illegal cannot remain without consequence.” As in that case, in answering the legal questions now referred to it, the Court is not concerned with the question of what practical steps would be required to cease the occupation. /n/nI come to my third point, regarding systematic racial discrimination. Israel’s policies and practices amount to systematic racial discrimination and apartheid. Israel has imposed a system of racial discrimination against the Palestinian people since 1967. It is a system that distinguishes — deliberately and systematically — along ethnic and religious lines between the Palestinian population and Jewish Israeli settlers illegally transferred into the territory. The purpose of domination and oppression may be inferred from Israel’s pattern of conduct against the Palestinians. /n/nI turn to my fourth point: Jerusalem and its holy places. The Holy City of Jerusalem is unique in that it is sacred to all three Abrahamic religions. Under the historic status quo, it is the right of Christian, Jewish and Muslim communities freely to access and worship at their holy places in the city. Ottoman decrees set out these rights in the nineteenth century. The régime was later confirmed in multilateral and bilateral instruments. The historic status quo has today developed into a so-called “objective régime”, which captures the point that it is characterized by a permanence which the instruments that established it do not themselves necessarily enjoy. Every State interested therefore has the right to insist upon compliance with this régime. /n/nUnder Israel’s prolonged occupation, Christians have not been free to access or worship in the Church of the Holy Sepulchre and Muslims have not been free to access or worship at Haram al-Sharif and in the Al Aqsa Mosque, to name only some prominent sites. The rights under the historic status quo must immediately be restored. This issue is of great importance to Pakistan, which is home to the second largest Muslim population in the world. /n/nMr President, Members of the Court, any conclusion could not be reconciled with the Court’s Opinion on Namibia. There are certain clear parallels with the present case. The General Assembly had condemned South Africa’s occupation of Namibia, characterizing this as an “occupation” that engaged the Geneva Conventions, and the Security Council had expressly called for South Africa’s withdrawal. /n/nIn a later resolution, after condemning South Africa’s non-compliance with the earlier resolutions, the Security Council had also declared that “the continued presence of the South African authorities in Namibia is illegal”. This is to be understood as a reference to illegality under the rules on the use of force. Notably, the United States voted in favour of this resolution. With respect to Palestine, however, it now appears to wish to limit those rules to governing the lawfulness of the “the initial resort to force” “leading to an occupation” only. Of course, that could not be correct, including because it would allow an aggressor to benefit from an ongoing attempt to acquire territory through annexation. /n/nIn reaching this conclusion, the Court found that South Africa’s application of the apartheid régime to occupied territories amounted to disowning the Mandate. In this connection, the Court relied on a context specific expression of the general principle that no State can benefit from its own wrong, stating “[o]ne of the fundamental principles governing the international relationship thus established is that a party which disowns or does not fulfil its own obligations cannot be recognized as retaining the rights which it claims to derive from the relationship”. /n/nSouth Africa had claimed it had an independent right to administer the territory by reason of its “long occupation”. Evidently, the Court disagreed. Three points follow from this. /n/nFirst, the Court in Namibia case implicitly recognized that neither the fact of an occupation nor the law of occupation confer upon the occupying Power any legal entitlement to administer the territory. Any contrary view would allow an occupying Power to benefit from its unlawful use of force. /n/nSecond, the Court made a positive finding that South Africa’s occupation was unlawful. In Namibia, there was a binding Security Council decision to that effect. The Security Council has made no such Security Council decision with respect to Palestine. But this in no way displaces or impedes the Court’s judicial function in determining this legal question for itself. /n/nThird, the Court plainly did not consider that South Africa’s continued status as an occupying Power made any difference. /n/nAs Judge Greenwood has explained, the basic position under the law of occupation is that an occupying Power has the “liberty to govern within certain limits without being guilty of a violation of the ius in bello”. The occupying Power is required to administer the territory as a temporary conservator or trustee for the benefit of the occupied population. Acting in that capacity, the occupying Power has certain liberties to take measures in good faith in the best interests of the occupied population or, where absolutely necessary, to meet its own legitimate security interests. This, of course, is a separate question to the unlawfulness of the occupation itself. /n/nAs to the position under the law of occupation, again, it is helpful to recall the Namibia case. The Court’s context specific expression of the principle was that “a party which disowns or does not fulfil its own obligations cannot be recognized as retaining the rights which it claims to derive from the relationship”. Pakistan considers that this has relevance when considering whether an occupying Power should be recognized as retaining liberties to administer the occupied territory. /n/nIn this case, if one were to zoom in exclusively on Israel’s conduct as an occupying Power, the only conclusion could be that Israel has disowned its basic duties. Its policies and practices of occupation deny the right of the Palestinian people to self-determination and amount to systematic racial discrimination and serious violations of international humanitarian law and human rights. Plainly, they cannot be said to be absolutely necessary to meet Israel’s own security interests. They serve Israel’s other interests, including its goal of acquiring the territory."
    },
    {
        "voto": 1,
        "juez": "Pakistan",
        "pregunta": "Israel is under an obligation to terminate its breaches of international law; it is under an obligation to cease forthwith the works of construction of the wall being built in the Occupied Palestinian Territory, including in and around East Jerusalem, to dismantle forthwith the structure therein situated, and to repeal or render ineffective forthwith all legislative and regulatory acts relating thereto, in accordance with paragraph 151 of this Opinion",
        "texto": "The Court has heard various competing submissions this week with respect to question (b) of the request, but there can be little doubt as to the central importance of three matters: /n/n(a) First, the role of the rules on the use of force in governing the unlawfulness of a given occupation itself. /n/n(b) Second, the series of General Assembly and Security Council resolutions that have consistently and expressly called for Israel’s withdrawal and referred to “the inadmissibility of the acquisition of territory by war”, which is a corollary of those rules. /n/n(c) Third, the Court’s Advisory Opinion on Namibia is a helpful reference point for the Court. /n/nAs to this case, if the Court agrees with Pakistan and with many other States that Israel is in continued breach of these fundamental primary obligations, it cannot allow Israel to benefit from its own ongoing wrongs by somehow avoiding the natural consequences that must follow under this law of State responsibility. These include the obligations of cessation and non-repetition which require immediate and unconditional withdrawal, as well as the obligations of non-recognition and non-assistance for all other States. /n/nAs to the applicable primary rules, it is customary international law and the Charter that govern the illegality of a given occupation at any point in time. As a separate matter, international humanitarian law governs the conduct of an occupying Power with respect to the occupied population. /n/nBut if the occupation itself is unlawful, that carries legal consequences for Israel and for all States under the secondary rules of State responsibility. Those legal consequences are in no way displaced by separate consideration of the lawfulness under international humanitarian law of particular conduct in the course of the occupation, much less by hope for a negotiated solution. Any other approach would effectively permit Israel to benefit from its own wrongdoing. /n/nFor the same reason, there is no scope for an argument that other States, in their dealings with respect to Israel or the Occupied Palestinian Territory, could somehow put to one side the question of the unlawfulness of the occupation itself. They could not, for example, elect instead to focus exclusively on the different questions of whether specific Israeli measures were absolutely necessary to meet legitimate security requirements such that those measures are not unlawful under international humanitarian law. /n/nIndeed, in its 1971 Advisory Opinion, the Court itself concluded that, “the continued presence of South Africa in Namibia [is] illegal”. The Court held that South Africa was under an obligation to withdraw immediately and that all States were under an obligation to recognize the illegality of the occupation. /n/nMr President, Members of the Court. I conclude. With the general principle that no State can benefit from its own wrong firmly in mind, it cannot be right that, as some States have suggested, the Court should refrain from finding that the occupation itself is unlawful or that there is no obligation to withdraw. This would be to allow Israel to profit from its own continued grave wrongs. And, to adopt the Court’s words in Namibia, the Court “would be failing in the discharge of its judicial functions”. Such abdication of responsibility would not encourage or facilitate the achievement of a negotiated solution on the basis of international law. More generally, the Court would be sending out a clear signal to other States that they too might be allowed to benefit through the prolonged unlawful occupation of the territory of another State."
    },
    {
        "voto": 1,
        "juez": "Pakistan",
        "pregunta": "The United Nations, and especially the General Assembly and the Security Council, should consider what further action is required to bring to an end the illegal situation resulting from the construction of the wall and the associated régime, taking due account of the present Advisory Opinion",
        "texto": "And now I come to my final point of the first part of my statement. Pakistan believes that the two-State solution must be the basis for peace. In the Wall case, this Court observed that the two-State solution was to be encouraged “with a view to achieving as soon as possible, on the basis of international law, a negotiated solution to the outstanding problems and the establishment of a Palestinian State, existing side by side with Israel and its other neighbours, with peace and security for all in the region”. Pakistan supports this call. /n/nOn 26 October 2023, Pakistan was pleased to vote in favour of the General Assembly resolution which reaffirmed that: “a just and lasting solution to the Israeli-Palestinian conflict can only be achieved . . . in accordance with international law, and on the basis of the two-State solution”. Two months later, on 22 December 2023, the Security Council reiterated its unwavering commitment to the vision of the two States, consistent with international law and relevant United Nations resolutions. /n/nAnd these — and numerous other — resolutions by the political organs of the United Nations make clear, a two-State solution, and negotiations leading to it, must be consistent with international law. “Negotiations”, Judge Al-Khasawneh of this Court observed in the Wall case, “are a means to an end and cannot in themselves replace that end”. He continued to say that the discharge of fundamental international obligations cannot be made conditional upon negotiations. /n/nIn this regard, the Court’s advisory opinion in these proceedings will be most important. Far from impeding negotiations and the achievement of a just and lasting two States, the Court’s advisory opinion will further assist such efforts, by making it possible for the parties to make progress on the sound basis of international law and international legitimacy."
    }
]