[
    {
        "voto": 1,
        "juez": "Qatar",
        "pregunta": "Finds that it has jurisdiction to give the advisory opinion requested",
        "texto": "Mr President: I need not repeat what you have already heard from numerous Participants this week. The Court unequivocally has jurisdiction and there is no “compelling reason” for it to refuse to give its opinion."
    },
    {
        "voto": 1,
        "juez": "Qatar",
        "pregunta": "Decides to comply with the request for an advisory opinion",
        "texto": "In this context, it is difficult to see what harm the Court’s advisory opinion could possibly have on a non-existent peace process. On the contrary, the absence of a viable peace process only underscores the necessities of the Court’s advisory opinion and a solution based on international law."
    },
    {
        "voto": 1,
        "juez": "Qatar",
        "pregunta":"The construction of the wall being built by Israel, the occupying Power, in the Occupied Palestinian Territory, including in and around East Jerusalem, and its associated régime, are contrary to international law",
        "texto": "Indeed, Israel’s genocidal war on the people of Gaza has shown that the situation in Palestine is the most pressing threat to international peace and security. As Secretary-General Guterres emphasized, recent events did not occur in a vacuum. Rather, they grew out of Israel’s illegal 57-year occupation of the Palestinian territories. Israel has denied the Palestinian people’s right to self-determination. It has ethnically cleansed and colonized Palestinians’ lands. Furthermore, it has implemented an apartheid régime, that is to say, a régime of systematic racial oppression and discrimination, established with the intent to maintain the domination of Jewish Israelis over Palestinians. To maintain that régime, it has killed, maimed and imprisoned tens of thousands of men, women and children. These are the root causes of the situation we face today. /n/nMr President, Members of the Court: Israel’s illegal and discriminatory policies and practices are the tools of a long-standing settler-colonial project. As Qatar explained in its Written Statement, these policies are designed to promote a single goal: the permanent colonization of the Occupied Palestinian Territory for the exclusive benefit of Israel and the Jewish Israeli settlers. This goal is essentially linked to Israel’s oppressive and discriminatory practices in the Occupied Palestinian Territory and is the root cause of the cycles of violence there. /n/nIn Chapter 2 of its Written Statement, Qatar described in detail the eight main categories of discriminatory policies and practices that Israel employs in furtherance of its settler-colonial project. In Chapter 3 of its Written Statement, Qatar explained that these policies and practices entail flagrant violations of international human rights law, international humanitarian law, and constitute a crime against humanity, war crimes, genocide and ethnic cleansing. /n/nIt is Qatar’s position that, in order to fully respond to question (a), the Court should assess the legality of each of Israel’s main policies and practices through these lenses. A fulsome response to question (a) is no less than a clear answer to question (b). The Court should not underestimate the impact that findings of fact and law will have in bringing Israel’s specific policies and practices to an end, to encouraging accountability and to provide victims with a sense of justice. /n/nThe first central feature of Israel’s settler-colonial project is, of course, settlement. /n/nThe establishment and development of Jewish Israeli settlements in the Occupied Palestinian Territory began immediately after Israel occupied it in 1967. Israel establishes Jewish Israeli settlements on seized Palestinian lands, finances and facilitates the construction of housing and infrastructure, and incentivizes Jews from around the world to settle there. /n/nBy 2023, over 700,000 settlers, or approximately 11 per cent of Jewish Israelis, were living in the Occupied Palestinian Territory. /n/nThe settlement activity is relentless. In a January 2024 report, which you can find at tab 3 of your folders, the Israeli human rights group Peace Now explained how the war in Gaza has been exploited as cover for an unprecedented surge in settlement activities. /n/nThe same is happening in East Jerusalem. /n/nAnd even Gaza is now at risk. The Israeli Security Minister recently stated that “[n]ot only do I not rule out Jewish settlement [in Gaza], I believe it is also an important thing.” On 28 January 2024, a conference dedicated to the resettlement of Gaza was held in occupied Jerusalem, which was attended by 12 Israeli government ministers. /n/nMr President, Members of the Court: let me pause here to make a brief remark about the situation in Gaza as it relates to the advisory proceedings. The contentious proceedings instituted by South Africa against Israel under the Genocide Convention do not mean that the recent situation in Gaza should not be addressed here. Gaza is part of the Occupied Palestinian Territory. It was occupied before 7 October and it is occupied today. Israel’s policies and practices referred to in question (a) include its policies and practices in Gaza. The Court will examine the situation in Gaza through the lens of the Genocide Convention in the case brought by South Africa. Here, the Court can, and indeed must, apply all aspects of international law to the situation in Gaza, including well before 7 October. /n/nThis brings me to Israel’s second central policy and practice in the Occupied Palestinian Territory, which is displacement. In order to establish its settlements in the Occupied Palestinian Territory, Israel seizes public and private land, and forcibly displaces Palestinians. It does so through home demolitions, evictions, building restrictions and by establishing buffer or military zones. /n/nAgain, the situation has only grown worse since 7 October 2023. As is well established, Israel has forcibly displaced at least 75 per cent of the population of Gaza. /n/nThis policy is promoted by Israeli leaders as a solution to their Palestinian “demographic problem.” Israeli Minister of Culture stated that the Palestinians “can go to Ireland or [to the] deserts, the monsters in Gaza should find a solution by themselves.” /n/nWhile all eyes may be on Gaza, the situation in the West Bank is rapidly deteriorating. At least 13 different communities in the West Bank have faced forced displacement since 7 October. That has resulted in a north-south stretch of 20 km east of Ramallah being cleared of nearly all Palestinians. /n/nThe third Israeli practice is fragmentation. /n/nIn order to implement the demographic and physical control necessary to perpetuate the occupation and establish further settlements, Israel divides and isolates Palestinians. It relegates them to fragmented enclaves, restricts their movement and renders their daily lives all but unlivable. This is what Namibia and Belize aptly refer to as “strategic fragmentation.” /n/nIsrael has imposed a full blockade on Gaza since 2007, entirely cutting its population off from the rest of the world. On 7 October, Gaza had already been described by the United Nations Secretary General as “hell on earth.” Today it is indescribable. /n/nIn the West Bank, Israel has for decades implemented a system of draconian checkpoints, subjecting millions of Palestinians to daily indignities. Human Rights Watch has documented “more than 40 kilometers of West Bank roads that authorities prohibit Palestinians from traveling on.” /n/nSince 7 October, Israel has implemented an unprecedented lockdown on the entire civilian territory of the West Bank. It has closed much of its vast network of checkpoints, completely cutting off cities, towns and villages from each other. /n/nThe fourth practice that characterizes Israel’s occupation is its discriminatory and unlawful violence. /n/nIsraeli forces and Jewish Israeli settlers — often with the support of the State — use violence to crush even non-violent resistance to the occupation and to perpetuate a climate of fear and repression. /n/nIsraeli violence has been part of the fabric of life for Palestinians even before the beginning of the occupation in 1967. And Gaza has always paid the highest price. In the 15 years before 7 October, Israeli military campaigns killed 5,365 Palestinians in Gaza, the majority of whom were undisputedly civilians. Of course, this shocking statistic pales in comparison to what we have seen in the past four months. /n/nAt the same time, the Court cannot ignore the ever-worsening situation in the West Bank. /n/nSince 7 October, 397 Palestinians have been killed across the West Bank, and 453 have been injured. Even before 7 October, 234 Palestinians had been killed in 2023, which was the highest number on record. /n/nCivilian casualties are not just collateral damage in Israeli attacks, they are the main target. The use of warplanes, armed drones, attack helicopters and missiles was once unprecedented in the West Bank. Now it is routine. /n/nMr President, Members of the Court: Israel’s victims are often children. They include five-year-old Ruqaya, who was shot in the back by Israeli forces on 7 January at a military checkpoint in the West Bank. Her body was withheld from her family by Israeli forces for 10 days. Just last week, Israeli forces also shot 16-year-old Neehel in the head, killing him as he was leaving school. Neehel was the one hundredth Palestinian child killed by Israeli forces in the West Bank since 7 October. /n/nThis brings me to the fifth practice implemented by Israel, which is its discriminatory military legal system in the Occupied Palestinian Territory. This system privileges Jewish Israeli settlers while depriving Palestinians of the most basic legal protections. A pillar of this system is the practice of indefinite administrative detention of Palestinians without charges. As we detailed in our Written Statement, this practice was widespread before 7 October. Its use has increased excessively since then, in what some rights groups have characterized as mass enforced disappearances. In the past four months alone, thousands of Palestinians have been placed in administrative detention. In Gaza, they are rounded up, blindfolded, disrobed, humiliated and detained en masse in makeshift outdoor prisons. You can find detailed reporting at tabs 5 and 6 of your folders."
    },
    {
        "voto": 1,
        "juez": "Qatar",
        "pregunta": "Israel is under an obligation to terminate its breaches of international law; it is under an obligation to cease forthwith the works of construction of the wall being built in the Occupied Palestinian Territory, including in and around East Jerusalem, to dismantle forthwith the structure therein situated, and to repeal or render ineffective forthwith all legislative and regulatory acts relating thereto, in accordance with paragraph 151 of this Opinion",
        "texto": "Mr President, Members of the Court, the Written Statements and Comments that addressed question (b) overwhelmingly endorse a finding by the Court that Israel’s occupation of the Occupied Palestinian Territory is illegal. This was the express conclusion of at least 38 Participants in these proceedings, with at most two States reaching the opposite conclusion. /n/nThose Participants finding that the occupation is illegal offered a number of lines of analysis to support their shared conclusion. This is unsurprising. Israel’s occupation has violated so many fundamental principles of international law that it would be hard to point to just one reason for its illegality. /n/nIn Chapter 3 of Qatar’s Written Comments, we identified five main reasons as to why Israel’s occupation of the Occupied Palestinian Territory is illegal. With its Written Comments, Qatar also submitted a detailed appendix, compiling relevant statements by participating States and international organizations. These can be found at tabs 7 to 15 of your folders. We hope that Qatar’s analysis will be helpful for the Court’s work. /n/nFirst, the occupation contravenes the jus cogens obligation to respect the right of self-determination of the Palestinian people. Thirty-nine States and international organizations found that the occupation violates the right of self-determination. Twenty-eight of those Participants underscored that the occupation has become illegal for this reason. /n/nSecond, Israel’s occupation also violates the jus cogens prohibition of apartheid. Twenty-five Participants endorsed a finding of apartheid. Among those reaching this conclusion, 16 Participants underscored that the situation of apartheid renders the occupation itself illegal. /n/nThird, Israel’s occupation is illegal because it violates the jus cogens prohibition on the use of force. This was the conclusion of 18 Participants. /n/nFourth, by virtue of its illegal annexation of portions of the Occupied Palestinian Territory, Israel has breached yet another jus cogens norm, the prohibition on the acquisition of territory through the use of force. At least 41 Participants in the proceedings have pointed this out, with 31 of them underscoring that the occupation is illegal as a whole because Israel’s annexation of the Occupied Palestinian Territory is an integral feature of the occupation. /n/nFifth and finally, Israel’s occupation is illegal due to the fact that it is not of a temporary character, not being carried out in good faith or not being administered in the best interests of the occupied population. Seventeen States reached such conclusions. /n/nMr President, Members of the Court, the State of Qatar endorses all of these arguments for the illegality of the occupation. While it is of course for the Court to decide how best to answer the General Assembly’s question (b), it is Qatar’s respectful submission that the Court should not limit itself to choosing only one of these grounds for illegality. Unlike contentious cases, judicial economy does not support the adoption of only the narrowest reasoning possible in these proceedings. To the contrary, in the context of an advisory opinion, the Court’s function is to provide legal advice to the organ requesting the opinion. There are multiple relevant legal régimes applicable to the situation, and the Court’s advice on each of these frameworks will be of immense value to the General Assembly and to the international community at large. /n/nIn this connection, Qatar and many other States attach particular importance to a finding that Israel’s occupation, by its nature, amounts to a régime of apartheid. /n/nA finding of apartheid is not just the most accurate label for what the occupation has become. It also provides a tangible but flexible roadmap for what must come next. What ending apartheid requires is achieving a situation in which all people — Israelis and Palestinians — equally enjoy their fundamental human rights and dignity. With the requisite finding of apartheid by the Court, the international community, including the General Assembly, can activate similar mechanisms for bringing about an end of the occupation as it did with the apartheid régime in South Africa. This is the surest path to truth, justice, and yes, reconciliation."
    }
]