[
    {
        "voto": 1,
        "juez": "Republic of Cuba",
        "pregunta": "Decides to comply with the request for an advisory opinion",
        "texto": "The International Court of Justice should make a general assessment of this situation so as to determine the legal implications resulting from it. In this regard, the Republic of Cuba believes that, rather than an obvious apartheid régime situation, prosecuted as a crime against humanity, this is indeed an act of low-intensity genocide that is perpetrated with systematic and effective cruelty. To qualify Israel’s actions merely as acts of apartheid would leave out the implicit intention to exterminate the Palestinian people, either in part or as an ethnic and religious group to whom the right to self-determination is denied.\n\nIn case there was any doubt about the arguments that Cuba presented to the Court in its brief, the current situation that is taking place in the eyes of all confirms the ongoing genocide.\n\nInnocent victims, girls, boys, women, civilians in general, number in the thousands.\n\nFor the Genocide Convention to apply, the life of one single victim, or the incitement, attempt or conspiracy to commit such acts would be enough.\n\nThe Convention against Genocide also punishes the accomplices and instigators; those who veto decisions and prevent the international community and the United Nations from taking action; those who oppose an immediate ceasefire and the delivery of humanitarian aid; those who, for years, have supported each and every one of the policies and practices of Israel, the occupying Power, which deny the existence of the Palestinian people and their rights. This agenda, to a large extent, has advanced in the course of time.\n\nWe are convinced that this Court should not wait for the complete extermination of an entire nation before ruling on the matter. That was the intention of the United Nations General Assembly in requesting the advisory opinion.\n\nThe terrible situation currently facing the Palestinian people is a reminder of the urgency of a clear and consistent statement on the questions submitted to the consideration of the Court.\n\nIsrael, the occupying Power, and its allies, must take responsibility for the legal implications resulting from the sustained non-compliance with the international law.\n\nConsequently, the analysis of the international responsibility of Israel should go hand in hand with the responsibility of the United Nations and the Member States that hinder its actions, creating by sustained and continued omission an international wrongful act that aggravates and worsens a clear situation of violation of international law in the Palestinian occupied territories.\n\nThere should be a clear and unanimous ruling by the Court that impartially and independently establishes the legal implications resulting from depriving the Palestinian peoples from their fundamental rights, including the right to life, freedom and self-determination."
    },
    {
        "voto": 1,
        "juez": "Republic of Cuba",
        "pregunta": "The construction of the wall being built by Israel, the occupying Power, in the Occupied Palestinian Territory, including in and around East Jerusalem, and its associated régime, are contrary to international law",
        "texto": "The presence of Israeli settlements in the occupied territories, the forced changes to the demography of the Palestinian people through land occupation and forced displacement of people, the construction of the separation wall, the control exercised over their natural resources and the restrictions imposed on their mobility, undermine and deny the ability of Palestinians to exercise their right to self-determination.\n\nIsrael is also in violation of resolution 242 (1967) of the Security Council and the Oslo Accords. These agreements state that “no party shall commence or take any step that would modify the status of the West Bank and the Gaza Strip, pending the outcome of negotiations on the permanent status”.\n\nThe destruction and appropriation of property in occupied territories, which are not justified by military necessity and are carried out on a large scale, unlawfully and arbitrarily, constitute grave breaches of the Fourth Geneva Convention relative to the Protection of Civilian Persons in Time of War, and therefore constitute a war crime.\n\nThe Palestinian question demands a clear statement on the legal implications resulting from the non-applicability and violations of the Fourth Geneva Convention.\n\nLand, sea and air blockades constitute collective punishment and are extreme violations of freedom of movement and the enjoyment of economic, social and cultural rights.\n\nCollective punishment is expressly prohibited by international humanitarian law and is incompatible with several international human rights law provisions.\n\nThe written submission presented by Cuba to this Court provides well-documented evidence, particularly the serious violations of the Convention on the Prevention and Punishment of the Crime of Genocide.\n\nThe genocide against the Palestinian people is not limited to the current stage of the extermination war by Israel. All this with the complicity of the United States of America, which prevents the international community from acting to protect the Palestinian people. The justifications for fighting terrorism and exercising the right to self-defence are deceitful when they are raised by the aggressors themselves.\n\nThe legal consequences of current and past events should not be analysed in a fragmented manner.\n\nTaken as a whole, this institutionalized violence, which makes no distinction between civilians and combatants, is part of a broader policy that also includes, in a systematic and organized manner: massive confiscations of land and property, unlawful killings, extrajudicial executions, torture, administrative detentions, forced transfers, restrictions on movement and the denial of nationality and citizenship to the Palestinian population.\n\nThere is also a discriminatory economic and cultural policy aimed at impoverishing the Palestinian population and denying the realization of their fundamental human rights."
    },
    {
        "voto": 1,
        "juez": "Republic of Cuba",
        "pregunta": "Israel is under an obligation to terminate its breaches of international law; it is under an obligation to cease forthwith the works of construction of the wall being built in the Occupied Palestinian Territory, including in and around East Jerusalem, to dismantle forthwith the structure therein situated, and to repeal or render ineffective forthwith all legislative and regulatory acts relating thereto, in accordance with paragraph 151 of this Opinion",
        "texto": "Referring to the first part, the violations of the ban on the threat or use of force, equal rights and free determination of peoples have been amply documented before the international community and this very Court.\n\nIsrael’s occupation of Palestinian territories is an internationally wrongful act; the reiteration and duration of which aggravate the responsibility of the occupying Power before the Palestinian people and the international community.\n\nThe prohibition to acquire territories by threat or the use of force is a rule of customary international law with broad regulatory and jurisdictional recognition. This prohibition applies regardless of whether the territory is acquired as a result of an act of aggression or self-defence.\n\nThe United Nations Charter, which is the basic international legal instrument for the new international order and the contemporary international law, is very clear in this regard.\n\nThis treaty, of which the Statute of the International Court of Justice is an integral part, establishes in Article 2.4 that every State “shall refrain from the threat or use of force against the territorial integrity or political independence of any State, or in any other manner inconsistent with the Purposes of the United Nations”.\n\nThe Charter itself, in Article 1.2, recognizes as one of its purposes “respect for the principle of equal rights and self-determination of peoples”, which are systematically and flagrantly denied to the Palestinian people. These violations of general customary international law stand erga omnes.\n\nMr President, Members of the Court, related to the second part, added to the aforementioned international violations there is the indolent attitude of Israel, the occupying Power, of ignoring the numerous resolutions and decisions adopted by the United Nations General Assembly, the Security Council and the International Court of Justice.\n\nIn this regard, and without intending to cover all issues, our brief to the Court contains a report on the violations of the aforementioned provisions.\n\nIn line with the foregoing and all other relevant opinions that may be contributed by other States, the main legal implication resulting from these violations of international law should be the declaration of the international legal responsibility of Israel, the occupying Power, and its accomplices.\n\nAll this based on the series of conventional and customary primary rules of international law that have been violated by Israel.\n\nLikewise, the aforesaid responsibilities and legal consequences must be established for Israel and its accomplices, in accordance with the secondary rules of State Responsibility for Internationally Wrongful Acts contained in the Draft Articles of the International Law Commission, as reflected in document A/56/10.\n\nIt would be appropriate for the Court to provide in its advisory opinion that the international responsibility of Israel covers all illicit acts or omissions of its State bodies and those executed by persons or entities exercising powers of public authority, acting in the absence of official authorities or under the guidance or control of the occupying Power."
    },
    {
        "voto": 1,
        "juez": "Republic of Cuba",
        "pregunta": "All States are under an obligation not to recognize the illegal situation resulting from the construction of the wall and not to render aid or assistance in maintaining the situation created by such construction; all States parties to the Fourth Geneva Convention relative to the Protection of Civilian Persons in Time of War of 12 August 1949 have in addition the obligation, while respecting the United Nations Charter and international law, to ensure compliance by Israel with international humanitarian law as embodied in that Convention",
        "texto": "In relation to the specific question before the International Court of Justice, it should be pointed out that since the adoption of resolution 242 (1967) of the Security Council, it was agreed that Israel’s armed forces would withdraw from all the territories occupied during the 1967 conflict and that the 1949 Green Line would be recognized as the demarcation of the borders between Israel and Palestine.\n\nThe occupation of the Palestinian territories is also considered as a wrongful act of annexation in accordance with the provisions contained in resolutions 476 (1980), 478 (1980) and 497 (1981) of the Security Council, which state that the acts of Israel oriented to the annexation of East Jerusalem and the Golan Heights are null and void and should not be recognized by States.\n\nThese spurious attempts have also included manoeuvres to change the international status of the Holy City of Jerusalem.\n\nSome States not only recognize and accord legal status to Israel’s policies and practices, but act with complicity and blatant impunity to prevent the international community, including the United Nations, from stopping the ongoing genocide.\n\nUnder the Declaration on the Granting of Independence to Colonial Countries and Peoples, adopted by United Nations General Assembly resolution 1514, the Palestinian people have the inalienable right to determine their own political, economic and social destiny.\n\nThis is in keeping with the recognition of equal rights and self-determination of peoples, peremptory norms endorsed in the United Nations Charter, the Human Rights Covenants and the Declaration on Principles of International Law concerning Friendly Relations and Cooperation among States, in conformity with the Charter, agreed upon by the United Nations General Assembly resolution 2625.\n\nThese secondary rules that govern the international responsibility of States clearly establish the guidelines to determine the legal implications of the internationally wrongful act.\n\nThis would motivate a strong ruling by the Court, indicating the immediate obligation of all States, particularly the occupying Power, to comply with the conventional and customary norms flagrantly and systematically violated in the Palestinian territory, including the cessation and non-repetition and reparation for the damage caused to the Palestinian people referred to, respectively, in Articles 29, 30 and 31 of the Draft Articles on Responsibility of States. All of the foregoing is without prejudice to the applicable provisions of treaty law.\n\nIn addition, the International Court of Justice should separately address the international responsibility of other States for the aid and assistance they offer to Israel including those that supply weapons.\n\nIt is an undisputed fact that certain Members of the Organization violate the principles reflected in Article 2 of the Charter, not only by denying the sovereign equality and rights of the State of Palestine, but also by acting in bad faith in such a way that precludes any possibility for a negotiated solution to the conflict that, far from being resolved, has worsened over the last 70 years.\n\nIn all these years, the United States has systematically and consistently overused its veto power to prevent any effective action by the Security Council and to ensure impunity to Israel. Just yesterday, the United States vetoed for the 48th time a Security Council resolution related to the Palestinian question.\n\nThe International Court of Justice should emphasize the scope of Article 2.5 of the United Nations Charter, which states that all Members “shall refrain from giving assistance to any State against which the United Nations is taking preventive or enforcement action”.\n\nThis entails the obligation of all States to abide by the decisions adopted by the Organization as a whole, particularly when the Security Council remains passive by the indolent attitude of one of its permanent members, the United States of America, and the United Nations General Assembly has continuously and categorically taken a stand on this question, supported by the International Court of Justice."
    }
]
