[
    {
        "voto": 1,
        "juez": "Republic of Colombia",
        "pregunta": "Finds that it has jurisdiction to give the advisory opinion requested",
        "texto": "By virtue of Article 65, paragraph 1, of the Statute of the Court, two requirements must be met for the Court to have jurisdiction to give an opinion: there must be a formal request from a body duly authorized by the United Nations Charter, or in accordance to it, to make such a request, and the question put before the Court must be a legal question.\n\nIt is undisputed that the General Assembly is one of the bodies authorized to make such a request, in line with Article 96, paragraph 1, of the Charter and that the decision of the General Assembly to submit the questions contained in resolution 77/247 was adopted in accordance with its rules of procedure and by the required majority. A significant number of Member States — including Colombia — decided it was important for the General Assembly to receive guidance on the questions put to the Court. Therefore, the request observes the first requirement.\n\nThe second requirement, namely that the question put before the Court be a legal one, is also complied within the present case. Indeed, in your jurisprudence, particularly, for example, in the Nuclear Weapons Advisory Opinion, you have clarified that a question is a legal one when “the Court is asked to rule on the compatibility of the [request] with the relevant principles and rules of international law”. In other words, questions “framed in terms of law and rais[ing] problems of international law”, whereby the Court is asked to identify and apply principles and rules of international law, qualify as questions of a legal character.\n\nColombia considers that the questions raised in resolution 77/247 are indeed framed in legal terms, since they request the Court to determine the legal consequences arising from the policies and practices of the State of Israel, a Member State of the United Nations, in the Occupied Palestinian Territory, including East Jerusalem, and to ascertain how those actions affect the legal status of the occupation. Those questions are to be answered through the application of rules of international law and therefore constitute legal questions which could form the basis of a request for an advisory opinion.\n\nThus, in the opinion of Colombia, the Court has jurisdiction to respond to the questions contained in resolution 77/247."
    },
    {
        "voto": 1,
        "juez": "Republic of Colombia",
        "pregunta": "Decides to comply with the request for an advisory opinion",
        "texto": "Mr President, I will now focus on the question of propriety. In this respect, while Article 65, paragraph 1, of the Statute of the Court, gives the Court discretionary power to give or not an advisory opinion that has been requested from it, in its case law the Court clarified certain important points, namely:\n\nthat the Court may give an advisory opinion should be interpreted to mean that the Court has always a discretionary power to decline to give an advisory opinion, even if the conditions of jurisdiction are met; and the Court is always mindful of the fact that its answer to a request for an advisory opinion represents its participation in the activities of the Organization, and, in principle, should not be refused.\n\nWhile certain States have expressed opposition to the request by the General Assembly, the reasons argued are, for the most part, quite similar to those dismissed by the Court in its Advisory Opinion on the Construction of a Wall. In that case the Court decided to render the requested Opinion as, in its own words “[d]ifferences of views on legal issues have existed in practically every advisory proceeding”.\n\nColombia posits that the Court’s thorough reasoning then, soundly grounded on its long-standing jurisprudence, is directly applicable to the current request.\n\nConsequently, Colombia considers that the Court should reach the same conclusion in the present proceedings, that is, that it can and will exercise jurisdiction, and that there are no compelling reasons for it to use its discretionary power not to render an opinion.\n\nHence, Colombia invites the Court to pronounce the law on the legal consequences arising out of serious breaches of peremptory norms of general international law and thus assist the General Assembly in the proper exercise of its functions; the United Nations in discharging its responsibilities in this matter, originating, as the Court recalled, in the Mandate and the Partition resolution concerning Palestine; and all States who possess an interest in the protection of erga omnes obligations.\n\nMr President, an additional important circumstance that should be factored in by the Court when deciding as to the propriety of rendering its advisory opinion is that the situation in the Palestinian occupied territory has changed drastically since the request was transmitted to the Court in January 2023.\n\nOn 7 October of the same year Israel was the victim of a horrifying attack by Hamas. We all know the scale and the magnitude of Israel’s reaction to the attack. The Court itself has already been confronted with the veritable map of horror and devastation which the Gaza Strip has become, as a result of the total war and scorched-earth policies unleashed by the Government of Israel.\n\nIndeed, in several passages of its Order of 26 January concerning provisional measures in the case brought by South Africa against Israel on 29 December 2023, the Court took judicial notice of some details of this dire situation. To quote just one of such passages, in the Court’s own words:\n\n“The Court considers that the civilian population in the Gaza Strip remains extremely vulnerable. It recalls that the military operation conducted by Israel after 7 October 2023 has resulted, inter alia, in tens of thousands of deaths and injuries and the destruction of homes, schools, medical facilities and other vital infrastructure, as well as displacement on a massive scale The Court notes that the operation is ongoing and that the Prime Minister of Israel announced on 18 January 2024 that the war ‘will take many more long months’. At present, many Palestinians in the Gaza Strip have no access to the most basic foodstuffs, potable water, electricity, essential medicines or heating.”\n\nEvidently, the factual matrix of that case and the background of these advisory proceedings are not identical and, in particular, the request by the General Assembly has a wider scope than South Africa’s Application in at least two respects: in that the requested advisory opinion refers to the policies and practices of Israel in the whole Palestinian Occupied Territory and not only in the Gaza Strip; and in that it covers all actions that Israel carries out in such territory and not only the actions and omissions by State agents that, according to the Applicant in the contentious case, amount to genocide.\n\nBut the point remains that those policies and practices — which in Colombia’s view contravene essential norms of international law — have taken a turn for the worse as a result of Israel’s military campaign unfolding in Gaza, today a place of death and despair that, in the words of an impartial source, “has simply become uninhabitable”.\n\nColombia respectfully submits that the Court should not underestimate the fact that the situation in Gaza has become more deadly over the past months and, therefore, the legal consequences of such actions must be even more serious today than in the world we were living before this bloodshed started.\n\nAgainst that distressing background, and for all the reasons explained above, the Government of Colombia, in line with its policy of pursuing Total Peace both within and beyond its borders, calls upon the Court to avail itself of the opportunity to clarify legal aspects that may pave the way for the parties to resume a fruitful discussion and achieve peace, and support the General Assembly to better assist them in that purpose."
    },
    {
        "voto": 1,
        "juez": "Republic of Colombia",
        "pregunta": "The construction of the wall being built by Israel, the occupying Power, in the Occupied Palestinian Territory, including in and around East Jerusalem, and its associated régime, are contrary to international law",
        "texto": "Mr President, let me address now the questions submitted to the Court by the General Assembly. The questions relate to the legal consequences arising from Israel’s ongoing violation of the right of self-determination of the Palestinian people as a result of its prolonged occupation, settlement and annexation of the Palestinian territory occupied since 1967, and for all States and the United Nations from this ongoing occupation.\n\nIn order for the Court to rule on those questions, it must first determine whether Israel is violating the right of self-determination of the Palestinian people, and whether Israel’s prolonged occupation, settlement and annexation of the Palestinian territory since 1967 is in violation of international law. An answer in the affirmative to both questions will then enable the Court to address the ensuing legal consequences.\n\nWith regard to the first issue, as mentioned, in the Wall Advisory Opinion the Court stated that Israel is bound to comply with its obligation to respect the right of the Palestinian people to self-determination and, in doing so, it is obliged to respect international humanitarian law and international human rights law. The General Assembly routinely reaffirms such right by means of an annual resolution on the matter.\n\nRegarding the second point, Israel’s prolonged occupation and further annexation of the Palestinian territory is in manifest violation of the rule of international customary law which clearly prohibits the acquisition of territory by force. It also blatantly ignores the United Nations Charter and the findings of this Court in its Advisory Opinion on the Wall case.\n\nAn occupation that includes the annexation de facto of the occupied territory amounts, in Colombia’s view, to an illegal acquisition of territory by use or threat of force, and to a denial of the right of self-determination. Furthermore, the occupation violates peremptory norms of general international law. In addition, as the Court recalled in its 2004 Advisory Opinion, Israel’s policies and practices involving the establishment of settlements in the Occupied Palestinian Territory are contrary to the terms of Article 49, paragraph 6, of the Fourth Geneva Convention, to which Israel is a party.\n\nGiven that the Israeli occupation has since its onset been acquisitive in nature and, consequently, its policies and practices in furtherance of that occupation have resulted in imposed persecution, racial discrimination and apartheid over the Palestinian people, it can only be found to be in breach of various international legal obligations incumbent upon Israel."
    },
    {
        "voto": 1,
        "juez": "Republic of Colombia",
        "pregunta": "Israel is under an obligation to terminate its breaches of international law; it is under an obligation to cease forthwith the works of construction of the wall being built in the Occupied Palestinian Territory, including in and around East Jerusalem, to dismantle forthwith the structure therein situated, and to repeal or render ineffective forthwith all legislative and regulatory acts relating thereto, in accordance with paragraph 151 of this Opinion",
        "texto": "Mr President, with regard to the consequences of those violations, Colombia is of the view that Israel’s actions contrary to international law engage its responsibility and therefore entail distinct legal consequences.\n\nFirst of all, Israel is obliged to cease its violations and to return to a situation of compliance with the obligations it has breached. Consequently, Israel is bound to put an end to the prolonged occupation, settlement and annexation of the Palestinian territory. It must do so unconditionally, immediately and completely. It must cease the continuing internationally wrongful acts, and should offer appropriate assurances and guarantees of non-repetition. Israel also must respect international humanitarian law and international human rights law vis-à-vis the Palestinian people.\n\nMoreover, Israel must make reparations for the damage caused. The Court’s jurisprudence on the essential forms of reparation in customary law is clear. Israel likewise has an obligation to compensate, in accordance with the applicable rules of international law, all natural or legal persons having suffered any form of material or immaterial damage as a result of its occupation upon the Palestinian territory.\n\nIsrael also has violated erga omnes obligations, and as the Court indicated in the Barcelona Traction case, such obligations are by their very nature “the concern of all States” and “in view of the importance of the rights involved, all States can be held to have a legal interest in their protection.”\n\nGiven the character and the importance of the rights and obligations involved, it follows that all States are under an obligation not to recognize the illegal situation resulting from the occupation of the Palestinian territory. They are also under an obligation not to render aid or assistance in maintaining the situation created by such occupation. As the Court has asserted, “it is also for all States, while respecting the United Nations Charter and international law, to see to it that any impediment to the exercise by the Palestinian people of its right to self-determination is brought to an end.”\n\nFinally, Colombia believes that States must co-operate within the multilateral framework of the United Nations. In the present situation, the Organization, and especially the General Assembly and the Security Council, should consider what further and urgent action is required to bring to an end the illegal situation resulting, in the instant request, from Israel’s illegal occupation. The Court’s guidance is crucial for that purpose."
    }
]
