[
    {
        "voto": 1,
        "juez": "South Africa",
        "pregunta": "Finds that it has jurisdiction to give the advisory opinion requested",
        "texto": "In this submission we do not intend to restate South Africa’s arguments on why the Court has to assume jurisdiction, as this has been dealt with in some detail in our Written Statement. We will therefore focus on the Palestinian right to self-determination and the violation thereof by Israel, and then we will continue to submit our arguments on the legal consequences for Israel, the United Nations and third States."
    },
    {
        "voto": 1,
        "juez": "South Africa",
        "pregunta": "Decides to comply with the request for an advisory opinion",
        "texto": "The request for an advisory opinion presents a critical opportunity to clarify and reconfirm the rules and principles of international law applying to the situation of Palestine and the Palestinian people. A clear legal assessment would assist the General Assembly  and the broader international community  to promote peace and justice, a key element of judicial propriety, at a time when a ferocious and unrestrained military assault has been launched by Israel on the Palestinians in Gaza, which this Court has found may plausibly amount to genocide, threatening the very existence of the Palestinian people."
    },
    {
        "voto": 1,
        "juez": "South Africa",
        "pregunta":"The construction of the wall being built by Israel, the occupying Power, in the Occupied Palestinian Territory, including in and around East Jerusalem, and its associated régime, are contrary to international law",
        "texto": "The occupation alone has persisted for 56 years. As the United Nations Special Rapporteur on the occupied Palestinian territories, explained in 2022, “[t]he occupation by Israel has been conducted in profound defiance of international law and hundreds of United Nations resolutions, with scant pushback from the international community.” /n/nIn the Construction of a Wall case, this Court held that: “The construction of the wall being built by Israel, the occupying Power, in the Occupied Palestinian Territory, including in and around East Jerusalem, and its associated régime, are contrary to international law . . . [and that Israel is under an obligation to] dismantle forthwith the structure therein situated, and to repeal or render ineffective forthwith all legislative and regulatory acts relating thereto”. /n/nPalestinians continue to be subjected to routine violent Israeli raids on their homes  with thousands of adults and children being subjected to unlawful arbitrary arrests by Israeli soldiers, in the dead of night, and indefinitely renewable internment without trial  known euphemistically as “administrative detention”; and a dual legal system pursuant to which Palestinians  including Palestinian children  are tried under military legislation by military judges  often themselves illegal settlers, in Israeli military courts, without basic protection of international humanitarian and human rights law, while Israeli settlers living illegally in the same territory are subject to an entirely different legal régime, and tried in Israeli civilian courts with full access to due process. /n/nIsrael has occupied the Palestinian territory in the West Bank, Gaza and East Jerusalem since the 1967 Arab-Israeli War and annexed East Jerusalem and parts of the West Bank in that same year. It is not disputed that the acquisition of territory by the threat or use of force is illegal, irrespective of whether the territory was acquired through a war of self-defence or of an act of aggression. The occupying Power cannot annex any part of the occupied territory and there is an obligation on States not to recognize such an illegal territorial acquisition. /n/nHowever, it is clear that Israel has turned the temporary nature of the occupation into a permanent situation, in violation of the Palestinian right to self-determination. It has done this through its illegal settlement enterprise, which now consists of an estimated 700,000 settlers  an increase of 235 per cent since the Oslo Peace Accords, and of 165 per cent since the Wall Opinion. /n/nIn that case, the Court found that Israel has taken measures that “severely impeded the exercise by the Palestinian people of their right to self-determination”, in breach of that fundamental right. The very disruption of Palestinian territorial integrity resulting from those settlements as well as Israel’s formal and de facto annexation of parts of the Occupied Palestinian Territory, including East Jerusalem, constitute further violations of that fundamental right. /n/nIn terms of international humanitarian law, the continuing construction and expansion of Israeli settlements in the Occupied Palestinian Territory are in clear violation of Article 49 of the Fourth Geneva Convention, to which Israel is a party and which the Court has found in the Wall case to be binding upon Israel. /n/nThe extent of human rights violations and discriminatory laws and practices by Israel with respect to the Palestinian population is well documented in various reports of the treaty-based and charter-based mechanisms of the United Nations and is recalled in resolutions of the Security Council and the General Assembly. These policies and practices have reached the threshold of apartheid within the meaning ascribed to it in the International Convention on the Suppression and Punishment of the Crime of Apartheid."
    },
    {
        "voto": 1,
        "juez": "South Africa",
        "pregunta": "Israel is under an obligation to terminate its breaches of international law; it is under an obligation to cease forthwith the works of construction of the wall being built in the Occupied Palestinian Territory, including in and around East Jerusalem, to dismantle forthwith the structure therein situated, and to repeal or render ineffective forthwith all legislative and regulatory acts relating thereto, in accordance with paragraph 151 of this Opinion",
        "texto": "Despite that 19-year-old finding by the Court, today, Palestinians in the West Bank, including many in East Jerusalem, continue to be contained behind a segregating wall. They continue to be subjected to discriminatory land zoning and planning policies; punitive and administrative house demolitions; and violent Israeli army incursions into their villages, towns, cities and refugee camps, including in Area A, which is supposed to be under full Palestinian control. /n/nAs I speak, and for each of the past 136 days, the world is witnessing in Gaza an assault that is unprecedented, in speed and severity, violating the most basic precepts of the right to life and the survival of a population. The international community’s unwillingness to hold Israel accountable for its policies and practices, and its failure to ensure the immediate, unconditional and total withdrawal of Israeli troops, and an immediate end to the Israeli occupation and apartheid in Palestine  including Gaza, the West Bank and East Jerusalem  emboldens Israel to cross a further threshold: namely, to commit the crime of crimes  genocide. /n/nIn the present case, the aforementioned principles of international law require that Israel must bring an immediate, unconditional and complete end to the occupation in all its manifestations. This means that Israel must immediately cease its illegal settlement activities and all measures aimed at altering the character, status and demographic composition of the occupied Palestinian territories and dismantle illegal structures, including the settlements and the Wall. Furthermore, it must immediately, unconditionally and totally withdraw its occupation forces from the Occupied Palestinian Territory, dismantle the settler colonial apartheid régime against Palestinian people, rescinding all legislative measures adopted with a view to annex Palestinian land and discriminate against the Palestinian people, allowing for the full restitution of Palestinian property and for the right to self-determination of the Palestinian people to be finally realized."
    },
    {
        "voto": 1,
        "juez": "South Africa",
        "pregunta": "Israel is under an obligation to make reparation for al1 damage caused by the construction of the wall in the Occupied Palestinian Territory,including in and around East Jerusalem",
        "texto": "The continued occupation by Israel of the Palestinian territory, including East Jerusalem, as well as the aforementioned violation of peremptory norms of international law, are breaches of international obligations constituting internationally wrongful acts attributable to Israel and which invoke the law of State responsibility. The law of State responsibility provides that a State responsible for an internationally wrongful act is under an obligation to cease such act and to make reparation in an adequate form, as confirmed by this Court’s predecessor in the Factory at Chorzów case."
    },
    {
        "voto": 1,
        "juez": "South Africa",
        "pregunta": "All States are under an obligation not to recognize the illegal situation resulting from the construction of the wall and not to render aid or assistance in maintaining the situation created by such construction; all States parties to the Fourth Geneva Convention relative to the Protection of Civilian Persons in Time of War of 12 August 1949 have in addition the obligation, while respecting the United Nations Charter and international law, to ensure compliance by Israel with international humanitarian law as embodied in that Convention",
        "texto": "Mr President, South Africa bears a special obligation, both to its own people and the international community, to ensure that wherever the egregious and offensive practices of apartheid occur, these must be called out for what they are and brought to an immediate end, and that the perpetrators of such egregious breaches of peremptory norms of international law be held accountable. /n/nThird States must immediately act with a view to end, through all lawful means and measures, the annexation by Israel of parts of the Occupied Palestinian Territory and East Jerusalem, and refrain from rendering assistance or aid in any form to Israel for the maintenance of the situation. Third States have a positive obligation not to recognize Israel’s continued occupation and presence in the Occupied Palestinian Territory as these are breaches of jus cogens norms of international law. That obligation  far too long ignored  must now urgently be implemented."
    },
    {
        "voto": 1,
        "juez": "South Africa",
        "pregunta": "The United Nations, and especially the General Assembly and the Security Council, should consider what further action is required to bring to an end the illegal situation resulting from the construction of the wall and the associated régime, taking due account of the present Advisory Opinion",
        "texto": "South Africa beseeches this Court to examine the institutionalized régime of discriminatory laws, policies and practices applied by Israel alongside the definition of the crime of apartheid, and to find that Israel subjects Palestinians to what constitutes an apartheid régime. /n/nThe United Nations should also remain seised of the matter and continuously monitor implementation of any order that the Court may give to end the racial discrimination and apartheid by Israel in the Occupied Palestinian Territory to ensure that the illegal situation is terminated immediately, and to ensure that their resolutions are implemented without delay. Urgent consideration should also be given, in particular, to the re-establishment of the Special Committee on Apartheid, with respect to the Occupied Palestinian Territory that will be seised with this matter."
    }
]