[
    {
        "voto": 1,
        "juez": "Sudan",
        "pregunta": "Finds that it has jurisdiction to give the advisory opinion requested",
        "texto": "As pointed out by this Court in the Chagos Advisory Opinion, “When the Court is seised of a request for an advisory opinion, it must first consider whether it has jurisdiction to give the opinion requested and if so, whether there is any reason why the Court should, in the exercise of its discretion, decline to answer the request”. /n/nThe jurisdiction of this Court to provide an advisory opinion stems from Article 65, paragraph 1, of its Statute. This Article provides that the Court may give an advisory opinion on any legal question upon the request of any body authorized by or in accordance with the Charter of the United Nations to make such a request. /n/nThe General Assembly has the authority to request an advisory opinion according to Article 96, paragraph 1, of the Charter of the United Nations. This Article stipulates that the General Assembly has the power to ask the International Court of Justice to provide an advisory opinion on any legal question. /n/nIn these proceedings, the Court is first asked to determine the legal consequences arising from the ongoing violation by Israel of the right of the Palestinian people to self-determination, from its prolonged occupation, settlement and annexation of the Palestinian territory occupied since 1967, including measures aimed at altering the demographic composition, character and status of the Holy City of Jerusalem, and from its adoption of related discriminatory legislation and measures. Next, the Court is asked how said policies and practices affect the legal status of the occupation and what legal consequences ensue for all States and the United Nations from this status. /n/nThe General Assembly requests the Court to answer these questions in accordance with, inter alia, the rules and principles of international law, international humanitarian law and international human rights law. /n/nFor these reasons, the Sudan believes that the request has been made in accordance with the Charter and that the questions submitted to the Court are legal in character."
    },
    {
        "voto": 1,
        "juez": "Sudan",
        "pregunta": "Decides to comply with the request for an advisory opinion",
        "texto": "The articulation of objections to the admissibility of a request for an advisory opinion from the General Assembly is not an uncommon occurrence in proceedings before this Court. Nevertheless, the Court has consistently dismissed such objections. /n/nAs recalled by the Court in the Chagos Advisory Opinion, “[t]he fact that the Court has jurisdiction does not mean, however, that it is obliged to exercise it”. /n/nAccording to consistent jurisprudence of this Court, the discretion whether or not to respond to a request for an advisory opinion exists to safeguard the judicial function of the Court as the principal judicial organ of the United Nations. /n/nHowever, the Court is aware that its reply to a request “represents its participation in the Organization, and, in principle, should not be refused”. It is an established jurisprudential principle that this Court may decline to respond to a request for an advisory opinion falling within its jurisdiction only — only — in the presence of “compelling reasons”. The pertinent query at hand is whether there exists any compelling reason for this Court to decline to respond to the request referred by the General Assembly. /n/nThis constitutes a type of argument that this Court has previously considered in other advisory proceedings. For example, in the Nuclear Weapons Advisory Opinion, the Court noted that concerns were raised about the potential negative impact of its response on disarmament negotiations. The Court acknowledged that regardless of its conclusions, they would introduce an additional aspect to the negotiations. However, the Court stated that the ultimate effect of its Opinion is a matter of appreciation and cannot be seen as a compelling reason to refuse exercising its jurisdiction. This jurisprudential principle was confirmed by this Court in the Advisory Opinion on the Wall. /n/nThere is an additional pivotal aspect to address in this context. The two questions central to the ongoing advisory proceedings pertain to the existing conditions in the Occupied Palestinian Territory. The Court is not tasked with determining the content of a final settlement or the precise boundaries of the Palestinian State. /n/nEssentially, the request seeks the Court to provide an authoritative legal opinion on the current legal ramifications of the practices and policies of Israel referred to in the request. The advisory opinion is expected to bear relevance to extant queries regarding legal status and its associated consequences. Such clarification holds the potential to significantly contribute to establishing the groundwork for a prospective negotiated resolution of the underlying conflict, rather than to endanger the established framework for negotiations that have been suspended for several years now. Hence, the Sudan believes that this does not constitute a compelling reason to decline responding to the request./n/nIt is well-established jurisprudence of this Court that the lack of consent to the Court’s contentious jurisdiction by interested States does not impact the Court’s jurisdiction to render an advisory opinion. /n/nThis rationale is exemplified by instances such as when the Court gave its Advisory Opinion on Western Sahara, even in the absence of Spain’s consent to the request; when it delivered the Advisory Opinion on the Wall despite Israel not providing consent; and when it issued the Chagos Advisory Opinion, notwithstanding the absence of consent from the United Kingdom. In each of these instances the Court gave its opinions, even though the requests concerned the responsibility of particular States. /n/nThe General Assembly has consistently played a crucial role in matters concerning Palestine, as evident from the documentation presented in the Secretary-General’s dossier before this Court. The Palestinian people are yet to realize their right to self-determination, a fact that no State can plausibly contest. Therefore, the Sudan believes that the objection to the General Assembly’s exercise of its competence in the realm of self-determination and its consideration of the situation in Palestine is unpersuasive. /n/nIn the light of the foregoing, the Sudan concludes that the Court not only has jurisdiction to give the advisory opinion requested by the General Assembly, but also that there is no compelling reason for this Court to use its discretionary power not to give the opinion. Thank you, Mr. President. Thank you, Members of the Court."
    },
    {
        "voto": 1,
        "juez": "Sudan",
        "pregunta":"The construction of the wall being built by Israel, the occupying Power, in the Occupied Palestinian Territory, including in and around East Jerusalem, and its associated régime, are contrary to international law",
        "texto": "The Sudan is present here today owing to the profound significance of these proceedings in the context of realizing the inalienable right of the Palestinian people to self-determination. This matter has persisted on the United Nations agenda for several decades. /n/nMr. President, Members of the Court, it is evident that these questions concern the legal consequences of violations of international law that have been recognized as such by the Security Council and the General Assembly, among other United Nations organs and bodies, as well as to the legal status of the occupation in view of those violations and the legal consequences of its illegality. /n/nMr. President, distinguished Members of the Court, I wish to emphasize the great significance of the right of peoples to self-determination. In advisory proceedings conducted before this Court, wherein the exercise of this right was a pivotal concern, the Court’s opinion emerged as fundamental elements shaping the legal framework for resolving the underlying disputes, such as the one concerning Namibia. If only we had a comparable equivalent for Palestine. The successful resolution of the protracted dispute surrounding Namibia can be largely attributed to the Court’s judicial task. It is respectfully suggested that you should persist in fulfilling that role in the present advisory proceedings."
    }
]