[
    {
        "voto": 1,
        "juez": "Syrian Arab Republic",
        "pregunta":"The construction of the wall being built by Israel, the occupying Power, in the Occupied Palestinian Territory, including in and around East Jerusalem, and its associated régime, are contrary to international law",
        "texto": "Today, the practices of Israel, the occupying Power, are definitely the clearest reflection — unfortunately — of the failure of the international community to prevent the heinous crime of occupation and to ensure the implementation of the relevant resolutions of the Security Council, the General Assembly and the Human Rights Council. /n/nThe Syrian Arab Republic stresses the need to hold Israel accountable for its grave and continuing violations of the provisions of international law, the Charter of the United Nations and its relevant resolutions, and the provisions of international humanitarian law, including provisions in Section III of the Fourth Geneva Convention of 1949, Articles 47 and what follows. /n/nThe right to self-determination is a fundamental human right that is enshrined, among other international instruments and conventions, in Article 1, paragraph 2, of the Charter of the United Nations, providing that each State shall “refrain from any forced action depriving peoples . . . of their right to self-determination, freedom and independence” and that each State shall “encourage, through joint and unilateral action, the realization of the principle . . . of self-determination of peoples”. /n/nThis right is also reiterated and affirmed in common Article 1 between the Covenant on Economic, Social and Cultural Rights and the International Covenant on Civil and Political Rights, which obliges States that are parties to these Covenants to promote the realization and respect of this right, in accordance with the provisions of the Charter of the United Nations. /n/nIsrael violates this right through, for example, the establishment and continued expansion of illegal settlements in the occupied Palestinian territories, including Jerusalem. We note in particular the discriminatory Israeli legislation of 2018, or what is called the Basic Law: “Israel as the Nation-State of the Jewish People”, which recognizes the right to self-determination exclusively for the “Jewish people”, denying the right of the Palestinian people to self-determination on their land and in their homeland. I shall now turn to talk about the legal consequences. /n/nThe illegal Israeli settlements and the system associated with them are based actually on a dual process: on one hand, the forced displacement of Palestinians and the confiscation of their lands. And on the other hand, the transfer of Israeli settlers and the construction and expansion of settlements on confiscated lands. /n/nInternational humanitarian law prohibits the forced displacement of the occupied people and the transfer of citizens of the occupying Power to the occupied territories, as confirmed by Article 49 of the Fourth Geneva Convention that provides for the protection of civilians in the time of war, thus forced displacement and transfer of citizens by the occupying Power constitute grave violations under Article 147 of the aforementioned Convention. /n/nIndeed, the actual annexation of parts of the occupied Palestinian land is embodied through a continuous gradual process involving the implementation of many measures and actions that include, among others, /n/n(a) settlements’ size, infrastructure, and location, which indicate the purpose to make them sustainable; /n/n(b) “Israeli” government plans and directives that allowed the establishment and expansion of settlements; /n/n(c) the legislation that enacted a dual legal system in the occupied territories in favour of the settlers at the expense of the occupied people, including the “Basic Law” of 2018: “Israel as the Nation State of the Jewish People”. /n/n(d) another example: public statements of Israeli officials demonstrate to the fact that the settlements and the system associated with them constitute a deliberate policy of obtaining a permanent presence for the annexation of the territories and confirm that the actual annexation had already taken place; /n/n(e) the guidelines and coalition agreements of the new Israeli occupation authorities sworn in on 29 December 2022, in which they explicitly declare that the Jewish people have an exclusive and indisputable right to all areas of “Israel” and undertake to strengthen and develop settlements throughout what they called the “land of Israel” — in the Galilee, the Negev, the West Bank — and in the occupied Syrian Golan, despite the confirmation by United Nations Security Council resolution 497 (1981) that provides that “the Israeli decision to impose its laws, jurisdiction and administration in the occupied Syrian Golan Heights is null and void and without international legal effect”. /n/nMr. President, distinguished Members of the Court, in 1980 the Israeli Knesset adopted a “basic law” on Jerusalem, which states that “Jerusalem, whole and united” is the “capital of Israel”, effectively annexing the city, in flagrant violation of international law and of the City’s own international status. /n/nIn response, the United Nations Security Council adopted resolution 478, which declared that “all legislative and administrative measures, and actions taken by Israel, the occupying Power, which have altered or purport to alter the character and status of the Holy City of Jerusalem, and in particular the recent ‘basic law’ on Jerusalem, are null and void and must be rescinded forthwith”. Mr. President, since then, the Israeli occupation authorities have worked to consolidate further annexation instead of reversing it. /n/nSince its inception, “Israel” has adopted various discriminatory legislations aimed to ensuring its control over the maximum geography with the minimum possible number of Palestinians. /n/nThe United Nations Human Rights Council has described the “Israeli” discriminatory measures as “(1) a combination of movement restrictions consisting of the wall, checkpoints, a permit system that affects only the Palestinian population, (2) and the application of a two-tier legal system that facilitated the establishment and consolidation of settlements, (3) and other violations and forms of institutional discrimination”. /n/nThe United Nations General Assembly has always, and for many years, condemned, in a large number of resolutions, the discriminatory policies and practices of “Israel”, the occupying Power, against the Palestinians, as well as the Syrians in the occupied Syrian Arab Golan. These policies and practices include, according to these resolutions, “killing and injuring civilians, arbitrary arrests and detentions, in addition to forced displacement of civilians, transfer of settlers to the occupied Palestinian and Syrian territories, destruction and confiscation of civilian properties and demolishing homes”. /n/nYour honours, in the devastated Gaza Strip, long before 7 October 2023, “Israel” practices racial discrimination towards the Palestinian population in the form of its ongoing blockade. The discriminatory nature of the blockade actually imposed on the Gaza Strip was recognized by the United Nations Committee on the Elimination of Racial Discrimination. This blockade was found to violate the Convention on the Elimination of Racial Discrimination. /n/nThe actions of Israel are part of a large-scale, repressive, organized and systematic régime. Such actions have been identified as apartheid after a thorough factual and legal examination by the United Nations special procedures and by various international organizations. Apartheid is most manifested in the occupied Palestinian territories, including Jerusalem, where illegally located settlers benefit from far-reaching privileges at the expense of the basic rights of the Palestinian people. /n/nThe acts and practices of occupying Powers are strictly regulated by international law and international humanitarian law. Article 49, paragraph 6, of the Fourth Geneva Convention stipulates that “the occupying power shall not deport or transfer parts of its civilian population to the territories it occupies”. /n/nWhile the occupying Power is obliged under international law to administer the territory for the benefit of the people under its occupation, Israel administers the territory only for the benefit of its settlers, and even to ensure the sustainability of the illegal occupation of others’ lands. /n/nWhile annexations or claims of sovereignty over territories under the interim administrative authorities of the occupying Power are strictly prohibited, Israel has sought to exercise fait accompli sovereignty over Jerusalem and the occupied Arab territories. /n/nMr. President, distinguished Members of this honourable Court, we believe, in the first place, that the Israeli occupation, in and of itself, should be considered absolutely illegal, and that we should not be satisfied with only and merely describing its practices and policies. Allow me now to move to the legal consequences. /n/nHonourable judges, the Syrian Arab Republic reaffirms the principle that States shall not obtain legal rights from unilateral acts that do not comply with international law. Syria also re-emphasizes the temporary nature of the occupation, and that even if it is a fait accompli, this does not and will not give the occupying Power the right to acquire sovereignty over the occupied territories, no matter how long this brutal occupation lasts. /n/nIsrael is not only committing the horrendous acts that we have just mentioned, but we are currently witnessing Israel committing genocide in the occupied Gaza Strip, attacking Syria, attacking Lebanon, and committing war crimes and crimes against humanity. In fact, one of the reasons for Israel’s consideration of itself as being above the law is that it has been carrying out illegal occupation and committing crimes for 75 years, without facing accountability or any sort of consequences."
    },
    {
        "voto": 1,
        "juez": "Syrian Arab Republic",
        "pregunta": "Israel is under an obligation to terminate its breaches of international law; it is under an obligation to cease forthwith the works of construction of the wall being built in the Occupied Palestinian Territory, including in and around East Jerusalem, to dismantle forthwith the structure therein situated, and to repeal or render ineffective forthwith all legislative and regulatory acts relating thereto, in accordance with paragraph 151 of this Opinion",
        "texto": "Israel must be held accountable for its violations of international law and United Nations resolutions. Israel must put an immediate end to the violation of its international obligations by halting all actions and measures that prevent and/or impede the exercise of the Palestinian peoples’ right to self-determination, including putting an immediate end of the occupation in all its forms. /n/nIsrael is obliged to immediately repeal all legislations aimed at or leading to the maintenance and perpetuation of apartheid and racial discrimination against the Palestinian people. This includes the termination of its settlement activities, the cessation of all discriminatory policies and practices, along with due compensation to all those affected by these policies and practices, including Palestinian refugees. /n/nThe legal consequences constitute Israeli commitment to an immediate and unconditional end to its occupation of the Arab territories in Palestine and the rest of the occupied Arab territories, including the Syrian Arab Golan, in addition to providing compensation to all those affected."
    },
    {
        "voto": 1,
        "juez": "Syrian Arab Republic",
        "pregunta": "Israel is under an obligation to make reparation for al1 damage caused by the construction of the wall in the Occupied Palestinian Territory,including in and around East Jerusalem",
        "texto": "I shall now talk about the legal consequences. Israel is obliged to immediately stop all its violations of its legal obligations in Jerusalem and all other occupied Palestinian territories. The cessation of such violations entails, inter alia, the dismantling of illegal structures, including settlements and the apartheid wall, the cancellation or deactivation of all legislative and regulatory acts adopted by Israel with the aim of building illegal settlements and normalizing said system. Also, “Israel” is obliged to make reparation for the damage caused to individuals concerned, through restitution and compensation."
    },
    {
        "voto": 1,
        "juez": "Syrian Arab Republic",
        "pregunta": "All States are under an obligation not to recognize the illegal situation resulting from the construction of the wall and not to render aid or assistance in maintaining the situation created by such construction; all States parties to the Fourth Geneva Convention relative to the Protection of Civilian Persons in Time of War of 12 August 1949 have in addition the obligation, while respecting the United Nations Charter and international law, to ensure compliance by Israel with international humanitarian law as embodied in that Convention",
        "texto": "For third States, since the right to self-determination is an erga omnes argument and obligation on all subjects of international law, all States must respect it and seek to achieve it. It is also the responsibility of all States, consistent with respect for the United Nations Charter and international law, to immediately put an end to the obstruction of the Palestinian peoples’ exercise of their right to self-determination. /n/nRegarding the legal consequences for third States: The United Nations General Assembly, in its resolution 77/25, called on all States, inter alia: /n/n(a) First, not to recognize any alterations to the pre-1967 borders, and to ensure that agreements with “Israel” do not imply recognition of Israeli sovereignty over the territories occupied by Israel in 1967. /n/n(b) Second, not to provide aid or assistance to illegal settlement activities, specifically with settlements in the occupied Arab territories of Palestine and the Golan, in line with Security Council resolution 465 (1980). /n/nFor third States, they must not recognize this illegal situation and must not provide any help or assistance in any way that may sustain and maintain this situation. /n/nFor third States, it is imperative to commit to support all efforts exerted to end the illegal occupation without delay and to refrain from any actions that contribute to maintaining the illegal situation. /n/nToday, it has become imperative for all States to convince or to show Israel, the occupying Power, by all possible legal means, that it does not have a green light to annex more occupied territories, expel their indigenous people and build more illegal settlements. Most importantly, convincing and showing Israel that there will be no peace, no security or stability for all and, equally, without ending the occupation and establishing a viable and sustainable Palestinian State that possesses full components and authorities like all Member States of the international community. /n/nThe continuance of these violations means more Israeli escalations vis-à-vis the Palestinian people exercising their legitimate right to resist the occupation."
    },
    {
        "voto": 1,
        "juez": "Syrian Arab Republic",
        "pregunta": "The United Nations, and especially the General Assembly and the Security Council, should consider what further action is required to bring to an end the illegal situation resulting from the construction of the wall and the associated régime, taking due account of the present Advisory Opinion",
        "texto": "The United Nations, in particular the General Assembly and the Security Council, should consider the additional procedures and binding international legitimacy tools stipulated in the Charter that are required to put an immediate end to any obstruction preventing the Palestinian people from obtaining their right to self-determination, and to take the necessary measures in order to ensure the implementation of its relevant resolutions without any further delay. /n/nRegarding the legal consequences for the United Nations: the Organization, in particular the General Assembly and the Security Council, should consider the additional measures and binding international legitimacy tools stipulated in the Charter that are required to immediately end the illegal occupation and take the necessary measures to ensure the implementation of its relevant resolutions without any further delay. /n/nThe United Nations, especially the General Assembly and the Security Council, and the international organizations, should consider the additional measures required to end the apartheid system established by Israel and should take the necessary measures to ensure the implementation of its relevant resolutions without further delay. /n/nFor the United Nations, in particular the General Assembly and the Security Council, it should consider the additional measures and binding international legitimacy tools stipulated in the Charter that are required to ensure the implementation of their relevant resolutions without any further delay, including the immediate and unconditional end to the Israeli occupation of the occupied Arab territories in Palestine and the Syrian Golan. /n/nSyria reiterates that the stability of the Middle East and the credibility of the United Nations system, including the esteemed Court, require taking measures to ensure the implementation of all relevant international resolutions to end the Israeli occupation of all occupied Arab territories, in accordance with the relevant United Nations resolutions."
    }
]