[
    {
        "voto": 1,
        "juez": "Turkey",
        "pregunta":"The construction of the wall being built by Israel, the occupying Power, in the Occupied Palestinian Territory, including in and around East Jerusalem, and its associated régime, are contrary to international law",
        "texto": "Now, the International Court of Justice has also a case before it against Israel concerning violations of its obligations under the 1948 Convention on the Prevention and Punishment of the Crime of Genocide. /n/nPalestinian people live in extremely difficult conditions under Israel’s suffocating occupation. Israel’s decades-long occupation has not only led to deprivation of Palestinian people of their fundamental rights, but also made them dependent on Israel’s mercy. Their properties are demolished, their land is usurped, their livelihoods are confiscated. Although they are living in the twenty-first century, the practices they have been subjected to are from the Middle Ages and sometimes even worse. Today, the Palestinian people only need emancipation and dignity. /n/nIsrael’s ongoing occupation and Israel’s ongoing and deliberately prolonged occupation and intransigent policies failing all initiatives have also left the Palestinians, who were expelled from homeland to neighbouring countries, in limbo, in despair and hopelessness  generation after generation. /n/nWe believe that all the unilateral acts and measures by Israel aimed at changing the character and status of the occupied Palestinian territories, including East Jerusalem, constitute a breach of international law and must be unconditionally rescinded. /n/nBy the same token, the situation in the occupied territories has not improved, despite numerous resolutions that the United Nations General Assembly and Security Council resolutions adopted over decades. Israel’s unlawful unilateral actions, that are considered null and void in many of the United Nations resolutions, are continuously putting the two-State vision in jeopardy. /n/nUnlawful settlement activity has intensified to the extent that it is now extremely difficult to mention contiguity of the occupied Palestinian territories, including East Jerusalem, which is a key to a lasting peace. /n/nTransfer of Israeli population in the form of settlements has been changing the demographic composition of the occupied territories. Demolition of houses of the Palestinians as well as forcible evacuations continue under the protection of the Israeli security forces. Also, settler violence is increasing day by day against native Palestinians. /n/nLocated in East Jerusalem, the Al Aqsa Mosque compound, or Haram Al-Sharif, is among the holiest sites for Muslims around the world. Therefore, its sanctity as a Muslim shrine must be upheld as sacrosanct at all times. /n/nThe historical status quo at the holy places in Jerusalem, including in Haram Al-Sharif was established during the Ottoman era and has remained in place ever since. /n/nOn 4 April 2023, Israeli security forces stormed the Al Aqsa Mosque, beat up worshippers and detained hundreds of them altogether during the holy month of Ramadan. This kind of brutal practice is becoming commonplace. /n/nOn 5 June 1967, Israel launched a military offensive and occupied the Gaza Strip, the West Bank and East Jerusalem illegally. In the following period, several United Nations Security Council1 and General Assembly resolutions affirmed that acquisition of territory by military conquest is inadmissible under international law and “confirmed that all legislative and administrative measures and actions taken by Israel which purport to alter the status of Jerusalem, including expropriation of lands and properties thereon, are invalid and cannot change that status”. /n/nMr President, distinguished Members of the Court, basically, Israel is the occupying Power in the occupied Palestinian territories and under the obligation to abide by international law. Therefore, any Israeli acts and/or measures executed in the occupied Palestinian territories in breach of international law should be considered null and void. The practices as well as acts and measures violating human rights must be held to account. /n/nSince 7 October, more than 30,000 Palestinians have been killed so far in Israel’s indiscriminate attacks on Gaza. Most of them are women and children. 2.3 million civilians have been placed under full blockade by Israel, depriving them of their basic needs to survive, such as water, food, medicine, fuel and electricity. Hospitals, refugee camps, schools, places of worship, churches and mosques have been targeted unsparingly. Around two million Palestinians have been forcibly displaced."
    },
    {
        "voto": 1,
        "juez": "Turkey",
        "pregunta": "Israel is under an obligation to terminate its breaches of international law; it is under an obligation to cease forthwith the works of construction of the wall being built in the Occupied Palestinian Territory, including in and around East Jerusalem, to dismantle forthwith the structure therein situated, and to repeal or render ineffective forthwith all legislative and regulatory acts relating thereto, in accordance with paragraph 151 of this Opinion",
        "texto": "The same especially goes for the policies and practices of Israel in Jerusalem and the holy places. Any Israeli act and measure aimed at altering the character and status of the City of Jerusalem, and of the holy places, including Haram Al-Sharif, should be considered null and void and must be ended and rescinded immediately. /n/nThe Republic of Türkiye reiterates its firm support to a negotiated two-State solution based on the United Nations resolutions, thus the establishment of an independent, sovereign and contiguous State of Palestine on the pre-5 June 1967 lines, with East Jerusalem as its capital"
    },
    {
        "voto": 1,
        "juez": "Turkey",
        "pregunta": "All States are under an obligation not to recognize the illegal situation resulting from the construction of the wall and not to render aid or assistance in maintaining the situation created by such construction; all States parties to the Fourth Geneva Convention relative to the Protection of Civilian Persons in Time of War of 12 August 1949 have in addition the obligation, while respecting the United Nations Charter and international law, to ensure compliance by Israel with international humanitarian law as embodied in that Convention",
        "texto": "Furthermore, the United Nations Security Council “censured in the strongest terms all measures taken to change the status of the City of Jerusalem”. The United Nations General Assembly in its resolution2 of 4 July 1967 also considered measures taken by Israel to change the status of the City of Jerusalem totally invalid. It called upon Israel to rescind all measures already taken and to desist forthwith from taking any action which would alter the status of Jerusalem. The United Nations General Assembly resolution3 of 14 July 1967 also reiterated this call. /n/nIn response to this, the United Nations Security Council resolution 478 (1980) affirmed that “the enactment of the ‘basic law’ by Israel constitutes a violation of international law” and “determine[d] that all legislative and administrative measures and actions taken by Israel, the occupying Power, which have altered or purport to alter the character and status of the Holy City of Jerusalem, and in particular the recent ‘basic law’ on Jerusalem, are null and void and must be rescinded forthwith”. /n/nThe United Nations Security Council also “censured [condemned] in the strongest terms the enactment by Israel of the ‘basic law’ on Jerusalem and the refusal to comply with relevant Security Council resolutions”. Furthermore, the Council “decided not to recognize the ‘basic law’ and such other actions by Israel that, as a result of this law, seek to alter character and status of Jerusalem”. /n/nIn the same vein, the General Assembly in several resolutions regarding the adoption of the basic law expressed its strong rejection of any changes to the status of Jerusalem. Also, the resolution adopted by the General Assembly on 30 November 20224 called upon all States, consistent with their obligations under the United Nations Charter and relevant Security Council resolutions: “(a) Not to recognize any changes to the pre-1967 borders, including with regard to Jerusalem, other than those agreed by the parties through negotiations, including by ensuring that agreements with Israel do not imply recognition of Israeli sovereignty over the territories occupied by Israel in 1967; (b) To distinguish, in their relevant dealings, between the territory of the State of Israel and the territories occupied since 1967”."
    },
    {
        "voto": 1,
        "juez": "Turkey",
        "pregunta": "The United Nations, and especially the General Assembly and the Security Council, should consider what further action is required to bring to an end the illegal situation resulting from the construction of the wall and the associated régime, taking due account of the present Advisory Opinion",
        "texto": "Türkiye calls for the full implementation of the provisional measures indicated by the Court and we hope that the Security Council will uphold its responsibility to enforce it at least in these critical conditions in respect of the Court. /n/nThe Court’s advisory opinion on the current file will remind the international community, once again, of the legal consequences arising from the Israeli occupation of the Palestinian territories, including East Jerusalem, and the gravity of the situation in whole Palestine. /n/nSeveral resolutions of the United Nations Human Rights Council also expressed grave concern at the restrictions imposed by Israel that impede the access of Christian and Muslim worshippers to holy sites in the occupied territories. /n/nHuman Rights Council resolutions demanded Israel, as the occupying Power, cease all illegal actions in the occupied Palestinian territories. This included excavations in and around religious and historic sites and all other unilateral measures aimed at altering the character, status and demographic composition of the territory as a whole, all of which have, inter alia, a grave and detrimental impact on the human rights of the Palestinian people and the prospects for a just and peaceful settlement."
    }
]