[
    {
        "voto": 1,
        "juez": "United Arab Emirates",
        "pregunta": "Finds that it has jurisdiction to give the advisory opinion requested",
        "texto": "The General Assembly and the Security Council, through dozens of resolutions, have entrenched the two-State solution as the basis for peace. This vision necessarily includes the Gaza Strip as part of the Palestinian State, as reaffirmed most recently by the Security Council in resolution 2720 of 22 December 2023.\n\nThe viability of this vision of peace and of an independent Palestinian State are imperilled by Israeli violations that are the subject of the present proceedings. Since the General Assembly’s request to the Court in December 2022, these violations and the level of violence have risen sharply.\n\nWe convene today while Israel’s grave violations against Palestinians persist with impunity, four months into its military operation in Gaza and following four failures by the Security Council to call for a ceasefire. Meanwhile, an increasingly brutal Israeli régime of systemic subjugation in the West Bank compounds Palestinian suffering. The horrors that have unfolded over the last few months, the 7 October attack on Israel, the destruction of the Gaza Strip, and the oppression in the West Bank underscore the desperate need for realizing the two-State solution. In the context of this grim reality, the Court’s advisory opinion is appropriate, it is urgent, and it is necessary.\n\nFar from prejudicing the negotiating framework, the Court’s opinion will reinforce the contours of the two-State solution. Indeed, that solution must be consistent with international law. In the Wall Opinion, the Court recognized that a negotiated solution and the establishment of a Palestinian State, alongside Israel, must be on the basis of international law57. This is also what the Security Council reaffirmed most recently in resolution 2720.\n\nThese pronouncements make clear that a negotiating process could not, and must not, lead to a result that is contrary to international law. And it is self-evident that a negotiating process that results in the contravention of peremptory norms of general international law would be void. By their very nature peremptory norms are non-negotiable. The fact that a solution is negotiated does not mean that it should not be principled.\n\nBy responding to the questions posed by the General Assembly as regards Israel’s violations and their consequences, the Court will be advising on legal questions directly relevant to the two-State solution. In so doing, the Court will aid efforts to realize the right of the Palestinian people to self-determination. This could not be more pressing.\n\nMoreover, as the State of Palestine observed in its oral statement on Monday60, the Court’s exercise of its advisory function can and has served to advance deadlocked negotiations, as occurred with its Chagos Opinion. There is a similar need for the Court’s advice on the Palestinian question, which is characterized by prolonged stalemate and frustrated negotiations while Israel continues to change facts on the ground."
    },
    {
        "voto": 1,
        "juez": "United Arab Emirates",
        "pregunta": "The construction of the wall being built by Israel, the occupying Power, in the Occupied Palestinian Territory, including in and around East Jerusalem, and its associated régime, are contrary to international law",
        "texto": "Mr President, the 56 years of occupation of Gaza and the West Bank, including East Jerusalem, have been shaped by Israel’s consistent grave violations against the Palestinian people. The UAE is confident that the Court has before it ample evidence to assist its identification of those violations and determination of their legal consequences. As I turn to my second point, I will outline briefly how the situation has severely deteriorated since July 2023.\n\nUnder international law, the Gaza Strip is occupied territory61. Gaza is also one of the most densely populated places on Earth.\n\nFor over four months now, and after enduring 17 years of blockade, its population of over 2.2 million has been under siege, faced with severe restrictions on water, food and other essential goods. The level of human suffering faced by civilians in Gaza, predominantly women and children, is on a scale seldom seen in the modern era.\n\nIsrael’s indiscriminate attacks on the Gaza Strip have caused massive civilian casualties and the extensive destruction of homes, schools and hospitals. Some 75 per cent of Gaza’s total population is displaced. I note here, Mr President, the latest orders issued to the Israeli Defense Forces to plan for the evacuation of Rafah ahead of another military offensive. That offensive would leave the approximately 1.5 million displaced Gazans taking refuge in the city with nowhere to go. These plans have been met with the international community’s resounding rejection.\n\nIsrael has imposed a policy of collective punishment against the Palestinian people, in violation of Article 33 of the Fourth Geneva Convention. Israel has repeatedly issued so-called evacuation orders that in effect seek to transfer Palestinians forcibly, in violation of Article 49 of the Fourth Geneva Convention.\n\nIsrael has also failed its duty of ensuring the food and medical supplies of the population in Gaza, in violation of Article 55 of the Fourth Geneva Convention. Israel has further failed to protect the wounded and the sick, in violation of Article 16 of the Fourth Geneva Convention.\n\nEach passing day is met with further violations of international humanitarian law.\n\nAnd while the eyes of the world are trained on its brutal military operation in Gaza, Israel’s violations in the West Bank have intensified. As submitted to the Court, a number of Israeli acts in the West Bank, including East Jerusalem, constitute grave breaches under the Fourth Geneva Convention62. Israel’s conduct also violates the right of the Palestinian people to self-determination, which lies at the heart of these proceedings63.\n\n2023 was by far the deadliest year for Palestinians in the West Bank since the United Nations began keeping records — more than tripling the previous high in 202264.\n\n2023 also saw the highest levels of settler violence yet recorded by the United Nations65. The freedom of movement of Palestinians has been severely impacted, including for Palestinian farmers seeking to harvest their lands in the West Bank66. Demolitions of Palestinian property have also reached their highest levels. This puts into stark relief the magnitude of this latest iteration of the Israeli settlement enterprise that erodes key components of the Palestinian people’s right to self-determination, including the denial of access to ancestral lands and control over natural resources.\n\nIn addition, there has been an intensification of Israeli settlement construction that undermines the viability of the two-State solution. According to the Secretary-General, 2023 saw the highest reported level of Israeli approvals and support for settler housing in the West Bank, including East Jerusalem.\n\nI raise these recent developments to underline that the violations at the core of the questions posed by the General Assembly are not static. After decades of violent dehumanization, dispossession and despair, the breaches resulting from the Israeli occupation in all parts of the Occupied Palestinian Territory are worsening at an alarming pace.\n\nI will now focus on Israel’s long-standing violations in East Jerusalem."
    },
    {
        "voto": 1,
        "juez": "United Arab Emirates",
        "pregunta": "Israel is under an obligation to terminate its breaches of international law; it is under an obligation to cease forthwith the works of construction of the wall being built in the Occupied Palestinian Territory, including in and around East Jerusalem, to dismantle forthwith the structure therein situated, and to repeal or render ineffective forthwith all legislative and regulatory acts relating thereto, in accordance with paragraph 151 of this Opinion",
        "texto": ". Jerusalem is “a city of unique cultural and religious depth and texture” that has occupied, through history, a place “at the crossroads of cultures and civilizations”.\n\nThe City of Jerusalem has the unique feature of being sacred for all three Abrahamic religions and is home to a host of Holy Places. This feature has put a special imprint on the city’s character. And the international community has accordingly underlined the need to preserve Jerusalem’s unique spiritual and religious dimensions.\n\nIf Jerusalem has throughout its long history represented one thing, it is tolerance. In the words of UNESCO, “[m]ore than any other place in the world, Jerusalem embodies the hope and dream of dialogue between cultures, civilizations and spiritual traditions, a dialogue through which mutual understanding between peoples may flourish”. Such is the unique historical nature of Jerusalem that an Israeli official once cautioned that “[a]nyone depriving Jerusalem of these contrasts, anyone upsetting the equilibrium by trying to make one factor predominant over another would make Jerusalem cease to be herself”.\n\nJerusalem is a place of enormous significance to hundreds of millions of people worldwide. On account of their artistic, religious and historical value, the Old City and the Holy Places are of exceptional importance to all humanity.\n\nJerusalem’s unique character has given rise to specific legal obligations as regards the rights of religious communities, including “specific guarantees of access to the Christian, Jewish and Islamic Holy Places”. Since 1757, it has been the case that whoever holds Jerusalem is bound by this legal and historic status quo.\n\nAs early as 1948, the Security Council urged all governments and authorities concerned “to take every possible precaution for the protection of the Holy Places and of the City of Jerusalem, including access to all shrines and sanctuaries for the purpose of worship”. The concerns that motivated the Council then still remain. In 2023, the Security Council called “for upholding unchanged the historic status quo at the holy sites in Jerusalem in word and in practice”.\n\nIsrael has, in agreements with Jordan and with the Holy See, committed to the historic status quo and freedom of access to the Holy Places in Jerusalem. In the Wall Opinion, the Court relied on such bilateral agreements, observing that they were part of the specific guarantees of access to Holy Places.\n\nIt is therefore gravely disconcerting that Israel has taken, and continues to take, measures which undermine the special character of Jerusalem and erase its cultural heritage.\n\nIsrael is in breach of its obligations by repeatedly interfering with the Holy Places and hindering freedom of access to them. Since the start of the occupation in 1967, Muslims and Christians have been impeded from worshipping at their holiest sites.\n\nAlso in breach of the historic status quo are Israel’s excavations in Jerusalem. Excavations and tunnelling, particularly in and around the Old City, imperil its historical, cultural and religious character.The works are carried out despite the serious risks to the integrity of Muslim and Christian Holy Places. The General Assembly has determined that these acts are flagrant violations of the Fourth Geneva Convention.\n\nTurning to the question of settlements, the “ring” settlements in East Jerusalem contribute to “the further isolation of the city from the rest of the Occupied Palestinian Territory”. They thereby undermine the viability of East Jerusalem as the capital of an independent Palestinian State. This is fast becoming a fait accompli.\n\nMr President, Israel’s measures to extend its administration and laws to East Jerusalem are inconsistent with the most fundamental tenets of the law of occupation and the right to self-determination. Indeed, Israel’s administration of East Jerusalem constitutes annexation of territory on which the Palestinian people have the right to self-determination. International law is unequivocal in this respect: all measures by Israel that affect or aim to alter the status of East Jerusalem are null and void and have no legal effect on its status.\n\nBy resolution 478 of 1980, the Security Council affirmed that Israel’s enactment of the Basic Law was a violation of international law. Resolution 478 was plainly intended to be legally binding on Israel and all United Nations Member States. A binding determination by the Security Council to the effect that a situation is illegal must have consequences. As the Court noted in the Namibia opinion, “it would be failing in the discharge of its judicial functions if it did not declare that there is an obligation to bring [such a] situation to an end”.\n\nIsrael’s violations in East Jerusalem and throughout the Occupied Palestinian Territory threaten the viability of the two-State solution and go to the very nature of the occupation.\n\nIt is in this context that I come to the legality of the occupation itself. The Security Council reaffirmed in 1980 “the overriding necessity for ending the prolonged occupation of Arab territories occupied by Israel since 1967”. The General Assembly has declared that “the Arab territories occupied since 1967 have continued to be under illegal Israeli occupation”.\n\nIsrael’s occupation is — as the vast majority of participants in these proceedings have recognized — illegal and must end. Israel’s occupation breaches the requirement, under the law of occupation, that an occupation must be temporary and cannot become permanent. It is in breach of the cardinal principle, enshrined in the Charter of the United Nations, that the acquisition of territory by war is inadmissible. Israel’s occupation furthermore violates peremptory norms of general international law, such as the Palestinian people’s right to self-determination. Mr President, whether the illegality of Israel’s occupation is determined under general international law or under the Charter, the conclusion is the same: it is illegal.\n\nIsrael’s illegal acts cannot remain without consequence. Which takes me to my last point."
    },
    {
        "voto": 1,
        "juez": "United Arab Emirates",
        "pregunta": "Israel is under an obligation to make reparation for all damage caused by the construction of the wall in the Occupied Palestinian Territory, including in and around East Jerusalem",
        "texto": "Mr President, distinguished Members of the Court, I will now address the legal consequences of the ongoing violations by Israel.\n\nI wish to draw the Court’s attention to the obligations identified by the Court in the Chagos and Wall Opinions. First, Israel has, inter alia, an obligation to comply with the primary obligations it has breached; an obligation to ensure cessation of those breaches; and an obligation to make reparation for the damage caused by those breaches. Let me illustrate these obligations with a few examples.\n\nThis means that Israel must cease all policies and practices impeding the exercise of the Palestinian right to self-determination and repeal all laws and regulations that aim to alter the demographic composition, character and status of East Jerusalem. It also means that Israel must ensure freedom of access to the Holy Places and respect the legal and historic status quo.\n\nThis means that Israel must comply with all its obligations as the occupying Power in the Occupied Palestinian Territory, in East Jerusalem, the West Bank, and the Gaza Strip. For example, Israel must bring into the Gaza Strip the necessary food and medical supplies to the Palestinian population, and it must end its siege and all practices depriving Palestinians of supplies essential to their survival. In practical terms, it must mean a ceasefire.\n\nIt also means that Israel must stop its so-called evacuation orders and forcible transfers of Palestinians. It means that Israel must dismantle settlements in the Occupied Palestinian Territory and must prevent violence perpetrated by settlers — many of them armed — against Palestinians. And it means that Israel must put an end to its settlement activities, its confiscation of land, demolition of homes, and the transfer of new Israeli settlers to the Occupied Palestinian Territory.\n\nFinally, Israel must also comply with all decisions of the Security Council, in line with Article 25 of the United Nations Charter. This includes the binding decisions in resolutions 478, 2334, 2712 and 2720."
    },
    {
        "voto": 1,
        "juez": "United Arab Emirates",
        "pregunta": "All States are under an obligation not to recognize the illegal situation resulting from the construction of the wall and not to render aid or assistance in maintaining the situation created by such construction; all States parties to the Fourth Geneva Convention relative to the Protection of Civilian Persons in Time of War of 12 August 1949 have in addition the obligation, while respecting the United Nations Charter and international law, to ensure compliance by Israel with international humanitarian law as embodied in that Convention",
        "texto": "The UAE further submits that the erga omnes and jus cogens character of norms violated by Israel also give rise to obligations for all States. First, no State may recognize as lawful the situation resulting from Israel’s unlawful conduct nor render assistance to maintain such a situation. Second, States are under an obligation to co-operate to bring to an end Israel’s serious breaches. Additionally, States parties to the Geneva Conventions must ensure respect for those Conventions.\n\nThese obligations may translate into different actions from one State to another. The UAE believes that diplomatic engagement and dialogue can be effective tools to encourage compliance and cessation of unlawful conduct. But where these tools fail, third States’ obligations remain, as do the other instruments of the international system, including the General Assembly, the Security Council, and the Court that sits in this Great Hall of Justice.\n\nAs the Permanent Representative of a country that has just completed its term on the Security Council, I wish to invite the Court to consider the following: the obligations to co-operate and to ensure respect for international law carry implications for States in the exercise of their vote on the Security Council. Voting against or preventing the adoption of a Security Council resolution that seeks to put an end to serious breaches of international law cannot be compatible with such obligations.\n\nIsrael’s violations also have implications for international organizations. The organs of the United Nations can and should take all steps within their respective mandates with a view to ensuring an end to those violations. The UAE remains firmly committed to play its part in supporting the principles of international law which underpin the international system.\n\nThe UAE considers that the Court’s advice on the questions before it is critical. Indeed, we believe it matters for all States — large and small — who rely upon and seek to preserve our international order. The reason it matters is quite simple: the even-handed application of international law is essential if that order is to function. To allow otherwise, to permit States to pick and choose what international law to apply and when, risks destabilizing our international order."
    }
]
