[
    {
        "voto": 0,
        "juez": "United Kingdom",
        "pregunta": "Finds that it has jurisdiction to give the advisory opinion requested",
        "texto": "The Court has held consistently that its advisory jurisdiction cannot be used to undermine the fundamental requirement of State consent. Further, it should not provide “a form of judicial recourse” for parties2. Nor should the Court resolve disputes between parties using its advisory jurisdiction3. Instead, the Court’s advisory function is “to offer legal advice to the [UN] organs . . . requesting the opinion”4, “in order to assist them in their activities”5. /n/n Let me be clear: the United Kingdom does not submit that a State whose rights or duties may be affected by an opinion can prevent the Court from giving an opinion. Rather, consistent with the Court’s jurisprudence, the United Kingdom’s submission is that where a request is “directly related to the main point”6 of a dispute between two parties, then the Court should refrain from giving an opinion. In the words of the Court in Western Sahara, to give an opinion in such a case “would have the effect of circumventing the principle that a State is not obliged to allow its disputes to be submitted to judicial settlement without its consent”7. /n/nIf the Court were to answer the request as currently formulated, it would entail a breach of the non-circumvention principle. /n/nThe United Kingdom makes four key points: /n/n(1) The first point relates to the nature and content of the bilateral dispute. It is more than a mere “difference of views”8. It is a dispute of acute sensitivity. It is long-standing. It concerns the status of Israel’s occupation, issues of security and the conditions under which Israel can and should withdraw from the Occupied Palestinian Territories9. /n/n(2) Second, the request engages that core dispute. The General Assembly asks the Court to consider in express terms and rule on both the “legal status” of the occupied territories and the “legal consequences” of that status. The Court is also invited to make findings of Israeli responsibility in relation to its “policies and practices”. This engages key “permanent status issues” which are at the heart of the Israeli-Palestinian dispute, including on “Jerusalem”, on “settlements”, on “security arrangements” and on “borders”10. Indeed, a key Participant has described the Assembly’s request as “taking the entire Palestine question to be looked at by the highest court in the globe”11. /n/n(3) The third point concerns the relief requested. The Court is asked to determine that Israel’s occupation is unlawful and to order that Israel should withdraw immediately from the occupied territories as a result12. Over the course of this hearing, the Court has repeatedly been requested to order Israel’s “immediate, unconditional and total” withdrawal13. This repeated insistence further demonstrates that the Court is being asked to decide the “main point of the dispute”, which several States recognize14. /n/n(4) Finally, Israel has not consented to the main points of the dispute being resolved by this Court15. To the contrary, it has asked the Court to refuse to respond to the request16. Given the content of the request as currently formulated, there is thus no basis on which the Court should answer it. /n/nFirst, they say the Court can determine key issues relating to the parties’ bilateral dispute because it is of broader concern to the United Nations. Their argument relies on the Court’s recognition in the Wall Opinion17 that the General Assembly has a “permanent responsibility towards the question of Palestine”18. The result, they say, is that the request arises in a “much broader frame of reference than a bilateral dispute”19. /n/nWith respect, the United Kingdom disagrees. The General Assembly’s consideration of a bilateral dispute does not mean that the non-circumvention principle is inapplicable. If it did, the principle would never apply in any advisory proceedings, since any bilateral dispute on which the Assembly made a request would always fall within the so-called “broader frame of reference”20. Such an approach would deprive the non-circumvention principle of all practical application. /n/nThis approach of the United Kingdom is consistent with the Wall Opinion. That opinion did not concern the core aspects of the Israeli-Palestinian dispute. The Court itself accepted that it could not properly address what it referred to as “the greater whole” of the dispute21. Judge Higgins characterized that approach as “wise and correct”22. Judge Koroma was careful to distinguish the request in the Wall case from any such broader request that concerned “the Israeli-Palestinian conflict as such” or “its resolution”23. And Judge Owada accepted that the Court’s answer should not “be tantamount to adjudicating on the very subject-matter of the underlying concrete bilateral dispute that currently undoubtedly exists between Israel and Palestine”24. /n/n A related point that several Participants have advanced is that the Israeli-Palestinian dispute is multilateral in character because it concerns erga omnes obligations25. The fact that a bilateral dispute may involve obligations in which States have a collective interest does not obviate the need for consent for that dispute to be resolved before the Court. Nor does it change the fact that there are two participants involved in that bilateral dispute. /n/nThe second counter-argument on non-circumvention is that the non-binding nature of advisory opinions means that a Court can opine on a bilateral dispute26. Like the first argument, this would deprive the non-circumvention principle of all practical application. By definition, Mr President, all advisory opinions are non-binding and so the principle would never apply in any advisory proceedings. /n/nThis ignores that the Court is being asked to make findings about Israel’s liability and responsibility for various alleged breaches of international law that are central to the bilateral dispute. The Court would in substance be deciding on the “main points” of the dispute if it were to answer the request as formulated, and that is precisely the problem that the non-circumvention principle is intended to avoid. /n/nThis submission also ignores that serious legal consequences may result from the Court’s findings27. This risk is even more pronounced since several Participants ask the Court to make legal determinations for the express purpose of clarifying the law relevant to the parties’ negotiations28. /n/nIn sum, the principle of non-circumvention is engaged in this case. Mr President, Members of the Court, if this fundamental legal principle is ever to have any real meaning or application, the Court must decline to answer the request as currently formulated."
    },
    {
        "voto": 0,
        "juez": "United Kingdom",
        "pregunta": "Decides to comply with the request for an advisory opinion",
        "texto": "The United Kingdom confines its submissions to relevant matters of legal principle, firmly founded on the Court’s own jurisprudence. We submit that the terms of the request do not allow the Court to give an opinion in a manner consistent with its judicial functions. The United Kingdom will focus today on three key points concerning propriety, which will be developed by Professor Sarooshi. They are: /n/n(1) first, the impact of the non-circumvention principle in this case; /n/n(2) second, the unsuitability of the fact-finding exercise that the Court would have to conduct to answer the request as presently framed; /n/n(3) third, the effect of Security Council resolutions 242 and 338. /n/nEach of these points independently provides a cogent reason for declining to answer the request. /n/nThe Court will have observed that our third reason has occupied a particularly prominent place in the Participants’ oral submissions. Should the Court be minded to issue an opinion, then the United Kingdom would respectfully urge it to reformulate the questions to concentrate on the Security Council framework. In this scenario, the Court should focus on assisting the General Assembly in supporting urgent progress towards a negotiated solution. I will address this point in concluding the United Kingdom’s submissions later. /n/nAllow me to highlight a few features of the factual determination process in this case: /n/n(1) The request in the present case makes no attempt to set out its factual basis. This stands in stark contrast to the Wall Opinion. In that case, the request by the General Assembly was based on assumed facts described in a single report by the United Nations Secretary-General31. /n/n(2) As one key Participant accepts, and as the Court’s jurisprudence reflects32, this means that “it is for the Court, in exercising its judicial function, to independently evaluate the factual materials that have been submitted to it”33. /n/n(3) In this case, the request asks the Court to determine a long list of legal issues and make the necessary factual findings to support them. This is by reference to the entire factual record stretching back some 57 years and a United Nations dossier spanning nearly 30,000 pages34. /n/n(4) As a matter of practicality, it is unclear how the Court can properly make the broad range of findings required to answer the request and consider such a volume of material especially when exercising its advisory jurisdiction where the Court cannot “fall back upon considerations of burden of proof”35. /n/n(5) It is no answer to assume that the Court can defer to the reports of United Nations bodies36. The Court must reach its own independent findings of fact. We emphasize that several States, including the United Kingdom37, have expressed reservations about these United Nations reports. /n/n(6) The Court’s task is further complicated by a factual landscape that is rapidly shifting in the context of an ongoing and active conflict38. This creates the serious risk that the Court may draw legal conclusions on an incorrect factual basis. /n/n(7) The problem is further heightened by the gravity of the accusations levelled against Israel, where it is not a party and where the proceedings have been expedited39. As this Court has long recognized, “claims against a State involving charges of exceptional gravity must be proved by evidence that is fully conclusive”40. /n/nIn sum, the United Kingdom submits that there is a serious risk that the Court may undermine its judicial function by giving an advisory opinion in such a context. /n/nIn response to this submission, three main points have been raised by other Participants: /n/n(1) First, it is said, the negotiation process has been stalled for some time49. This does not negate the validity of the Security Council framework. Nor does it change the reality that a negotiated solution under the United Nations’ auspices is the only possible way in which this conflict will be resolved. It underscores the need to strengthen that process, rather than undermine it. /n/n(2) Second, some participants50 have referred to the Court’s jurisprudence on whether it should take account of adverse political consequences when considering propriety. The Court’s jurisprudence requires there to be an objective basis to assess the relevance of such consequences51. In this case, there is an objective basis. It is the established Security Council framework52. The General Assembly’s general mandate in respect of the Palestinian question cannot override the Security Council framework. /n/n(3) Third, it is argued that an opinion will not interfere with the Security Council framework or with negotiations conducted under its auspices. Instead, it is claimed, an opinion will assist that process53. Participants rely on the Court’s statement in the Wall Opinion that the negotiations must be conducted “in accordance with international law”54 and equivalent language in Council resolutions55. And so the Court’s legal conclusions can and should, they say, “constrain” the bases on which those negotiations are conducted56. With respect, Mr President, this argument is flawed: /n/n(a) It would undermine the very premise of the Council’s framework if the Court were to address the status of the occupation and require Israel’s withdrawal. As I observed earlier, that framework inextricably links withdrawal with security and applies on a reciprocal basis. An “unconditional” order directed at only one party contradicts that fundamental requirement. It also undermines the additional premise that Israeli withdrawal will be achieved by negotiation, rather than by a Court opinion. /n/n(b) Furthermore, an opinion addressing the parties’ obligations would prejudice their negotiating positions and thus contravene the Court’s injunction in the Interpretation of Peace Treaties and the Western Sahara Advisory Opinions that “the legal position of the parties to [a dispute] cannot be in any way compromised by the answers that the Court may give to the questions put to it”57. /n/nFor these reasons, the United Kingdom respectfully requests the Court to decline the request as presently formulated. /n/nThe United Kingdom agrees with those States that urge the Court not to cause prejudice to the existing Security Council framework64 or to decide any aspect of the parties’ bilateral dispute65. Like other participants66, the United Kingdom recognizes that an alternative route to respect propriety is to reinterpret the request or reformulate its terms. There is no question that the Court has the power to proceed in this way. It has “often been required to . . . interpret and even reformulate the questions put”67. As Judge Tomka has acknowledged, the Court can avoid intruding on a bilateral dispute by narrowing the scope of its answer68. /n/nThe question for the Court is how best to achieve these aims. We propose that the Court’s opinion should focus on endorsing the continued application of the agreed framework, with a view to ensuring its urgent implementation. An answer of this kind would respect the three propriety limitations that we have identified. It would also assist the General Assembly to discharge its mandate on “the Palestinian question”, which many participants have emphasized is the object of this request69. /n/nMore specifically, the United Kingdom in this alternative submission respectfully invites the Court to do the following: /n/n(1) to endorse the continued application of the Security Council framework to both parties and the need for its urgent implementation at the earliest possible opportunity; /n/n(2) to recall both parties’ obligations to respect the terms of the Council’s framework; /n/n(3) to recall both parties’ agreement not to aggravate their dispute by taking any step to change the status or integrity of the Occupied Territories until a negotiated solution is agreed70; and lastly /n/n(4) to reaffirm the parties’ obligations in their interim agreements that they negotiate on permanent status issues. /n/nIn this way, the Court could assist the General Assembly in achieving its stated objective, which is to support urgent progress towards a negotiated solution within the Security Council framework. The United Kingdom reiterates that a negotiated two-State solution is the only way in which the Israeli-Palestinian conflict will be resolved."
    },
    {
        "voto": 0,
        "juez": "United Kingdom",
        "pregunta": "Israel is under an obligation to terminate its breaches of international law; it is under an obligation to cease forthwith the works of construction of the wall being built in the Occupied Palestinian Territory, including in and around East Jerusalem, to dismantle forthwith the structure therein situated, and to repeal or render ineffective forthwith all legislative and regulatory acts relating thereto, in accordance with paragraph 151 of this Opinion",
        "texto": "On 7 October, Israel suffered the worst terrorist attack in its history. Hamas’ terrorist attacks and the ensuing conflict in Gaza have resulted in a tragic and large-scale loss of life and injury to civilians. Palestinians now face a desperate humanitarian crisis in Gaza. The United Kingdom wants to see an immediate suspension of the fighting in Gaza and then progress towards a sustainable and permanent ceasefire. It is essential to ensure irreversible momentum towards a two-State solution, guaranteeing security, justice and peace for both Palestinians and Israelis."
    }
]