[
    {
        "voto": 1,
        "juez": "Jordan",
        "pregunta": "Finds that it has jurisdiction to give the advisory opinion requested",
        "texto": "In  relation  to  substantive  issues  raised  by  that  question  the  various  Written  Statements reveal no significant disagreement.  Jordan feels no need to comment on these issues, and stands by what it said in its Written Statement58.  But the Court’s jurisdiction and its discretionary powers in relation  to  advisory  opinions  have  proved  more  contentious.    Jordan  has  set  out  in  its  Written Statement arguments to show that the Court has jurisdiction to give the requested advisory opinion, and  that  there  are  no  compelling  reasons  for  the  Court  to  decline  to  exercise  that  jurisdiction. While  maintaining  those  arguments,  I  should  just  like  to  add  some  comments  in  response  to arguments to the contrary which have been put forward. /n/n The  starting  point,  Mr. President,  has  to  be  that  (and  here  I  quote  from  the  relevant General  Assembly  resolution)59  “the  United  Nations  has  a  permanent  responsibility  towards  the question  of  Palestine  until  the  question  is  resolved  in  all  its  aspects  in  a  satisfactory  manner  in accordance  with international legitimacy”.  The General Assembly, as one of the principal organs of the United Nations, shares (as does the Court, also one of the principal organs) that “permanent responsibility” for the question of Palestine.  In exercising that responsibility the Assembly is faced with a fact  the construction of the Wall.  It has to know what this implies for its future actions. It has therefore asked the Court, as the Organization’s principal judicial organ, to give an advisory opinion on the legal consequences of that fact.  Nothing could be more natural. /n/nYet  it  has  been  urged  that  the  Court,  notwithstanding  its  responsibilities  as  the  United Nations principal judicial organ, should leave the General Assembly without the advice it needs.  In Jordan’s  submission,  Mr. President  and  Members  of  the  Court,  for  the  reasons  set  out  in  Jordan’s Written  Statement60  that  cannot  be  the  right  course  for  this  Court  to  take.    The  Court  has  never before exercised its discretion so as to decline to give an advisory opinion properly requested by an authorized organ;  and there is no cause for it to do so now. /n/nThe Court’s view of the matter has been remarkably consistent since its pronouncements in  that  case.    In  the  Namibia  case  the  Court  referred  to  a  request  being  “put  forward  by  a  United Nations organ with reference to its own decisions and it seeks legal advice from the Court on the consequences  and  implications  of  these  decisions”64;    in  the  Western  Sahara  case  the  Court  said that “an opinion given by the Court in the present proceedings will furnish the General Assembly with elements of a legal character relevant to its further treatment of the decolonization of Western Sahara”65.  Mutatis mutandis, Mr. President, that is exactly the situation in the present case. /n/nMr. President,  seeking  an  advisory  opinion  in  no  way  interferes  with  the  Council’s primary  responsibilities    especially  when  on  the  matter  in  hand  the  Council  was  unable  to  act because of the negative vote of a Permanent Member.  But in any event, the argument cannot stand. It  is  startling  in  its  implications,  and  without  foundation  in  the  Charter.    If  accepted  it  would  cast serious doubt on the legality of much that the General Assembly has done over the past 37 years in relation to the Occupied Territories.  The Council and the Assembly have overlapping competences,  within  the  limits  of  Article 12  of  the  Charter.    But  that  Article  only  precludes  the Assembly from making a recommendation with regard to a dispute or situation while the Council is exercising its functions in respect of a dispute or situation:  and in this case the Assembly made no recommendation, only a request to another organ of the United Nations for an advisory opinion in the exercise of its specific powers under Article 96 of the Charter. /n/nIn  the  present  case  the  non-consenting  State    Israel    is  a  Member  of  the  United Nations,  and  a  party  to  the  Statute  of  the  Court,  and  has  thus  agreed  to  the  Court’s  advisory procedures.    Moreover,  Israel  has  actively  participated  in  these  proceedings,  both  as  regards  the composition of the Court and by submitting a written statement. /n/nIt  is  suggested,  Mr. President,  that  since  the  General  Assembly  has  already  determined that  the  building  of  the  Wall  is  illegal,  there  is  consequently  no  value  in  the  Court  giving  its advisory opinion on the same matter.  But, Mr. President, a determination by the General Assembly that  a  particular  state  of  affairs  is  illegal  is,  while  indicative  of  an  opinio  juris  on  the  part  of  the international  community80,  it  is  nevertheless  a  determination  by  a  political  organ  of  the  United Nations:  the confirmation, if so it be, of that determination by the United Nations principal judicial organ  does  add  something  of  legal  value  to  what  the  General  Assembly  has  already  said.    The argument  in  any  event  misrepresents  the  question  on  which  the  General  Assembly  has  asked  the Court for its opinion.  The General Assembly’s question is not whether the Wall is illegal, but asks about  the  legal  consequences  of  constructing  the  Wall.    Those  consequences  go  much  wider  than any finding of illegality.  It is the wider consequences, not yet addressed by the General Assembly, upon which the General Assembly seeks the Court’s guidance.  Finally  and this is perhaps the overriding consideration  the General Assembly has asked for an advisory opinion on a matter on which it believes it will be assisted by having the Court’s views before it:  the Court is, indeed, well placed to make a constructive contribution to a difficult situation at the heart of which lie issues of international law.  As the  Court has already indicated, it is for the General Assembly, and not for the  Court,  to  determine  whether  the  General  Assembly  needs  the  advisory  opinion  which  it  has sought and what use to make of it81. /n/nThe  next  line  of  argument  to  be  considered  is  that  the  giving  of  an  advisory  opinion would be unhelpful to the broader peace process within the diplomatic framework of the Road Map because, it is said, it would make the overall negotiating process more difficult. /n/nBut that is a matter about which one can only speculate.  It must not be forgotten that the Court is called upon in these proceedings to consider only a very specific factual situation, on the legal  consequences  of  which  the  Assembly  stands  in  need  of  the  Court’s  opinion.    Speculation about the political consequences which might follow for the peace process is a political matter into which the Court should not allow itself to be drawn. /n/nMoreover,  the  Court  has  already  rejected  the  argument  that  because  the  giving  of  an advisory  opinion  might  have  an  impact  on  some  current  negotiating  process  therefore  the  Court ought to refrain from giving an opinion properly requested of it.  In the Nuclear Weapons case that argument was advanced, and the Court’s response was clear:  “the Court cannot regard this factor as a compelling reason to decline to exercise its jurisdiction”89."
    },
    {
        "voto": 1,
        "juez": "Jordan",
        "pregunta": "Decides to comply with the request for an advisory opinion",
        "texto": "A  second  major  consideration  referred  to  in  a  number  of  written  statements  is  the  impact which the Court’s advisory opinion might have on ongoing international negotiations.  This is said to  be  a  reason  for  the  Court  to  abstain  from  giving  an  opinion.    While  this  argument  will  be addressed in greater detail by counsel for Jordan, there is, Mr. President and Members of the Court, a general point I should like to make. /n/nIn  its  Written  Statement  Israel  has  emphasized  how  many  attempts  it  has  made  to  reach  a peaceful  settlement  of  the  Palestinian  question  since  the  Israeli-Palestinian  talks  in  Oslo  in  1993. Mr. President,  Israel  has  no  monopoly  of  such  attempts.    We  all  want  a  peaceful  settlement.    My country, together with the Palestinians, has been every bit as assiduous in its peace efforts. /n/nThe  Assembly  knew  what  it  was  doing  when  it  decided  to  seek  the  Court’s  opinion  on  a specific legal question, and it took that course for reasons of which it was the best  and only judge. /n/nMr.  President,  the  Assembly  needs the  opinion it  has  requested.    In  the  language  of  the Court  in  the  Reservations  case  “the  object  of  this  request  for  an  Opinion  is  to  guide  the  United Nations in respect of its own action”63.  It is precisely the Assembly’s own future decisions which require  that  it  should  know  the  legal  consequences  of  the  building  of  the  Wall:    only  then  can  it properly decide what action to take. /n/nThe argument has also been made that since under the Charter the Security Council has the  primary  responsibility  for  the  maintenance  of  international  peace  and  security,  therefore  the General Assembly may not take action which interferes with the Council’s exercise of its primary responsibilities  upon which, in the present context, it has been actively engaged for many years and is indeed currently engaged. /n/nThe  Assembly’s  role  in  relation  to  the  maintenance  of  peace  and  security  may  be secondary,  but  it  is  not  non-existent.    It  retains  its  normal  competences  under  the  Charter,  and  its request for an advisory opinion falls fairly and squarely within them. /n/nMoreover, Mr. President, the specific question put to the Court does not directly address a legal question actually pending between two States.  The Court’s advisory opinion will not settle any  existing  bilateral  dispute,  since  it  will  not  deal  with  such  a  dispute:    the  Court’s  opinion  will deal  only  with  a  particular  request  relating  to  certain  legal  consequences  flowing  from  a  given situation;  it will only be “advisory”, and it will only be addressed to the General Assembly. /n/nThe fact that the question put to the Court by the Assembly may have political aspects or motivation, or that the Court’s opinion may when given to the Assembly have implications in the wider  political  arena,  is,  as  the  Court  has  often  indicated,  a  separate  matter  which  does  not  affect the Court’s ability to give its advisory opinion on what is clearly a legal question75.  It is significant that,  on  every  occasion  when  such  an  argument  has  been  raised,  the  Court  has  rejected  it.    In  the Nicaragua case, in 1986, the Court noted that it “has never shied away from a case brought before it  merely  because  it  had  political  implications . . .”76.    It  has  not  done  so  subsequently,  Mr. President, and Jordan submits that it should not start doing so now. /n/nNor can the Court be regarded as being in some way politicized just because it fulfils its judicial function by giving an advisory opinion on a matter with political implications:  the Court, Mr. President  and  Members  of  the  Court,  is  a  more  robust  institution  than  that  suggestion  would imply.  The issue is not the politicization of the Court, but rather emphasizing that the questions for decision are purely legal. /n/nIt  is  also  suggested  that  for  the  Court  to  respond  to  the  question  put  by  the  General Assembly would prejudice progress in the current negotiations for a Middle East peace settlement, which  are  taking  place  on  the  basis  of  the  “Road  Map”,  including  certain  issues  known  as “permanent status” issues. /n/nIt may be that much of the concern felt about the possible impact of the Court’s opinion is based on a fear that the Court might range far and wide over a myriad legal issues which might be  thought  to  be  raised  by  the  question  put  to  the  Court.    But  this  is  not  so,  Mr. President.    The Court, in answering the question put to it, will no doubt keep strictly to the issues raised directly by that question.  And being an advisory opinion, the Court has the possibility of saying only as much about any particular aspect of the question put to it as it considers appropriate. /n/nThe further argument has been advanced that the question put to the Court is so complex and uncertain that it is not a legal question at all, and raises such complex issues of fact and law as to be unsuitable for determination by an advisory opinion. /n/nThe focus for the Court’s opinion is also limited.  It is also clear.  The Court is asked to give  its  opinion  on  “the  legal  consequences”  of  the  construction  of  that  Wall.    There  is  nothing uncertain  about  a  question  so  phrased.    There  can  be  nothing  inappropriate  in  asking  a  judicial organ to give an opinion on the legal consequences flowing from a specific situation about which the facts are well known:  indeed questions about the legal consequences of an act are quintessentially  legal  questions  since,  in  the  words  of  the  Court  in  the  Western  Sahara  case,  they are  “framed  in  terms  of  law  and  raise  problems  of  international  law . . .  [and]  are  by  their  very nature  susceptible  of  a  reply  based  on  law;    indeed,  they  are  scarcely  susceptible  of  a  reply otherwise than on the basis of law”91."
    },
    {
        "voto": 1,
        "juez": "Jordan",
        "pregunta":"The construction of the wall being built by Israel, the occupying Power, in the Occupied Palestinian Territory, including in and around East Jerusalem, and its associated régime, are contrary to international law",
        "texto": "Two  things  about  it  are  of  crucial  importance.    First,  much  of  the  Wall  now  being  built  by Israel  is  in  territory  which  does  not  belong  to  Israel,  but  which  is,  rather,  occupied  territory   territory which, as consistently acknowledged by the international community for over 35 years, is subject to a special régime in international law. /n/nIt  is  the  fact  that  the  Wall  is  being  built  on  Occupied  Territory  which  is  at  the  heart  of  the present  case.    If  Israel  has  a  security  problem,  then  in  principle  Israel  can  protect  itself  by  taking suitable measures within its own territory.  If the Wall had been constructed wholly within Israel’s sovereign territory, these proceedings would not have come about. /n/nThe second crucial factor about the Wall is that it is a wall with the characteristics described in  the  Secretary-General’s  report.    On  the  screen  now  (and  at  tab 1  in  the  judges’  folders)  is  a succession of photographs taken of the Wall.  The Court can see that in physical terms the Wall is not  just  a  simple  fence.    It  dominates  its  surroundings,  separates  homes  from  their  lands,  people from  their  places  of  worship  as  well  as  from  essential  services  and  sources  of  water,  it  divides communities, and cuts a swathe through towns and villages. /n/nThose  physical  characteristics  are  supplemented  by  an  extensive  system  of  administrative controls.  The Wall cannot be looked at on its own, but only in conjunction with the controls which are an integral part of the whole system. /n/nIt  is  when  one  looks  at  the  overall  picture  presented  by  the  Wall  and  its  accompanying controls that one fears for the future of the Palestinian inhabitants of the Occupied Territories.  It is consistent  with  what  is  known  already  of  the  Wall  to  see  in  its  construction  steps  aimed  at  the further assimilation of the Occupied Territories into Israel. /n/nAnd more than that, Mr. President, it obstructs the “permanent, free and unhindered access to  the  Holy  Places  by  all  the  people  of  all  religions  and  nationalities”.    That  has  been  a  major element  in  United  Nations  policy  on  Palestine  since  resolutions  191 (III)  and  194 (III)  in  1948. And it was reiterated by the General Assembly in resolution 57/111 of 2002. /n/nThe  map,  Mr. President,  also  shows  something  else.    It  shows  that,  despite  arguments  to the  contrary,  this  Wall  is  not  primarily  about  the  defence  of  Israel’s  territory.    One  glance  at  the route taken by the Wall gives the lie to that argument.  If the Wall is no more than a security barrier to  protect  the  territory  of  Israel,  why  does  it  follow  the  path  it  does?    How,  for  example,  does  a Wall encircling Qalqilya help to defend nearby Israeli territory?  What does the long finger of Wall extending  far  into  the  West  Bank  in  the  region  of  Salfit  have  to  do  with  the  defence  of  Israel’s territory?  How can the projected eastern stretch of the Wall, from Jenin in the north to Hebron in the  south,  be  justified  as  a  security  barrier  for  the  protection  of  Israel’s  territory,  when  there  is already the whole stretch of the Wall over to the west to serve for that alleged purpose?  If the Wall defends anything, it is  as we shall see in a moment  the position of Israeli settlements in the Occupied  Territories:    but  no  exceptional  right  of  self-defence  can  be  invoked,  Mr. President,  to defend  that  which  is  itself  unlawful.    Had  Israel  built  a  wall  wholly  within  its  own  territory,  we would  not  all  be  here  today.    And  I  would  just  observe  that  the  Court  has  been  given  no  cogent reasons why it was necessary to build this Wall in Occupied Territory, and why a wall built within Israel’s own territory would not have met the security concerns which are alleged to have provoked it. /n/nNow let me show one more sketch-map.  Still on the screen is the complete route of the Wall  constructed, planned and projected.  Now on the screen (and at tab 7 in the folders) is that same  map,  but  superimposed  on  it  are  the  locations  of  Israeli  settlements  in  the  Occupied Territories.    Although  settlements  are  spread  throughout  the  Occupied  Territories,  80 per cent  of the  settler  population  is  concentrated  in  the  western  areas,  now  being  pointed  out.    It  is  readily apparent  that  the  Wall  brings  the  main  groups  of  the  settlements  into  effective  contiguity  with Israel’s own territory;  it strengthens, develops and consolidates Israel’s settlements. /n/nThose  settlements  have  long  been  regarded  by  the  international  community  as  illegal56. And ever since the Wall began to be constructed, the international community has also regarded the Wall  as  illegal57.    Mr. President  and  Members  of  the  Court,  that  is  the  Wall  about  the  legal consequences of which the General Assembly has requested your opinion."
    }
]