[
    {
        "voto": 0,
        "juez": "Kingdom of Saudi Arabia",
        "pregunta": "Finds that it has jurisdiction to give the advisory opinion requested",
        "texto": "As the Court is aware, the Kingdom of Saudi Arabia has presented a Written Statement on the question before the Court. We are mindful of our duty not to simply repeat what is said there. We are also cognizant of the time pressure the Court is under and the fact that the position of many of the parties that are here touch upon similar points. Thus, in using my time today, I will not make a comprehensive statement that responds to all of the points that have been raised with which we disagree. We will let our Written Statement stand and reflect our comprehensive point of view. Rather, I propose to address one specific argument that has been raised. That argument concerns the discretion of the Court. The argument is that an advisory opinion on the question is at cross purposes to the negotiating effort, designed to bring peace in the Middle East, which is today called the Road Map. We strongly disagree with this argument. We believe it is a false argument that if accepted leads only to further disintegration of the peace process. It is hoped that by responding to this one argument we will provide the Court with “information”, as called for by Article 66 of the Statute of the Court. That is our responsibility here; it is not to argue as if this is a contentious case.\n\nBefore I proceed, however, I wish to make three preliminary observations.\n\nFirst, we take note of the highly unusual posture of the pleadings that have been presented to the Court.\n\nOn the one hand, no State or other party appearing in this matter has sought to justify in law the separation Wall that Israel is building. On the other hand, some of us that are before the Court have made the case in law that there are legal consequences of the separation Wall, or barrier, or fence, whatever it may be called and from here forward I will simply refer to it as the Wall and that those consequences arise from the conclusion that the Wall is unlawful. Since no party has argued to the contrary, we believe our conclusion is sound.\n\nOf course, a group of States argues that the Court should not render an advisory opinion on the question as the General Assembly has requested. The argument they present is similar to arguments made in other advisory opinion cases to the effect that the question is vague, or that the Court will be in danger of prejudicing negotiations or of departing from its judicial function. Such arguments have failed in the past before this Court. It is notable, however, that in the cases where such arguments are made, one often at the same time finds those same States arguing in the alternative: that is, they argue their view that the Court should not render an opinion, but they then go on to argue their position on the substance of the matter in the event that the Court proceeds to render an opinion. This is not the case here.\n\nFor instance, in the Nuclear Weapons case, seven States argued in their Written Statements that the Court should not give its opinion; of those States, six presented the alternative argument. In the present matter, these same six States provided the Court with Written Statements again arguing that the Court should not render an advisory opinion, but this time in doing so they presented no alternative argument. The copy of my prepared remarks given to the Registry contains the relevant citations.\n\nThus, the alternative argument is not presented here. The States that argue that the Court should not exercise its power to render an advisory opinion on the question before it do not argue in the alternative that if the Court does, it should find that there is a legal basis for the Wall and thus no adverse legal consequences. The question may be asked, why not? The answer, simply, is that the Wall is indefensible as a matter of law.\n\nMany States that have taken the position in their Written Statements that the Court should not render an advisory opinion on the question before it have elsewhere condemned the Wall. They have done so by their affirmative vote for General Assembly resolution ES-10/13 of October 2003, which demands that Israel stop and reverse the construction of the Wall and states it is in contradiction with international law.\n\nTherefore, the Court is in a curious position. Almost all States making written appearances before the Court hold the position that the Wall is illegal. Nonetheless, some of those States believe that the Court should not render an advisory opinion on the question before it because they say it will inhibit a negotiating process.\n\nIn our view, that is a sad commentary on the state of things. There is an internationally supported negotiating process. One side in the negotiations — that is, the Israeli side — has been and continues to deliberately enhance its position and change the territorial status quo to its benefit. It has been doing so since 1967; the Wall is the most recent manifestation. Nothing is being done about it, although almost all States say it is wrong. Whatever rhetorical exhortations may be made by the Quartet have done nothing to make Israel believe that there is an adverse consequence to taking more Palestinian land. Yet the argument is made that the General Assembly should be denied the Court’s opinion on the legal consequences of the Wall — a wall that in our view denies a viable Palestinian State, denies the right of self-determination, and exacerbates the hatred that leads to increased violence.\n\nMr. President, Members of the Court, this attitude that the Court should not speak on this question does not make sense to us. If the Court, the highest international judicial body, cannot take a clear position on the law to guide the General Assembly on a specific request by that body as negotiations progress, it is not hard to understand the further descent into chaos and procrastination."
    },
    {
        "voto": 0,
        "juez": "Kingdom of Saudi Arabia",
        "pregunta": "Decides to comply with the request for an advisory opinion",
        "texto": "I now turn to our response to the argument that has been made that the Court’s advisory opinion on the question of the legal consequences of the Wall would prejudice or hinder or be at cross-purposes to the Road Map, and thus the Court should refrain from giving its opinion. I will respond by looking at the argument from five different points of view.\n\nTo begin, the argument may be examined from what might be said to be a logical point of view. It is hard for us to understand how an advisory opinion from this Court that could inform the General Assembly and that is non-binding would truly hinder negotiations between two parties as claimed by Israel and several other States. The advisory opinion is an opinion of law, and the General Assembly believes it will be useful to its deliberations. We cannot lose sight of the fact that the purpose of the General Assembly’s request for this position is to advise it in the conduct of its work, such work including the concern for human rights and self-determination, not to mention international peace and security. It is a fact that the Palestinian people have been denied the exercise of the right of self-determination for many decades, and this is a legitimate concern of the General Assembly.\n\nThe negotiations that are mandated by the Road Map do not take place in a vacuum. The interest of the General Assembly is not new. Resolution after resolution of both the General Assembly and the Security Council have been disregarded by the Occupying Power in the Occupied Palestinian Territory, including in and around Jerusalem. It is the Security Council th\n\nbeginning with resolution 242 in 1967 and, later, resolution 338 of 1973 requires \n\nwithdrawal of Israel from the territory it occupied in the 1967 W\n\nbeginning with resolution 252 in 1968 considers that all legislative and administrat\n\nmeasures and actions taken by Israel, including expropriation of land and properties there\n\nwhich purport to change the legal status of Jerusalem are invalid and cannot change t\n\nstat\n\nin resolution 446 in 1979 determined that the policy and practices of Israel in establish\n\nsettlements in Palestine and other Arab territories occupied since 1967 have no legal valid\n\nand constitute a serious obstruction to achieving a comprehensive, just and lasting peace\n\ndetermined in resolution 452 of 1979 that Israel’s settlement policy constitutes a violation\n\nthe Fourth Geneva Convention of 1949.\n\nThe list goes on and on, and includes Security Council resolution 465 of 1980, which specifica\n\nreferred to Israel’s settlement policies as a flagrant violation of the Fourth Geneva Convention.\n\nIt remains for the parties to negotiate their own solution, but it is perfectly legitimate \n\nthe General Assembly to request the Court for an advisory opinion on the legal consequences of \n\nWall in the context of those resolutions and other principles of international law, and for the Co\n\nto exercise its mandate and to give its opinion.\n\nThe second point of view that I offer looks at this question chronologically over the l\n\ntwo years in light of the argument made in the Israeli Written Statement that the Gene\n\nAssembly’s request is improper in light of the Security Council’s endorsement of the Road Map\n\nits resolution 1515. A chronological review of the last two years shows that the Gene\n\nAssembly’s request for an advisory opinion is consistent with its responsibilities and does \n\ninfringe upon those of the Security Council. The Israeli Written Statement, at paragraph 3.2, sta\n\nthat Security Council resolution 1397 of 12 March 2002 “sets the agenda for the Quartet initiativ\n\nIt is, of course, that initiative, which arose from the Madrid process, that resulted in the plan \n\ncalled the Road Map. According to paragraph 1.16 of the Israeli Written Statement, \n\nGovernment of Israel approved the construction of the Wall the very next month. Act\n\nconstruction began in June that same year.\n\nDuring 2002 and 2003 the Quartet issued communiqués following its meetings record\n\nits progress15. In the communiqué of the Quartet dated 17 September 2002, one can see \n\ncomplete Road Map16. It is true that it was not formally presented to Israel and to the Palestin\n\nAuthority until 30 April 2003, and it was not until 19 November 2003 that the Security Coun\n\npassed a resolution in which it “endorsed” the Road Map17. That is the operative w\n\n“endorsed” that is all. Throughout 2002 and 2003 the Road Map was promoted, acted up\n\ncalled upon and interpreted. Thus, leading up to the end of 2003, the Road Map was the centre\n\nthe diplomacy on this subject; but even before the Security Council endorsed it in November 20\n\nits viability had become open to question.\n\n“Determines that all measures taken by Israel to change the physical character, demographic\n\ncomposition, institutional structure or status of the Palestinian and other Arab territories occupied since\n\n1967, including Jerusalem, or any part thereof have no legal validity and that Israel’s policy and practices\n\nof settling parts of its population and new immigrants in those territories constitute a flagrant violation of\n\nthe Geneva Convention relative to the Protection of Civilian Persons in Time of War and also constitute a\n\nserious obstruction to achieving a comprehensive, just and lasting peace in the Middle East.”\n\nThe Israeli Written Statement portrays the scene as if on 19 November 2003 the Secur\n\nCouncil took a momentous action as if it had just discovered the Road Map rather t\n\nsimply endorsing something that had already been the focus of diplomacy for more than one year\n\nThe Israeli Written Statement goes further to cast the General Assembly in the role of a villain\n\ncalling for this advisory opinion a few weeks later: as if the General Assembly sought to pre-e\n\nthe powers of the Security Council making, as Israel asserts, the call for this advisory opin\n\nultra vires to the General Assembly19.\n\nMr. President, Members of the Court, the genesis the date of the beginning of \n\nRoad Map is not 19 November 2003. If so, the Road Map is itself internally inconsistent as\n\ncalls for a three-year process to be completed by 2005. The Road Map is a negotiating effort t\n\ndates from early 2002, receiving the endorsement (a rather modest word after all) of the Secur\n\nCouncil only recently.\n\nIn light of Israel’s arguments that the actions of the General Assembly are ultra vires,\n\nis useful to note what occurred in respect of the Wall in 2002 and 2003.\n\nFrom the date of approval of the Wall by the Israeli Government to the adoption by \n\nSecurity Council on 19 November 2003 of resolution 1515, the Quartet issued six communiqu\n\nOnly the last of these referred to the Wall, which was by then well along in its construction, \n\nthen only expressed general concern. Nonetheless, throughout the period there was mount\n\nevidence of the humanitarian crisis created by the Wall, the growing realization that new de fa\n\nterritorial annexation by Israel was occurring, and the increasing concern that the Wall would m\n\nnegotiations impossible. However, the Security Council did not act nor did the Quartet act\n\nconvince Israel to reverse the situation.\n\nIn light of these growing concerns, however, on 14 October 2003 the Security Coun\n\nconsidered a draft resolution20. A preambular paragraph of that draft resolution condemned “\n\nacts of violence, terror and destruction”, while an operative paragraph decided “that \n\nconstruction by Israel, the occupying Power, of a wall in the Occupied Territories departing f\n\nthe armistice line of 1949 is illegal under relevant provisions of international law and must\n\nceased and reversed”.\n\nThe draft resolution was not adopted by the Security Council but in the debate no \n\nsaid that the legal conclusion of the defeated resolution was wrong21.\n\nIt is in this context of the failure to comment on the legality of the Wall, and thus\n\nprotect the Road Map, that the Emergency Special Session was called, which resulted in a requ\n\nfor this advisory opinion. Thus, this review of recent events shows that the General Assembl\n\naction is not precipitous, it is not irresponsible, and that it is focused on the Wall, which\n\ndestructive of peace. There is no evidence in the chronology that suggests that the Road Map w\n\nbe harmed if an advisory opinion is given.\n\nWe now turn to a third point of view on the argument that an advisory opinion will h\n\nnegative consequences for the Road Map. This viewpoint looks at the issue from a practical \n\nhistorical point of view. Let us be clear, the Road Map is simply a negotiating process. It is w\n\nsupported by the international community, and that is good. However, one cannot avoid the f\n\nthat there have been other well-supported negotiating initiatives on this problem over the l\n\n40 years. I say this not to cast doubt on our commitment to the Road Map but simply to ensure t\n\nthe Road Map is seen for what it is.\n\nThe Court has been faced before with the argument that an advisory opinion o\n\nquestion before it would prejudice sensitive negotiations. It was confronted in particular with \n\nsame argument ten years ago in the Nuclear Weapons case. At paragraph 17 of that Judgment \n\nCourt said, and I quote:\n\n“The Court is aware that, no matter what might be its conclusions in \n\nopinion it might give, they would have relevance for the continuing debate on \n\nmatter in the General Assembly and would present an additional element in \n\nnegotiations on the matter. Beyond that, the effect of the opinion is a matter\n\nappreciation. The Court has heard contrary positions advanced and there are\n\nevident criteria by which it can prefer one assessment to another. That being so, \n\nCourt cannot regard this factor as a compelling reason to decline to exercise \n\njurisdiction.”\n\nThe Kingdom of Saudi Arabia respectfully submits that those same reasons apply here.\n\nMr. President, Members of the Court, the argument that doing something today mi\n\nprejudice something tomorrow is a feature of diplomatic life. It probably would be hard to find\n\nexperienced international diplomat who has not made that argument. As is the case here, it\n\nnormally made when we want to avoid putting the spotlight on what is happening now.\n\nWhat is happening now is that the Road Map is in trouble. We recognize that some\n\nthe Quartet come to the Court and say: do not shine the spotlight on the problem. We supp\n\nthese members’ work, but we believe they have seriously misread the situation. Fortunat\n\nanother member, the United Nations, and one of its organs a competent organ the Gene\n\nAssembly wants to put the spotlight on the problem and be informed of the legal consequen\n\nof Israel’s actions the legal consequences in light of the humanitarian crisis, the le\n\nconsequences for self-determination, and indeed, the legal consequences for international pe\n\nand security, not just for Palestine and Israel but for all States and international institutions.\n\nWhy should the spotlight be put on the problem? The spotlight should be put on \n\nproblem because the Wall is so provocative, so overreaching, so aggressive, and\n\ndisproportionate, that we believe it will be the death knell of the Road Map if it is not immediat\n\nreversed.\n\nThe Quartet knows this. Their last joint communiqué entitled “Final Quartet Stateme\n\nand dated 26 September 2003 indicated that they regarded the implementation of the Road Map\n\nstalled. The Quartet also said the settlement activity must stop, and then expressed great conc\n\nover the Wall and its effect on the Road Map23. That was the position of the Quartet in Septem\n\nof last year. What has happened since then? Since then, the Security Council did endorse the R\n\nMap, but the Wall continued to be built. The “fabric of life”, as the Israeli Written Statement ca\n\nit, has become even more intolerable for the Palestinian people, and, yes, the cycle of viole\n\ncontinues.\n\n“The Quartet members view with great concern the situation in Israel, the West Bank, and G\n\nwhich has stalled implementation of the roadmap. The Quartet members reaffirm that, in accordance with the roadmap, settlement activity m\n\nstop, and note with great concern the actual and proposed route of Israel’s West Bank fence, particula\n\nas it results in the confiscation of Palestinian land, cuts off the movement of people and goods, \n\nundermines Palestinians’ trust in the roadmap process as it appears to prejudge final borders of a fut\n\nPalestinian state.”\n\nMr. President, Members of the Court, the fact that there was an Advisory Opinion\n\nSouth West Africa24 may have informed the views of some States and international organizatio\n\nIn spite of South Africa’s arguments that an opinion in that matter should not be issued, that did \n\ndeter the Court. The fact that the Court concluded that South Africa’s occupation was illegal \n\nactually have helped the process and left South Africa to conclude that its only option was to\n\nwhat was right: withdraw. Today, Namibia is an independent State.\n\nThe concerns of Spain in Western Sahara25 and those of a number of States in \n\nNuclear Weapons case26 concerning the impact of an advisory opinion on sensitive issues i\n\nsensitive process proved not to be true.\n\nThus, the argument that an advisory opinion on this question is counterproductive to \n\nRoad Map cannot be sustained. This is an advisory opinion. It is not binding, but it will inform \n\nGeneral Assembly that, by virtue of its request, has sought the Court’s opinion on the quest\n\nposed.\n\nBefore moving on I must say one thing about Israel’s portrayal of the Road Map. To\n\nsure, stage one of the Road Map concerns terrorism directed at Israel, but it also concerns Isra\n\nprovocations against Palestine. The Road Map is not as Israel repeatedly states a document that\n\nbold letters says the first step is to eliminate all terrorist acts. What the Road Map says is that at \n\noutset of stage one, I quote: “All official Palestinian institutions end incitement against Israel”, \n\nfollowing thereafter and again I quote: “All official Israeli institutions end incitement agai\n\nPalestinians”27. The Palestinian obligation appears first on the page, but that is not an indicat\n\nthat Israel is free to continue its provocations, including the construction of the Wall, until it jud\n\nit is satisfied that official Palestinian institutions have utterly succeeded in winning the war agai\n\nterrorism.\n\nThe fourth point of view about this argument that the Road Map could be prejudiced\n\nthere is an advisory opinion is to note the vacuum of silence that accompanies the argument.\n\nThe silence I refer to is that no one says why the Road Map will be prejudiced if \n\nCourt gives an advisory opinion. Indeed, if one examines closely the words used, one finds that \n\nargument is generally hedged with phrases such as “could potentially prejudice” or “co\n\nundermine”. Thus, there is simply the qualified assertion without any reasoned support for \n\nassertion. This is all the more surprising in that such assertions are normally accompanied b\n\nreference to the Road Map as something that needs to be restarted not as something that is act\n\nand vibrant and moving along. That the Road Map needs to be “relaunched,” the term used by \n\nEuropean Union28, there is no doubt; that this is a difficult and sensitive and long-stand\n\nproblem, there is no doubt; but no reason is given as to why an advisory opinion would make it \n\nmore difficult.\n\nWe agree that the Road Map needs to be reinvigorated, but there is no basis \n\nconcluding that an advisory opinion on the legal consequences of the Wall hinders that possibility.\n\nThe fifth and final point of view concerning the argument that the Court should \n\npronounce upon matters that are the subject of negotiations considers the argument in light of \n\nlegal context.\n\nMr. President and Members of the Court, this Israeli position needs to be carefu\n\nconsidered because it is particularly counter-productive and not in accord with international l\n\nIn fact, what Israel is saying is that the Court should not examine the Wall in the context of \n\nmany resolutions of the Security Council and the General Assembly of the United Nations \n\nshould it examine treaties to which Israel is a party based upon facts supplied by the Uni\n\nNations or the Conference of the Parties to that treaty.\n\nThe fact is that the Security Council and the General Assembly, and the Conference\n\nthe Parties to the Fourth Geneva Convention29, have spoken to some of the core issues at the he\n\nof this matter. In any objective sense it is not prejudicial to the Road Map if the Court exami\n\nthe Wall against those resolutions and treaty obligations. If Israel believes the Road Map will\n\nprejudiced if the Court does no more than review a fact namely, the Wall and this is no\n\ncomplex factual question in light of the resolutions of the United Nations, custom\n\ninternational law and Israel’s treaty obligations, that is a serious problem. That is a seri\n\nproblem for the peace process. It is a serious problem because what it means is that so much t\n\nhas gone before is in Israel’s view irrelevant. Israel would prefer to live in a world where \n\nInternational Court of Justice has not spoken on these same questions.\n\nIsrael occupied the West Bank, Gaza and East Jerusalem by force in 1967. The use\n\nforce is illegal under the United Nations Charter. The Security Council called for withdrawal\n\nIsrael in resolutions 242 of 1967 and 338 of 1973, but it has not occurred. Into the territory\n\noccupied by force Israel moved its settlers. That is fundamentally illegal under international law\n\nmatter what the justification for the occupation might be; it was confirmed by the Security Coun\n\nto apply in this instance; but Israel argues to the contrary.\n\nFurther, while it holds Palestinian territory by force, Israel denies the Palestinian peo\n\ntheir human rights and denies it is an Occupying Power subject to international humanitarian l\n\nand denies that it has obligations under the Fourth Geneva Convention, notwithstanding decisi\n\nof the Security Council and the General Assembly and the Conference of the Parties to the Fou\n\nGeneva Convention to the contrary. Israel even takes issue in its Written Statement with the f\n\nthat the question before the Court uses the phrase “Occupied Palestinian Territory, including in \n\naround East Jerusalem”30.\n\nMr. President, Members of the Court, the international community through the politi\n\ninstitutions of the United Nations and through the bodies that govern international humanitar\n\nlaw have spoken and they have spoken to Israel. There is not a word in the Written Statement\n\nsuggest that the Advisory Opinion is unnecessary because the Wall and the Settlements are \n\nin violation of international law, and there is not a word in the Written Statement to suggest t\n\nthe Advisory Opinion is unnecessary because Israel respects the resolutions of the Security Coun\n\nand the General Assembly and the Treaty obligations of Israel.\n\nIn conclusion, the fact that there are negotiations on the Road Map does not mean that \n\nCourt should not act. The Court is an organ of the United Nations. The General Assembly is\n\norgan of the United Nations. It is perfectly legitimate for the General Assembly to ask the Court \n\nits opinion on the legal consequences of the Wall in light of the situation of the Territor\n\noccupied by Israel. It is perfectly legitimate for the Court to give an opinion on the le\n\nconsequences of the Wall in light of the applicable international law, including the applica\n\nUnited Nations resolutions and the applicable treaties. If there are negotiations underway that\n\nall the more reason for the Court to act. If the negotiations are to have any chance of success, it\n\nessential that they proceed on the basis of an accurate understanding of the law. The Court is\n\norgan that has as its very purpose the giving of legal advice to the General Assembly and ot\n\norgans of the United Nations. It should give its advice when asked to do so and do so in light\n\nthe relevant facts and the relevant law. That is what is being asked of it in this case, and that\n\nwhat it should do."
    },
    {
        "voto": 0,
        "juez": "Kingdom of Saudi Arabia",
        "pregunta": "Israel is under an obligation to terminate its breaches of international law; it is under an obligation to cease forthwith the works of construction of the wall being built in the Occupied Palestinian Territory, including in and around East Jerusalem, to dismantle forthwith the structure therein situated, and to repeal or render ineffective forthwith all legislative and regulatory acts relating thereto, in accordance with paragraph 151 of this Opinion",
        "texto": "It is important that the record show that Saudi Arabia condemns terrorism in all of its forms. We are committed to the fight against terrorism. We are a party to relevant multilateral and regional conventions and have embraced Security Council resolution 1373 of 2001. However, as we have said in many fora, it is not enough just to condemn terrorism and fight terrorism. If one wishes to defeat terrorism, one needs also to address the motivation and the provocation that lead to terrorism. As our Foreign Minister, His Royal Highness Prince Saud al-Faisal said last year during the General Debate at the General Assembly:/n/n“[T]his international effort directed against terrorism will not eradicate this phenomenon if handled without addressing its roots./n/nThe deteriorating situation of peoples who are suffering oppression, injustice and persecution, or who are overburdened by occupation, and the inability of the international community, for one reason or another, to find just solutions for these problems, is what creates the environment that is exploited by evildoers...” This is part of the issue of terrorism./n/nA third preliminary point is to emphasize the constructive role and the interest of Saudi Arabia in the success of the Road Map. Indeed, the Road Map refers specifically to the initiative of His Royal Highness Crown Prince Abdullah  which was endorsed by the Beirut Arab League Summit of March 20026  that calls for acceptance of Israel as a neighbour living in peace and security, in the context of a just and equitable settlement. The Road Map refers to the Saudi initiative as “a vital element of international efforts to promote a comprehensive peace on all tracks”. Any student of this conflict will recognize that this initiative constitutes a major stride towards peace. We accept two States living side by side in harmony based upon a negotiated settlement./n/nSaudi Arabia is party to a number of multilateral conventions against terrorism including: Convention of the Organization of the Islamic Conference on Combating International Terrorism, adopted at Ouagadougou (1 July 1999); Arab Convention on the Suppression of Terrorism, signed at a meeting held at the General Secretariat of the League of Arab States in Cairo (22 April 1998); Convention on the Marking of Plastic Explosives for the Purpose of Detection, signed at Montreal (1 March 1991); Protocol on the Suppression of Unlawful Acts of Violence at Airports Serving International Civil Aviation, supplementary to the Convention for the Suppression of Unlawful Acts against the Safety of Civil Aviation, signed at Montreal (24 February 1988); International Convention against the Taking of Hostages, adopted by the General Assembly of the United Nations (17 December 1979); Convention for the Suppression of Unlawful Acts against the Safety of Civil Aviation, signed at Montreal (23 September 1971); Convention for the Suppression of Unlawful Seizure of Aircraft, signed at the Hague (16 December 1970); and Convention on Offences and Certain Other Acts Committed on Board Aircraft, signed at Tokyo (14 September 1963)/n/nThus, Mr. President and Members of the Court, our criticism of the Wall cannot be viewed as supporting terrorism or as undermining the Road Map. To the contrary, we believe an advisory opinion on the question presented will contribute to the objective of eliminating terrorism and to bringing about a just and lasting peace in the region./n/nBefore continuing, however, in the light of the importance that has been attached to the Road Map in the presentations made to the Court, and given the importance of the Saudi initiative to the Road Map, it is important to be very clear about what was decided at the Beirut Summit. The Saudi Arabian proposal, formulated in a speech by His Royal Highness Crown Prince Abdullah, said:/n/n“The only acceptable objective of the peace process is the full Israeli withdrawal from all the occupied Arab territories, the establishment of an independent Palestinian state with [East Jerusalem] as its capital, and the return of refugees. Without moving towards this objective, the peace process is an exercise in futility and a play on words and a squandering of time which perpetuates the cycle of violence.”/n/nThus it was proposed, and again I quote: “Normal relations and security for Israel in exchange for a full withdrawal from all occupied Arab territories, recognition of an independent Palestinian state with [East Jerusalem] as its capital, and the return of refugees.” This proposal was adopted unanimously; and as noted, it is referred to as “a vital element” of the Road Map."
    }
]


