[
    {
        "voto": 1,
        "juez": "League of Arab States",
        "pregunta": "Finds that it has jurisdiction to give the advisory opinion requested",
        "texto": "The Court should render the requested opinion as there are no compelling reasons for the Court to refuse the request.\n\nLet me analyse some of the objections put forward against the propriety of the Court rendering the opinion.\n\nThe argument of “a pending dispute” or “circumvention”\n\nIt has been claimed by Israel, and a few other States, that the request concerns a contentious matter in respect of which Israel has not given its consent to the jurisdiction of the Court, and that it was, therefore, improper for the Court to render the requested opinion. Otherwise, the principle that a State is not obliged to allow disputes to be submitted to the Court without its consent would be circumvented.\n\nSuch consideration of propriety, however, could only apply where the essential content of a dispute was a mere bilateral matter between two States arising independently of the United Nations. But, is the problem which the Court is requested to address a dispute of an essentially bilateral character?\n\nNo it is not. The issue put before the Court has to be determined in light of the terms of the question put to it. The question relates to an enlightenment of the General Assembly on the legal consequences of a specific circumstance: the construction of the Wall.\n\nIsrael could not, validly, object to the General Assembly’s exercise of its powers to deal with, and to seek an opinion on, the violations of fundamental principles of the Charter, including the right to self-determination, the violations of international humanitarian law, where there is an obligation on all parties to the Geneva Conventions “to respect and to ensure respect” of their provisions, and the violations of fundamental human rights law, all of which constitute erga omnes obligations “owed to the international community as a whole”\n\nIn addition, many of the norms\n\nviolated by Israel constitute peremptory norms of international law: ius cogens. Thus, other States not only Palestine may “take lawful measures” against Israel “to ensure the cessation of the breach and reparation in the interest of the injured State or of the beneficiaries of the obligation breached”3 I am quoting the ILC Draft  in this case the “interest” of Palestine and the Palestinians affected by the Wall.\n\nClearly, there is in this case a controversy, but one which has its fons et origo in a larger one, which arose within the ranks of the League of Nations and was later inherited by the United Nations, and today remains in its custody. It is a controversy over matters in which the General Assembly is directly involved. There are so many United Nations resolutions on Israel’s illegal occupation of the territories in which the Wall is being constructed. The controversy did not arise independently in bilateral relations.\n\nThe object of the request is to obtain from the Court an opinion which the General Assembly deems of assistance for the proper exercise of its functions concerning Palestine. The legal questions involved in the request are located in a broader frame of reference than the settlement of a particular bilateral dispute. They embrace a broad range of questions relating to the functioning of the United Nations and the legal order in general.\n\nWhy should it be “improper” for the Court to address these questions?\n\nThe alleged “absence of an essential factual context”\n\nBy pretending that it was not going to address the substance while it has indeed Israel is trying to mislead the Court into a decision not to answer the request because it has not before it the factual and legal issues essential to any proper assessment of the substance of the request, to which it alone, it boasts, can contribute. And, accordingly, it is alleged, the Court would have to base its pronouncement on facts which are not well established, and, thus, on “speculation”.\n\nThis is in itself a very speculative argument. It is part of the judicial function to deal with situations where the facts are controversial. It is part of the judicial function to determine what facts are relevant for a certain conclusion on the legal situation, in this case: whether the Wall is in violation of certain rules of international law or whether its construction can be justified.\n\nActually, the Court is already in possession of sufficient information and evidence furnished by independent sources, including the United Nations, its organs, Rapporteurs and other international organizations, as well as by States. It does not need such information from Israel alone. Yet, Israel too has furnished extensive information and evidence through its official declarations and through its Written Statement, together with its annexes, of which the Court will undoubtedly avail itself. Israel cannot now complain that the Court does not have facts that it would have, otherwise, furnished. It was invited to do so but chose not to furnish more. A State which declines to give certain information to the Court is certainly precluded from raising an alleged lack of information of the Court as a basis for challenging the propriety of the Court pronouncing itself on the issue.\n\nYet, there is no real uncertainty concerning the facts. Probably, the only disagreement is over the issue of when and for how long the gates of the Wall are open!\n\nDoes the uncertainty about the facts make it “improper” for the Court to render the requested opinion?\n\nThe alleged violation of procedural justice\n\nIsrael claims that the way in which the question is asked violates principles of procedural justice, it argues, the question arbitrarily selects only one specific aspect of the problem and neglects all others. Thus, a fundamental issue of procedural justice arises, Israel argues. One could simply respond that it is up to the General Assembly to choose the question on which it wants to have the advice of the Court, and that it is not for the Court to second-guess this wish. The entire argument, however, is a gross distortion of the true situation. Israel’s main concern, the alleged security threat, is clearly put before the Court. Israel has had ample opportunities to argue this before the Court, and it has, for all practical purposes, done so in its Written Statement. It might have been helpful if Israel had put more concrete arguments before the Court. But Israel certainly cannot claim that it was not granted procedural equality.\n\nThe requirements of procedural justice cannot make it improper for the Court to render this opinion.\n\nThe alleged absence of a useful purpose\n\nIt has been argued, wrongly relying on certain dicta of the Court, that it should not answer the question because that answer could not serve any useful purpose. The authors of this argument seem to think that in the light of the determinations which competent organs of the United Nations have already made, a determination by the Court could not have any added value.\n\nThe General Assembly has indeed made a determination as to the illegality of the Wall, and has also declared one essential consequence of this illegality, namely that the construction should cease and that the parts of the Wall already built must be demolished. Yet, also in this respect, it is up to the General Assembly to choose the issue where it wants further guidance by the Court. But beyond this formal argument: it will, inter alia, be useful for the General Assembly to have its declarations confirmed by the Court, in particular as the views expressed by the General Assembly and by other United Nations bodies are contested by Israel; to gain clarity on a number of grounds of illegality; to gain clarity on a number of legal consequences which have not been comprehensively addressed by the General Assembly.\n\nIt is of course not for the Court to instruct the General Assembly as to what further action it should take in the light of the Court’s pronouncement. The General Assembly will certainly remain seised with the issue of Palestine. Its role has been that of formulating principles and goals which govern or should govern the international community and of promoting political processes to further these goals. This role will certainly be inspired by the pronouncement of the Court. And if further measures of implementation are needed, the General Assembly could also address a recommendation to the Security Council and it will then be appropriate for the Council to take as a basis for its decision the legal situation as clarified by the Court."
    },
    {
        "voto": 1,
        "juez": "League of Arab States",
        "pregunta": "Decides to comply with the request for an advisory opinion",
        "texto": "Concluding remarks: the responsibility of the Court in the present proceedings.\n\nThe Arab League would thus like to conclude by expressing its confidence that the Court will fulfil the singular responsibility imposed upon it by exercising its role as the principal judicial organ of the United Nations. This reference in Article 96 of the Charter is loaded with meaning. The Court an organ of the United Nations this means that it is an integral part of the United Nations system and hence one element of the system of maintenance of international peace and security established by the Charter. And as such its case law has participated in the reduction of world tensions. The Charter’s purposes and principles have come to reflect the global values of the international community and it is widely accepted today that, in addition to aggression, violations of core human rights, including the right to self-determination, as well as grave breaches of international humanitarian law, constitute the main threats to international peace and security.\n\nAs an organ of the United Nations, the Court has as its lodestar the purposes and principles for which the Organization exists these purposes and principles underlie the question of Palestine: self-determination, prohibition of the use of force, human rights and humanitarian law in its broadest sense. There is now an unprecedented unanimity on the part of the Members of the United Nations, its principal and subsidiary organs and its Specialized Agencies, that the construction of the Wall violates these purposes and principles. The Court has in the past always worked in the same direction as the other organs of the United Nations in upholding these purposes and principles. It has also promoted the work of the Organization against restrictive assertions of sovereignty by Member States. It has confirmed the normative activity of the United Nations organs, in particular the General Assembly, by upholding the fundamental role of its resolutions in the customary law process (Namibia, Nicaragua, East Timor cases), its general responsibility in the maintenance of international peace and security (Expenses case), and its primary responsibility towards mandates, trust and non-self-governing territories (Namibia, Western Sahara, East Timor). The Court a judicial organ of the United Nations this has led the Court to underline the complementarity of its judicial function with the functions of the political organs of the United Nations, insisting on the “functional parallelism” which exists between it and the General Assembly and the Security Council. It has rejected the view that there are intrinsically legal questions, on the one hand, and, on the other, intrinsically political questions which are not amenable to legal and judicial scrutiny.\n\nThe Court a principal organ of the United Nations this means today that it is the court of the world community and hence the legal guardian of community values and interests. The Court has been aware of this mission. On a number of occasions it has juxtaposed the traditional bilateralist structure of international law with the notion of “collective” interest. The Court has made reference to the concept of international community which it has seen as personified in the United Nations. The Court has affirmed not only that every State has a legal interest in the respect of obligations owed to itself individually, but that each State had a duty to react to certain situations of objective illegality Namibia Opinion.\n\nPalestine, as a former Mandate, is the beneficiary of the sacred trust of civilization the main purpose of the Mandate system. This means today that the world community has a responsibility for the attainment of the right to self-determination by the Palestinian people, including the two-State solution and in the protection of its territorial integrity, that is the whole territory under occupation. As a court of the world community, the Court has its role to play in the attainment of these objectives. It now has the opportunity to pronounce on the legal consequences of the construction of a wall. To warn, as some States have done, that a pronouncement of the Court would be unhelpful or hinder negotiations, is a far-fetched presumption which has nothing to do with reality. What is very real, however, is the prospect that the silence of the Court would have dire consequences for the future emergence of Palestine as a viable and fully sovereign State. The Court, thus, must not abdicate its judicial function in the face of this Palestinian tragedy. Ultimately, it was the breakthrough pronouncements in the Namibia case, not the silence of the Court in the contentious South West Africa case, that contributed to the exercise of self-determination and full independence of that other Mandate inherited by the United Nations from its predecessor."
    },
    {
        "voto": 1,
        "juez": "League of Arab States",
        "pregunta": "The construction of the wall being built by Israel, the occupying Power, in the Occupied Palestinian Territory, including in and around East Jerusalem, and its associated régime, are contrary to international law",
        "texto": "Fundamental rules and principles of the Charter\n\nFundamental principles of the Charter: the essential point is that the construction of the Wall fundamentally affects the demographic structure of the Occupied Palestinian Territories. It leads to a fragmentation of the Palestinian space, which has rightly been called Bantustanization. It makes Palestinian life burdensome, even impossible, and forces Palestinians to leave their homes, while fostering the position of the unlawful Israeli settlements. Israel denies this effect by calling the “fence” a temporary security measure. But this claim veils the true situation. It is public notice that major parts of the Wall are built in a very solid way, concrete structures, ditches, and so on. In today’s newspaper you can read the latest statement of Prime Minister Sharon: “We will build the security fence and complete it.” That does not sound temporary. The Wall will incite Palestinians to move out of the encircled places, in particular in what is called the “Seam Area”, and Israelis to stay in or to come to the settlements fortified by the Wall. That is why the Wall profoundly affects the right of the Palestinian people to self-determination, which includes the right to remain in the place where the people has lived since many centuries, that is why it constitutes a change in status, a de facto annexation which is contrary to the prohibition of acquiring territory by force.\n\n One thing should be made crystal clear: Palestine is not a kind of no-man’s land subject to appropriation by Israel. It is a self-determination unit in the borders drawn by the armistice lines of 1949. This has been recognized by the Security Council and the General Assembly in binding determinations and by Israel itself. This is the lex lata, whatever the parties may freely agree upon in the future.\n\n But does the alleged security threat not justify these measures? Is the inherent right of self-defence not recognized by the Charter? Self-defence is an act necessary to protect a State against an armed attack. As such, it is by necessity a temporary measure. A lasting change in status cannot conceivably be necessary for such protection. This is why the prohibition of acquisition of territory through the use of force, confirmed by Security Council resolution 242 and formulated in the well-known Friendly Relations Declaration of 1970, does not provide for an exception in the case of self-defence. A de facto change of status does not provide any additional security. The Wall cannot be justified as self-defence.\n\nInternational humanitarian law\n\nIts application cannot be denied. This has again been made clear by all the States which have addressed the issue in their written statements, including France, Ireland and Switzerland, guardian of the Geneva Conventions, and it has been convincingly pleaded the course of the present oral hearings. The essential point is the duty of an occupying power not to destroy private property and to provide for a decent existence of the civilian population, an obligation which is violated in many respects.\n\nBut does the security threat not justify these measures? The right of a party to a conflict to take measures for the protection of its own population living on its territory is certainly recognized. But, as the ICRC has clearly put it in a recent declaration which deserves to be re-emphasized, although it has already been quoted to the Court:\n\n“[T]he West Bank Barrier, in as far as its route deviates from the ‘Green Line’ into occupied territory, is contrary to international humanitarian law. The problems affecting the Palestinian population in their daily lives clearly demonstrate that it runs counter to Israel’s obligation under international humanitarian law to ensure the humane treatment and well-being of the civilian population living under its occupation. The measures taken by the Israeli authorities linked to the construction of the Barrier in occupied territory go far beyond what is permissible for an occupying power under international humanitarian law.”\n\nHuman rights\n\nThe applicability of international human rights treaties as well as the corresponding rules of customary international law has once again been affirmed in the present proceedings. This was clearly stated by a number of States, including France, Ireland and Switzerland. The latter drew your attention to the fact that you held, in the Nuclear Weapons case, that a concurrent application of international human rights and international humanitarian law was indeed required. International human rights guarantees are violated in a number of respects which we have developed in our Written Statement. In addition to the rights related to the unbearable deterioration of the living conditions of the Palestinian population, one further aspect of these violations has to be stressed: freedom of religion of Christians and Muslims, as the Wall also bars access to the Holy Places of these religions.\n\nBut does the alleged security threat not justify these measures? The extent to which security considerations may serve as a reason for limiting human rights is determined by the limitation clauses associated with a number of guarantees. They are summarized under the heading of proportionality.\n\nThis means the measure must serve a legitimate purpose. The security of the population is such legitimate purpose, but the protection of the Israeli settlements is not. These settlements, as has been repeatedly explained before you, are themselves a violation of international law. A situation created by a violation of international law cannot serve as a legitimate purpose for limiting human rights: “Ex iniuria ius non oritur”.\n\nA second condition: the measure must be necessary for achieving its purpose. But, as even Israel admits in its Written Statement, the security situation has not changed since the construction of the Wall. The attacks complained of by Israel have not diminished. It was very convincingly pleaded yesterday: the security to be provided by the Wall is just an illusion. A measure which is incapable of achieving its objective is a useless, and therefore unjustifiable infringement on human rights. Therefore, it has to be stressed that the true purpose of the Wall is different (and not legitimate): it is a means to change the legal status quo of the occupied territory.\nFinally, the limitation of a human right must not be excessive in relation to the advantage it is designed to achieve. Making the life of an entire population unbearable is an infringement of human rights grossly disproportionate to the real scope of the threat perceived by Israel. Thus, the security argument fails in respect of any limitation of human rights which are imposed on the Palestinians by reason of the construction of the Wall.\n\nTo sum up, Mr. President, Members of the Court: the Wall does not stand between terrorists and potential victims. It stands between the farmer and his land, between the employee and the employer, between the merchant and the client, between the child and its school, between the patient and the doctor, between families who want to unite, between the faithful and his or her Holy Places. As a matter of international law, it does not belong there at all!"
    },
    {
        "voto": 1,
        "juez": "League of Arab States",
        "pregunta": "All States are under an obligation not to recognize the illegal situation resulting from the construction of the wall and not to render aid or assistance in maintaining the situation created by such construction; all States parties to the Fourth Geneva Convention relative to the Protection of Civilian Persons in Time of War of 12 August 1949 have in addition the obligation, while respecting the United Nations Charter and international law, to ensure compliance by Israel with international humanitarian law as embodied in that Convention",
        "texto": "The Court should clearly state the consequences which these violations of applicable international law entail for various actors.\n\nMr. President, Members of the Court, in the Namibia Opinion, you held and this was already quoted by the preceding speaker that “a binding determination made by a competent organ of the United Nations to the effect that a situation is illegal cannot remain without consequence”\n\nConsequences for Israel: under the law of State responsibility, there is, first, a duty to cease the unlawful act. The construction must be stopped immediately. Secondly, there is a duty of reparation in the form of restitution: the Wall must be demolished, land taken from Palestinian owners for the purpose of constructing the Wall must be given back, regulatory instruments related to the construction of the Wall are null and void and must be rescinded. Damages going beyond the loss of land, which has to be given back, must be compensated. In addition, appropriate assurances of non-repetition have to be given.\n\nConsequences for third States: the rules which have been violated constitute erga omnes obligations. Other States are thus entitled to take appropriate measures to ensure that the breach ceases and that reparation is provided. As to the Fourth Geneva Convention, it provides that all States parties are obliged to respect and ensure respect of its provisions. Thus, violations trigger the right and duty of all States parties to take measures to ensure compliance with this treaty. In addition, the ICRC has a responsibility in this respect, and it has fulfilled the duty in an exemplary fashion.\n\nFurthermore, these breaches constitute violations of peremptory norms of international law, of ius cogens. This entails additional duties to take measures to redress the situation.\n\nAnd one aspect must be emphasized which is of particular importance for any future settlement: no State may recognize the de facto situation unlawfully brought about by the construction of the Wall.\n\nFinally, consequences as to personal criminal liability: in various respects, the construction of the Wall constitutes a grave breach of the Fourth Geneva Convention. All States are, thus, obliged to prosecute offenders which happen to find themselves in their power, or to extradite them to a State willing to prosecute them.\n\nConsequences for the United Nations and the Specialized Agencies: The General Assembly is a guardian of the Palestinian right to self-determination. The Security Council has addressed the situation according to its primary responsibility for the maintenance and restoration of international peace and security. In the exercise of these responsibilities, both organs will have to pay due respect to the determination made by the Court. They are under a duty not only to continue, but also to reinforce their efforts to achieve a lasting and peaceful solution for the question of Palestine based on the rule of law. It is the duty of all Members of the United Nations system to assist, within their respective fields of competence, the work of these political organs. The League of Arab States respectfully asks the Court to clearly declare these consequences in its opinion. This would not only be for the benefit of the General Assembly which has requested this opinion, but for the benefit of the international community at large. By clearly stating the law as it is, the Court will contribute to a peace process based on the rule of law."
    }
]


