[
    {
        "voto": 1,
        "juez": "Palestine",
        "pregunta": "Finds that it has jurisdiction to give the advisory opinion requested",
        "texto": "With regard to the Quartet, it has expressed its concerns about the Wall. Moreover, despite the implication in one Statement to the Court that the members of the Quartet are in agreement that an advisory opinion would likely hinder the peace process, it should be clarified that there is no agreement among the Quartet with regard to asking the Court not to render the requested advisory opinion. The Statement of the Russian Federation does not ask the Court to refuse to give an opinion. The Statement of the United Nations does not do so. Nor does the European Union Statement. Ireland’s Minister for Foreign Affairs affirmed this in the Irish Senate on 4 February 2004, stating that “Contrary to some press reports, the EU has not asked the ICJ to refrain from issuing an Advisory Opinion. There would have been no consensus to adopt such a position.”4 Indeed, we even doubt whether the Statement of the United States could be characterized as such. Some States have said that an advisory opinion could harm the final status issues that should be left to the parties for negotiation. It is clearly Israeli actions in the Occupied Palestinian Territory, and not any Court opinion, that will constitute illegal facts on the ground in relation to final status issues. Nevertheless, we do agree that the Court is not being asked to advise on solutions for the final status, although it will undoubtedly be necessary to make some reference to final status issues due to the intricate relationship between the Wall and the settlements and the character and route of the Wall in and around East Jerusalem. First, Israel objects that: “the request is ultra vires the competence of the 10th Emergency Special Session and/or the General Assembly... [as] there was no failure by the Security Council to act”. There is an initial and simple answer to this. The General Assembly’s request for this opinion was made in a validly adopted resolution. In the Namibia case, you said: “A resolution of a properly constituted organ of the United Nations which is passed in accordance with that organ’s rules of procedure, and is declared by its President to have been so passed, must be presumed to have been validly adopted.”10 I stress that this is not a matter of fundamental competence but of internal procedure, to use the distinction you drew in the Use of Nuclear Weapons11 Advisory Opinion. But if it is necessary to go beyond this, the answer is still quite clear. Ambassador Al-Kidwa has outlined the circumstances surrounding the General Assembly’s request. In the light of what he has said, nothing in the Uniting For Peace Resolution prevented the Assembly’s adoption of this request. The request does not of course require the Court to take “action” within the meaning of Article 11, paragraph 2, of the Charter, nor did it involve such “action” by the General Assembly. No question involving the Charter distribution of authority between the General Assembly and the Security Council is raised. Again, I quote your words: “The Court considers that the kind of action referred to in Article 11, paragraph 2, is coercive or enforcement action... The word ‘action’ must mean such action as is solely within the province of the Security Council.”12 Requesting this advisory opinion is not solely within the province of the Security Council13. It is as simple as that. I turn to the other general objections. The starting point here is that the Court “should not, in principle, refuse to give an advisory opinion”, as you have many times said. As you recalled in Threat or Use of Nuclear Weapons: “In accordance with the... jurisprudence of the Court, only ‘compelling reasons’ could lead it to such a refusal... There has been no refusal, based on the discretionary power of the Court, to act upon a request for an advisory opinion in the history of the present Court...” This position applies even more powerfully to the General Assembly, which the Charter expressly authorizes to request “an advisory opinion upon any legal question”15. And there can be no doubt that the question asked of the Court is a legal question, as you have consistently defined that term. Then it is said that the opinion is not useful. According to one statement: “there is a striking degree of consensus amongst those most closely involved in promoting the peace process in the Middle East that an advisory opinion would be of no assistance and would be likely to be unhelpful”. The first point to note is that this conclusory statement is untrue. Ambassador Al-Kidwa has shown that there was no consensus within the European Union or among the Quartet that the Court should decline to give an advisory opinion. Furthermore the Court gives an advisory opinion to the organ which requests it, not to a self-appointed group of States. You made this point in the Peace Treaties Opinion23, and you have repeated it frequently since24. And as you said in Threat or Use of Nuclear Weapons: “it is not for the Court itself to purport to decide whether or not an advisory opinion is needed by the Assembly for the performance of its functions. The General Assembly has the right to decide for itself on the usefulness of an opinion in the light of its own needs.” The first of these issues is that of consent. Australia objects that: “The effect of the request is to bring key elements of the Israeli-Palestinian conflict before the Court for determination without the consent of Israel.” But South Africa did not consent to the Namibia request, Spain did not consent to the Western Sahara request, Romania did not consent to the Mazilu request, Malaysia did not consent to the Cumaraswamy request. All those requests involved the responsibility of a particular State. Yet you gave the Opinions. As you said in Western Sahara: “In the present case, Spain is a Member of the United Nations and has accepted the provisions of the Charter and Statute; it has thereby in general given its consent to the exercise by the Court of its advisory jurisdiction.”26 Moreover Israel cannot object, any more than could Spain, to the exercise by the General Assembly of its competence in the field of self-determination. It cannot object to the General Assembly dealing with the situation of Palestine. These competences of the General Assembly were exercised even before Israel came into existence, notably in the passage of the Partition Resolution, General Assembly resolution 181(II) which signalled the wish of the international community that Israel come into existence. The General Assembly has always had a vitally important role in relation to Palestine — as it had in relation to the other former mandated territory left over after 1945, South West Africa. This is a key aspect of the role it has consistently exercised with respect to dependent and colonized peoples ever since 1945. Israel and Palestine are not two States Members of the United Nations and the dispute over the Wall is not a pre-existing bilateral dispute on a matter falling in principle within Israel’s domestic jurisdiction. That was the situation in the Eastern Carelia case. It is not the situation here. There is no pre-existing bilateral dispute arising between Israel and Palestine, no dispute which (to use your words in Western Sahara) arose “independently in bilateral relations”27. There is no trace in the record of such a prior, independent bilateral dispute. Rather the Wall is an attempt by Israel to impose a unilateral settlement in relation to a multilateral conflict and to do so in violation of fundamental obligations, obligations erga omnes. These relate to humanitarian law and human rights, including self-determination. The people of Palestine have an unfulfilled right to self-determination. Israel cannot veto or negate the interest of the General Assembly in having a legal answer to the question asked. Indeed that interest, and the General Assembly’s long-standing and legitimate institutional role, is a compelling reason for answering the question — as it was in Western Sahara, on a much more abstract question. This brings me to my final point, which is the impact of the request on the Road Map and on future status negotiations. The United States expresses the point in the following way: “The United States... and the other members of the Quartet are deeply involved in efforts to advance those negotiations, with the support and encouragement of the Security Council and the General Assembly. It would be extremely damaging to future negotiating efforts if the Court were to set forth, even on a non-binding advisory basis, legal conclusions with respect to permanent status issues.” Now formulated in these terms this is not an objection to your giving the request at all. It is a cautionary note as to the permanent status issues. In this moderate formulation (certain Written Statements were more extreme), it goes to the content of the Opinion, not to the question whether you should give it at all. And this recalls an answer you gave to an analogous objection in Threat or Use of Nuclear Weapons. You said: “It has also been submitted that a reply from the Court in this case might adversely affect disarmament negotiations... The Court is aware that, no matter what might be its conclusions... they... would present an additional element in the negotiations on the matter. Beyond that, the effect of the opinion is a matter of appreciation... The Court cannot regard this factor as a compelling reason to decline to exercise its jurisdiction.” In the present case the relationship between the Road Map and the Wall can be put in a couple of sentences. The Road Map is a project for the final settlement to be reached by agreement of interested parties, including Palestine. Substantively it has its origins in United Nations resolutions going back to Security Council resolution 242. The Wall is not in the Road Map. Indeed it is the Wall itself which is inconsistent with the Road Map, and the Wall, if allowed to be completed, will destroy the Road Map. The request, and the Court’s opinion, can only support the multilateral process presently embodied in the Road Map. There is a further point, equally fundamental. The question you are asked relates to the present situation, not the future. You are not asked what the content of the final settlement should be. You are not asked to determine the boundaries of a future Palestinian State. It is sufficient for the purposes of this opinion that the Wall is being constructed for the most part, and indisputably, in the Occupied Palestinian Territory. That is not a negative point, it is a positive point. In determining the present legality of the Wall in relation to the powers of Israel over the Occupied Palestinian Territory, you will be helping to elucidate and thereby to preserve the legal status quo pending the final status negotiations. You are asked to give an authoritative legal opinion on the legal consequences of the construction of the Wall now. Your answer will be relevant to existing questions of legal status and its consequences. This will help to secure the foundations for a future agreement — unlike the Wall, which undermines those foundations."
    },
    {
        "voto": 1,
        "juez": "Palestine",
        "pregunta": "Decides to comply with the request for an advisory opinion",
        "texto": "Mr. President, Members of the Court, on behalf of Palestine, the Palestinian people and their leadership, I respectfully request the Court to give full consideration to the gravity of this situation and to the importance of an advisory opinion at this critical moment. In your most recent address before the General Assembly, Mr. President, you underlined the role of the Court as the “guardian of international law” and you assured the Assembly “that the Court will pursue its efforts to respond to the hopes placed in it”. The Palestinian people have great hopes for this proceeding and have full confidence that the Court will help the General Assembly to carry out its functions by rendering the advisory opinion. This would allow the Assembly to make its own substantial contribution in response to Israel’s continued construction of the Wall and the ensuing threats to the prospects for peace between the two peoples. It is our firm belief that such an advisory opinion can lead to positive developments and perhaps even a chain of events similar to that resulting from the Court’s Advisory Opinion on Namibia.\n\nThen it is objected that the request “politicizes the Court” and that the Court should therefore refuse to give the opinion17. But as you said in Threat or Use of Nuclear Weapons: “Whatever its political aspects, the Court cannot refuse to admit the legal character of a question which invites it to discharge an essentially judicial task, namely, an assessment of the legality of the possible conduct of States with regard to the obligations imposed upon them by international law.”\n\nIndeed, as you noted in the WHO Regional Headquarters Advisory Opinion: “in situations in which political considerations are prominent it may be particularly necessary for an international organization to obtain an advisory opinion from the Court as to the legal principles applicable to the matter under debate...” particularly.\n\nThen it is objected that the General Assembly has already made up its mind and so you should remain silent. According to one statement: “An opinion by the Court would provide no guidance to the General Assembly, as that body has already pronounced itself on the issue.”20 But the General Assembly had already pronounced itself on the underlying issue in earlier cases — in Namibia, both the General Assembly and the Security Council had done so. Here, as in Namibia, you are asked to look at the legal consequences of a given situation in the light of certain resolutions; here, as there, you need to look at the legal position underlying those resolutions.\n\nEven more fundamentally what this objection ignores is that you do not give just another political opinion. You give a reasoned judicial opinion as the principal judicial organ of the United Nations. In giving the opinion the Court remains “faithful to the requirements of its judicial character”21. The result is a judicial decision: it is not just a repetition of something the Assembly has already done. And if ever a situation needed a recent judicial opinion, it is this one.\n\nThen secondly, it is objected that the request is inadmissible because there is insufficient evidence before the Court to enable it to make the findings of fact required. According to Israel: “the Court has received no evidence from Israel bearing on the substantive question, and evidence received from others, including the United Nations Secretariat, cannot be regarded as authoritative or reliable”\n\nBut in all the Opinions you have given, you have used the information publicly available, where organizations could help you, you have asked them to help. You have used the information before you as best you could. It is true that in Eastern Carelia the Permanent Court gave as a subsidiary reason for not answering the question an issue of fact — the intention of Russia in making a declaration during the negotiation of a bilateral treaty29 that had nothing whatever to do with the League of Nations. The position is quite different here. This is not a matter within Israel’s domestic jurisdiction and not a matter on which it has a sovereign privilege to act.\n\nMuch more relevant is the approach of the Permanent Court in European Commission of the Danube. That was a dispute under a regional multilateral treaty between Romania and four other States. The Court referred to the findings of a Special Committee whose report had been adopted by an Advisory and Technical Committee of the League of Nations. It said: “The Court is fully aware that the Romanian Government has refused to accept the facts established by the Committee... but the Court is of opinion that, for the purposes of the present procedure, it must accept the findings of the Committee on issues of fact unless in the records submitted to the Court there is evidence to refute them.”\n\nIn the present case there is not one report but many, the reports of competent bodies including the International Committee of the Red Cross, the Human Rights Committee, the Special Rapporteur of the Commission on Human Rights and so on. They are in the Secretary-General’s dossier and have been supplemented by others. They tell a concordant story. The Court is perfectly well informed.\n\nIf Israel wished to challenge the circumstances and facts set out in these reports it could have done so, as Romania did in European Commission of the Danube. Israel cannot plead lack of facts as a ground to have the Court refuse to decide, when any deficiency in the facts could have been corrected by Israel itself. Israel does not have a veto, any more than Spain did in Western Sahara — and if a veto in principle does not exist then it cannot be created by the back door of refusing to present substantive arguments.\n\nAnyway the basic facts are perfectly clear. The dominant fact is the US$2billion fact of the Wall, growing daily and dividing Palestinian communities from each other and from their lands and water. That is the essential fact, this US$2billion so-called “temporary” edifice. So much is now known about the Wall, and what is not known can be deduced from its route, its size, its cost, its régime, its effects and the avowed intentions of those who are building it to impose a unilateral settlement."
    },
    {
        "voto":1,
        "juez":"Palestine",
        "pregunta":"The construction of the wall being built by Israel, the occupying Power, in the Occupied Palestinian Territory, including in and around East Jerusalem, and its associated régime, are contrary to international law",
        "texto":"Mr. President, Members of the Court, it is my honour to address you on behalf of Palestine. I wish to thank the International Court of Justice for granting Palestine the opportunity to participate in these advisory proceedings on the “Legal Consequences of the Construction of a Wall in the Occupied Palestinian Territory”.\n\nI stand before you as a representative of the Palestinian people, the indigenous people of the land, who for too long have been denied the right to self-determination and sovereignty over their land and half of whom remain refugees. The Palestinian people have been subject to a military occupation for almost 37 years. They have been dehumanized and demonized, humiliated and demeaned, dispossessed and dispersed, and brutally punished by their occupier. The occupation has systematically denied them their basic rights and freedoms and has controlled almost every single aspect of their lives.\n\nThis case, however, is not about the whole of the Israeli-Palestinian conflict — it is about the Wall. This Wall is being constructed almost entirely in the Occupied Palestinian Territory. This Wall is not about security: it is about entrenching the occupation and the de facto annexation of large areas of Palestinian land. This Wall, if completed, will leave the Palestinian people with only half of the West Bank within isolated, non-contiguous, walled enclaves. It will render the two-State solution to the Israeli-Palestinian conflict practically impossible.\n\nThe Wall is not just a physical structure; it is a whole régime. It encircles entire communities in walled enclaves and, if completed, will wall-in most of the Palestinian population. It is already causing the displacement of Palestinian civilians and has imprisoned thousands of Palestinians between it and the Armistice Line of 1949, the Green Line. There is, moreover, without a doubt, a correlation between the route of the Wall and the illegal Israeli settlements in the Occupied Palestinian Territory and the water resources in the area.\n\nThere is also, of course, a correlation between the route of the Wall and Israel’s long-standing illegal policies and practices with regard to Jerusalem. East Jerusalem is occupied territory. The international community has never recognized Israel’s illegal annexation of East Jerusalem. The route of the Wall will clearly entrench this annexation. It will compound the humanitarian hardships being faced by the Palestinian inhabitants of the city. Moreover, it will isolate the city from the rest of the Palestinian population, obstructing their access to the city and its Holy Places.\n\nMr. President, Members of the Court, there has been no shortage of peace initiatives on the Middle East and the Israeli-Palestinian conflict. Yet, since the adoption of Security Council resolution 242 (1967), and throughout every one of the subsequent initiatives, Israel has simultaneously been engaged in the intensive colonization of our land. It has transferred 400,000 illegal settlers to the Occupied Palestinian Territory, including East Jerusalem. It is continuously attempting to change the status, physical character, nature and demographic composition of that territory, most recently through its construction of the Wall. Actually, since the signing in 1993 of the Declaration of Principles between the Government of Israel and the Palestine Liberation Organization, Israel not only continued its illegal settlement activities and expansion but actually doubled the number of its settlers in the Occupied Palestinian Territory, including East Jerusalem. Doubled. How can it be expected that the Palestinian people would continue to believe that peace was imminent under such circumstances?\n\nThere is near unanimity among the States in the world that building this Wall is unacceptable. The overwhelming majority of Member States believe that it is in contradiction to international law. The same overwhelming majority believes, as one group, the European Union, has officially declared, that the Wall renders “the two-State solution physically impossible”. Saving the Road Map thus and the prospects for peace requires a cessation of the construction of this Wall, its removal and non-recognition by States of any of its consequences.\n\nMr. President, Members of the Court, I wish now to address the issue of the suicide bombings, the security situation and Israel’s policies and practices in the Occupied Palestinian Territory. Israel claims that the construction of the Wall is a temporary defensive measure to prevent suicide bombings and provide security for Israel. This is not true, and the proof is simple. If this were in fact the case, then Israel would have constructed the Wall on its territory along the Armistice Line of 1949 and not in departure of the Armistice Line and almost entirely in the Occupied Palestinian Territory. If Israel wanted a Wall for security, it could construct it on its territory and raise it to 80 m rather than 8 m if it wished. This would not bode well for mutual coexistence of course, but no one would challenge its legality in principle.\n\nThe suicide bombings have led to the death of 438 Israelis in Israel. Four hundred and ninety Israelis, mostly soldiers and settlers, have also been killed by other kinds of violence. In contrast, since September 2000 and as of 18 February 2004, the Israeli occupying forces have directly killed, including many by extrajudicial execution, a total of 2,770 Palestinian civilians, including children, women and men. Of those killed, more than 1,200 Palestinians have been killed by the Israeli occupying forces in the Gaza Strip, even though Israel has already built another kind of wall surrounding the Gaza Strip. The question that must be asked is: how then will this Wall being built by Israel solve the security problem? If anything, its route and the illegal measures entailed in its construction ensure that it will actually exacerbate the security situation. It is more than obvious that when you deprive an entire people of their rights, expropriate their land and property and wall them into enclaves and ghettos, you are not solving the security problem but creating an untenable situation that will combust.\n\nAt this time, I wish to make our position vis-à-vis the suicide bombings very clear. We have consistently, repeatedly and unequivocally condemned these bombings. We condemn any violence directed at civilians in this conflict, whether Israeli or Palestinian. We consider the suicide bombings to be unlawful. They are also harmful to the just and honourable cause of the Palestinian people.\n\nThat said, I draw attention to the fact that the first suicide bombing occurred nearly 27 years after the onset of this oppressive military occupation of the Palestinian people. This phenomenon is the result of Israeli policies and measures, including the relentless colonization of our land. It is not the cause of those policies and measures. It is also imperative that a distinction be made between such unlawful acts of violence against Israeli civilians in Israel and acts of Palestinian resistance to the Israeli occupation and to military attacks by the occupying forces, consistent with international law. Nevertheless, Palestine reaffirms its commitment to a peaceful, negotiated solution to end this occupation and end this conflict.\n\nThere is a humanitarian crisis in the Occupied Palestinian Territory. Serious violations and grave breaches of international humanitarian and human rights law are being committed. The Wall, part and parcel of these violations and breaches, is severely exacerbating this situation. How can the Road Map truly succeed under such circumstances? It cannot. How can Israel expect the Palestinian side to be able to act effectively when it has destroyed Palestinian security capabilities and has confined the leader of the Palestinian people and elected President of the Palestinian Authority, Yasser Arafat, for more than two years, undermining the leadership’s ability to properly function? It cannot. How can Israel’s construction of this Wall and its continued confiscation and colonization of the Palestinian land lead to peace and security for both peoples? It cannot.\n\nThe colonization by Israel of the Palestinian land under its occupation and the attempts to change its legal status are not new phenomena. What is new, however, is the magnitude of Israel’s attempt to change the legal status and to effect the de facto annexation of large parts of the Occupied Territory by means of the Wall. The Wall will be the culmination of all previous illegal measures and practices carried out by Israel since 1967 towards that end. It will destroy the hopes of the Palestinian people for the realization of their inalienable rights, including the right to self-determination, and destroy their faith in the rule of international law and the international community’s ability to uphold it in the face of such grievous violations. It will destroy the hopes of the international community for implementation of the Road Map and the “two-State” solution of Israel and Palestine, both living side by side within secure and recognized boundaries. Such a lamentable outcome must be avoided at all costs.\n\nMr. President, Members of the Court, this factual presentation is in two parts. I will describe the nature and route of the Wall. Then, I will outline its effects at the local, regional and national levels. This presentation is based on reports included in the United Nations dossier before you. I am joined by Professor Jarat Chopra of Brown University.\n\nThe nature and route of the wall\n\nNow, let me turn to the nature and route of the Wall. The Wall complex varies in width between 30 m and 100 m, with closed military zones on either side. As the slide indicates, the Wall complex includes a number of components: stacks of coils of barbed and razor wire, trenches, an electrified fence with automatic sensors, a paved road for Israeli patrols, a sand trace path to detect footprints, a dirt area, and surveillance cameras.\n\nIn some places, the Wall is made of concrete and is 8 m high, including around Occupied East Jerusalem. In Qalqilya, the concrete Wall is lined with watch towers approximately 300 m apart.\n\nGates are also one of the features of the Wall. According to the United Nations, there are 37 gates built into the Wall. Approximately half of these gates are not operating. Some gates open for short 15-minute intervals only two or three times a day. However, the opening times change unpredictably and Palestinians have to wait for soldiers to open the locks. A number of gates have never been opened, like the one shown on this slide.\n\nThe United Nations Secretary-General’s reports divide construction of the Wall into four phases. A fifth phase of construction is projected, as noted by the United Nations Special Rapporteur and the Commission on Human Rights. On this map, the blue represents Israeli settlements. Phase A of the Wall is completed and is illustrated by the solid red line. This phase extends from Salem to the Israeli settlement of “Elkana”. Phase A also includes two sections of the Wall north and south of Jerusalem. Phase B extends from the Jordan River and south to Tayasir. This latter portion is the beginning of an Eastern Wall. A majority of Phase B has been completed, and the broken red lines indicate areas either approved or under construction. Phase C of the Wall extends from the settlement of “Elkana” to Jerusalem. Much of the current construction is occurring in this phase. Phase D has been approved and will extend from the Israeli settlement of “Gilo” to the south-east of Hebron. A fifth phase in the east is projected to extend along the entire Jordan Valley.\n\nIf completed, the total length of the Wall will be between 700 km and 800 km, and it will enclose some 56.5 per cent of the West Bank inside the Wall.\n\nThis slide illustrates how the Wall significantly deviates from the Green Line in Occupied East Jerusalem. It weaves in and around the Palestinian population, residing in areas indicated in grey, separating Palestinian from Palestinian. It also creates enclaves of Palestinian populated areas and isolates East Jerusalem from the remainder of the West Bank. The Wall denies worshippers access to holy sites in Jerusalem’s Old City. You can also see how the Wall extends around Israeli settlements, which are shown in blue on the map.\n\nThe relationship between the route of the Wall and settlement expansion is clearly illustrated in the Qalqilya area. The Wall has been routed around the planned expansion areas of the “Zufin” and “Alfe Menashe” settlements, as shown by the light blue. The Wall is also routed around the roads that link the settlements with each other and to Israel, as shown by the light blue lines. The result of this pattern is the enclosure of Qalqilya.\n\nNot only in Qalqilya, but throughout the West Bank, the route of the Wall corresponds to Israeli settlements. The dark blue represents existing settlements. The light blue represents planned settlement expansion areas. The grey represents the jurisdictional areas of settlements, which are reserved for future settlement expansion and other settlement activities. The route of the Wall, in red, corresponds to these Israeli settlement areas.\n\nThe effects of the Wall\n\nMr. President, Members of the Court, I would now like to draw your attention to the effects of the Wall at the local, regional, and national levels.\n\nAt the local level, Palestinians are being separated from their land and deprived of their water resources. On this map, the Green Line is indicated. The yellow line represents Palestinian village boundaries. The brown areas are agricultural areas. The blue circles are water wells. And the red line is the Wall weaving its way through the West Bank. The blue areas are Israeli settlements and the dotted blue lines again represent planned settlement expansion.\n\nJayyus is a village of approximately 3,000 people, the majority of whom depend on farming. Approximately two thirds of the village land is now situated to the west of the Wall, separating villagers from their land and water wells. Consequently, these farmers of Jayyus are no longer investing in their land. The picture on the right is a view from Jayyus of its land on the other side of the Wall.\n\nAt the regional level, the Wall has also had a serious impact. For instance, due to the complete enclosure of Qalqilya by the Wall and a gate, some one third of the shops have closed and unemployment rates have increased. The impact on the villages dependent upon Qalqilya has also been severe. People’s access to basic services has declined dramatically. For example, a United Nations hospital in Qalqilya has experienced a 40 per cent decrease in caseloads since the enclosure of Qalqilya and the surrounding areas. Both Qalqilya and the neighbouring villages are separated from almost all of their agricultural land in what is considered to be part of the “Bread basket” of the West Bank. Because of these conditions, Palestinians are leaving the area.\n\nThe Wall is also disrupting access to education. These photographs illustrate students at gates waiting for Israeli soldiers to open the locks and allow them through.\n\nAt the national level, a significant portion of the water fields will be situated outside of the Wall, as shown by the shaded areas on the left map. Consequently, Palestinian capacity to develop the national economy and agricultural base will be significantly curtailed.\n\nAs shown by the map on the right, main urban centres throughout the West Bank are being isolated by the construction of the Wall. As in the case of Qalqilya, the capacity of these main centres to provide regional services and to drive economic development is being extensively eroded by the Wall. The Wall is also rerouteing the movement of goods and people, significantly increasing travel times.\n\nExacerbating the existing effects caused by the Wall, Israel has issued military orders declaring the area between the Wall and the Green Line a “Closed Zone”. According to these military orders, Palestinian residents over the age of 12 within the Closed Zone must apply for a permit to live in their own homes and remain on their land. In addition, Palestinians living inside the Wall wishing to access their land, to work or visit relatives in the Closed Zone must obtain access permits. Israeli citizens are exempt from this permit system. Significantly, obtaining a permit to enter the Closed Zone does not guarantee access because of gate closures. Altogether these procedures are causing Palestinians to leave their homes. Thank you, Mr. President, Members of the Court.\n\nThe Assembly has determined in resolution ES 10/13 that the Wall is “in departure of the Armistice Line of 1949 and is in contradiction to relevant provisions of international law”. That resolution does not, however, answer all questions; it leaves open important questions. For example, in what respects, and under which rules of international law, is the Wall illegal? What must be done to restore the situation to legality? And what are the duties of States in the meantime?\n\nI have three main points to put before the Court:\n\nfirst, that Israel has, in the Occupied Palestinian Territory, only the rights of an Occupying Power, which are conferred by and limited by international law, and that the construction and operation of the Wall does not fall within those rights;\n\nsecond, that Israel, as the Occupying Power, is legally bound to ensure the rights prescribed by international law for those persons lawfully resident in Palestine, and that the Wall violates those rights; and\n\nthird, that the effect of the Wall is to change the status of the Territory in a manner tantamount to annexation, in violation of international law.\n\nLet me begin with the underlying question of the legality of the Wall. The issue here is not whether Israel has the right to build a wall: it is whether it has the right to build the Wall in the Occupied Palestinian Territory. Palestine’s main point is that whatever security effects the Wall might have could be secured by building the Wall along the Green Line, on Israeli territory, so that there is no legal justification for building it in the Occupied Palestinian Territory.\n\nAs you have already seen, the construction of the Wall has involved both the taking of land and the destruction of Palestinian property in the Occupied Palestinian Territory. Under international law the requisitioning of land and the destruction of property are permissible only within narrow and closely defined limits.\n\nRequisitioning of land is governed by Article 52 of the 1907 Hague Regulations, which stipulates that “requisitions in kind and services shall not be demanded from municipalities or inhabitants except for the needs of the army of occupation”.\n\nIsrael admits that the route of the Wall is designed to protect Israeli civilian settlements which have been built in the Occupied Palestinian Territory, including East Jerusalem. It has explicitly said so, for example in the confiscation notice which is quoted beneath photograph 9 in Volume 1 of the Annex to our Written Statement. In any event, the map speaks for itself. The Wall departs from the Green Line in order to fix the settlements on what is no doubt thought of as the “Israeli” side of the line. Perhaps the most striking examples are in the areas around Qalqilya and the Israeli settlement “Ariel”, and in and around East Jerusalem.\n\nThose settlements were themselves created in violation of international law. Article 49 (6) of the Fourth Geneva Convention prohibits the transfer by an Occupying Power of parts of its own civilian population into the occupied territory. As a Legal Adviser to the United States State Department said, in relation to Israeli settlement policy, that prohibition “extends clearly to reach such involvements of the occupying power as determining the location of settlements, making land available and financing of settlements, as well as other kinds of assistance and participation in their creation” (paras. 464 and 465 of Palestine’s Written Statement). He concluded that Israel was in breach of that prohibition. Numerous Security Council and General Assembly resolutions have determined that the settlement activities breach international law.\n\nNow the breach is a serious matter. It is declared to be a “grave breach” of international law by Article 85 of Additional Protocol I to the Geneva Conventions.\n\nThe logic is inescapable. The civilian settlements are unlawful. Therefore there is no right to divert the Wall from the Green Line in order to protect those unlawful settlements. Therefore the confiscations of Palestinian land for that purpose violate international humanitarian law. The Wall, away from the Green Line, has been constructed, and Palestinian property has been taken, for a legally impermissible purpose. There is no need to examine security concerns and arguments in depth in order to appraise the legality of those diversions.\n\nSimilarly, the destruction of Palestinian property for the purpose of constructing the Wall is far removed from anything that is, in the words of Article 53 of the Fourth Geneva Convention, “rendered absolutely necessary by military operations”. There are no such military operations, in the sense in which Article 53 of the Convention uses the term. Indeed the route of the Wall sometimes seems to have been devised with a view to the infliction of wanton damage. The photograph is of the former market of Nazlat Issa, on which the livelihood of hundreds of Palestinian families depended. It was destroyed by the Israeli army “out of necessity to protect Israeli settlements in the area”. The nearest Israeli settlement is 4 km away.\n\nOn this point, Palestine accordingly respectfully suggests that the Court should advise the General Assembly that the building and operation of the Wall in the Occupied Palestinian Territory, including in and around East Jerusalem, violates international law.\n\nThe impact of the Wall on the basic human rights of the men, women and children in the Occupied Palestinian Territory is graphically illustrated in the United Nations reports, and by the reports of B’Tselem, the Israeli human rights organization.\n\nThere are two broad categories of violations. First, there are the direct seizures of land and destruction of property that the construction of the Wall entails. And those I have addressed already. Second, there are the rights that are violated as a result of the restrictions on the movement and residence of the Palestinian population that are imposed under the régime of the Wall. These violations affect the entire population of the Occupied Palestinian Territory, not simply those whose property is taken or those who have been walled in by the Israeli Government.\n\nThe scale of those violations must be understood. This is not a technical squabble over Israeli trespass on Palestinian land. Three of the United Nations reports within the last year (the Bertini37, Dugard38 and Ziegler39 reports) concluded that there is a humanitarian crisis their words, not mine in the Occupied Palestinian Territory, and one that is man-made.\n\nWe had intended to take the Court to passages in those reports that epitomise conduct in clear violation of international humanitarian law and international human rights law. We understand, however, the Court’s desire to focus at this stage on law rather than facts; and last Wednesday the International Committee of the Red Cross issued a statement which captures the essence of what we, and the various United Nations and other reports, are trying to communicate and fixes it precisely in its legal context. It states the following:\n\n“The ICRC is increasingly concerned about the humanitarian impact of the West Bank Barrier on many Palestinians living in occupied territory. Where it deviates from the ‘Green Line’ into occupied territory, the Barrier deprives thousands of Palestinian residents of adequate access to basic services such as water, health care and education, as well as sources of income such as agriculture and other forms of employment. The Palestinian communities situated between the ‘Green Line’ and the Barrier are effectively cut off from the Palestinian society to which they belong. The construction of the West Bank Barrier continues to give rise to widespread appropriation of Palestinian property and extensive damage to or destruction of buildings and farmland. The ICRC has repeatedly condemned deliberate attacks against Israeli civilians and stressed that all acts intended to spread terror among the civilian population are in clear violation of international humanitarian law (IHL). It recognizes Israel’s right to take measures to ensure the security of its population. However, these measures must respect the relevant rules of IHL. The ICRC’s opinion is that the West Bank Barrier, in as far as its route deviates from the ‘Green Line’ into occupied territory, is contrary to IHL. The problems affecting the Palestinian population in their daily lives clearly demonstrate that it runs counter to Israel’s obligation under IHL to ensure the humane treatment and well-being of the civilian population living under its occupation. The measures taken by the Israeli authorities linked to the construction of the Barrier in occupied territory go far beyond what is permissible for an occupying power under IHL. These findings are based on the ICRC’s monitoring of the living conditions of the Palestinian population and on its analysis of the applicable IHL provisions. The Israeli authorities have been regularly informed about the ICRC’s humanitarian and legal concerns. The ICRC therefore calls upon Israel not to plan, construct or maintain this Barrier within occupied territory.”\n\nI would respectfully direct the Court’s attention to the Written Statement submitted in this case by the Swiss Government, which has a particular position as the official depository of the Geneva Conventions. It is helpful to read the words of the ICRC alongside that statement.\n\nPalestine’s Written Statement identifies the main provisions of international humanitarian law and international human rights law that are applicable in this context. It identifies breaches of several provisions of the International Covenant on Civil and Political Rights, which Israel has ratified. They include Articles 12, on freedom of movement, and 17 on the right to family life. There are breaches of the International Covenant on Economic, Social and Cultural Rights, also ratified by Israel, including Articles 11 and 12, on the right to food and to medical care, and Article 13 on the right to education. There are also breaches of the Convention on the Rights of the Child, again, ratified by Israel. Palestine attaches particular importance to this. Children constitute over half of the Palestinian population. The Written Statement identifies breaches of Articles 24 and 27, on the right to food and medical care, Article 28 on the right to education, and Article 16 on the right to family life.\n\nThe response of many Israeli officials has been: the Wall is the price that supporters of terrorism must pay; the solution lies in the hands of the Palestinian Authority. That is an unacceptable response, and not only because of Israel’s repeated incursions into the territory, its destruction of the Palestinian security apparatus and institutions, its imposition of curfews and roadblocks, and its construction of the Wall all of which steps have undermined the Palestinian Authority.\n\nThe response is unacceptable first, because Israel, as Occupying Power, carries the legal responsibility to ensure basic human rights in the Occupied Palestinian Territory. It cannot claim the rights of a military occupant without accepting the corresponding responsibilities.\n\nSecond, that response is tantamount to the imposition of a collective punishment. The Palestinian Authority has consistently condemned terrorist attacks on Israeli civilians; and it is as absurd as it is offensive to imply that all Palestinians are engaged in a murderous conspiracy to attack Israel. To impose the Wall, and all the consequent restrictions on movement and access to property, jobs, welfare, education and families, as a punishment on the whole Palestinian population is unfair, unprincipled, and illegal. It appears to be, as was noted in one of the United Nations reports, a form of collective punishment in retribution for attacks on Israel40. Collective punishments are specifically prohibited by the Laws of War, under Article 147 of the Fourth Geneva Convention and Article 75 of Additional Protocol I.\n\nThird, it is evident that the Wall, in so far as it departs from the Green Line and is built in Occupied Palestinian Territory, cannot be justified by appeals to Israel’s security interests. Israel’s legitimate interests can, as we have explained in our Written Statement, be protected by building the Wall on Israel’s soil; Israel has no legal right to take Palestinian land and destroy Palestinian property in order to protect unlawful settlements in the Occupied Palestinian Territory. Palestine accepts the right of every State to take protective measures. But those measures must be lawful. States cannot cast off all legal and moral constraints by merely calling on the name of “security interests”.\n\nThe question before the Court is whether the Wall, as described in the Secretary-General’s report, violates international humanitarian law and international human rights law. Our Written Statement sets out detailed submissions on this issue; but the point is a simple one. Having read the Secretary-General’s report and the reports that are appended to it, can the Court realistically say that it doubts whether Israel is violating international law in the Occupied Palestinian Territory? Having read through the supporting documents put before it in response to its request to States to provide relevant information, can it say that there is no reason to believe that, as the ICRC put it, “the measures taken by the Israeli authorities linked to the construction of the Barrier in occupied territory go far beyond what is permissible for an occupying power”?\n\nPalestine respectfully suggests that the Court should advise the General Assembly that Israel is obliged to ensure for the residents of the Occupied Palestinian Territory the rights to which they are entitled under international humanitarian law and international human rights law; that those rights include the rights listed in paragraphs C, D, and E of the Order of the Court of 10 July 2004; that the Wall that Israel is building in the Occupied Palestinian Territory violates those rights; and that Israel is obliged to cease forthwith the construction of the Wall, to dismantle forthwith the structure therein situated, to repeal or render ineffective forthwith all legislative and regulatory acts relating thereto, and to make reparation for all damage caused by the construction of the Wall, in accordance with international law."
    },
    {
        "voto": 1,
        "juez": "Palestine",
        "pregunta": "Israel is under an obligation to terminate its breaches of international law; it is under an obligation to cease forthwith the works of construction of the wall being built in the Occupied Palestinian Territory, including in and around East Jerusalem, to dismantle forthwith the structure therein situated, and to repeal or render ineffective forthwith all legislative and regulatory acts relating thereto, in accordance with paragraph 151 of this Opinion",
        "texto": "Three specific elements of that resolution should be highlighted: First, it demanded that Israel stop and reverse the construction of the wall in the Occupied Palestinian Territory, including in and around East Jerusalem, which is in departure of the Armistice Line of 1949 and is in contradiction to relevant provisions of international law. Second, it requested the Secretary-General to report on compliance. And, third, it expressly stated that upon receipt of the first report further actions should be considered, if necessary, within the United Nations system. The wording of that third element reflected a compromise on the means of following up the issue, including the possibility of a request for an advisory opinion from this Court on the legal consequences in case of non-compliance. The phrase could not have meant anything other than a reference to the Court, and, regardless of the claim made in one Written Statement of a different understanding, it is indisputable that the idea for requesting an advisory opinion was widely discussed and debated.\n\nFollowing the resolution's adoption, Israel not only continued but accelerated its construction of the Wall on Palestinian territory. The Secretary-General, pursuant to the resolution, presented a report containing a clear factual presentation about the Wall. It concluded that Israel is not in compliance with the Assembly's demand that it stop and reverse the construction of the wall in the Occupied Palestinian Territory.\n\nAccordingly, the emergency special session resumed again on 8 December 2003, and adopted by a large majority resolution ES-10/14 requesting this Court to urgently render an advisory opinion on the legal consequences arising from Israel's construction of the Wall.\n\nMr. President, Members of the Court, Israel's Written Statement to the Court claims that it does not deal with the merits of the case. We beg to differ. The Israeli statement is rife with attempts to justify the construction of the Wall through the presentation of a detailed case on terror attacks and through political arguments, including on the Road Map. Israel repeatedly refers to the Road Map and to Security Council resolution 1515 (2003). This is ironic. The Government of Israel has never wanted this Road Map, it has never wanted the Security Council's endorsement of it and has repeatedly caused the delay of both. After the Road Map was formally presented in April 2003, the Israeli Government would not say that it accepted the Road Map itself but only what it called \"the steps set out in the Roadmap\". Even then, in accordance with the Israeli Cabinet Statement of 25 May 2003, 14 reservations were attached to it.\n\nIsrael later vehemently objected to the Russian Federation initiative to bring the Road Map to the Security Council for endorsement. When Security Council resolution 1515 (2003) was finally adopted on 19 November 2003, the Council held no debate. This was due to Israel's opposition. Then, on 17 December 2003, Israel undermined the traditional consensus on a General Assembly resolution on \"Assistance to the Palestinian People\" specifically because the European Union, co-sponsoring the resolution, added a paragraph welcoming the endorsement by the Council of the Road Map in resolution 1515. Israel made its adherence to consensus on that resolution conditional upon the removal of the reference to resolution 1515, which did not occur."
    },
    {
        "voto": 1,
        "juez": "Palestine",
        "pregunta": "Israel is under an obligation to make reparation for al1 damage caused by the construction of the wall in the Occupied Palestinian Territory,including in and around East Jerusalem",
        "texto": "Mr. President, Members of the Court, it is my privilege and pleasure to stand before you again today, on behalf of Palestine, to address the issue of the applicable law to the Occupied Palestinian Territory.\n\nThis issue is treated at some length in Palestine’s Written Statement, so I shall limit myself to highlighting and elaborating further only on some salient points. The question put to the Court by the General Assembly focuses mainly on international humanitarian law via the reference to the Fourth Geneva Convention and by characterizing the Territory as “occupied” by reference to that law. But the rules and principles of international laws that have a bearing on the situation have a much wider scope than that. In the first place, closest to the rules and principles of international humanitarian law, and increasingly intertwined with them are those of the international law of human rights.\n\nBut there are also the general rules of international law, particularly two of its cardinal, constitutive, principles Professor Crawford has just been referring to. One of them, namely, the prohibition of the individual use of force and its corollary, the prohibition of conquest or the taking of territory by force, and the principle of equal rights of peoples and their right to self-determination. But as my colleagues Professors Vaughan Lowe and Jean Salmon will be dealing with aspects of the latter two categories and given the limitations of time, I shall concentrate my remarks on international humanitarian law, or the jus in bello.\n\nUp to the Geneva Conventions of 1949, the instruments codifying these rules did not explicitly define the circumstances triggering their application. By contrast, the Geneva Conventions instructed by the experiences of the Second World War in Article 2 common to the four Conventions, state in paragraph 1: “the present Convention shall apply to all cases of declared war or of any other armed conflict which may arise between two or more of the High Contracting Parties, even if the state of war is not recognized by one of them”.\n\nThe Hague Regulations, for their part, define, in Article 42, the circumstances under which “a territory is considered occupied” and these circumstances are, again according to that Article, “when it is actually placed under the authority of the hostile army”.\n\nThat is exactly what happened in 1967. In the course of an armed conflict between several States, Israel invaded and occupied militarily, inter alia, the West Bank and Gaza, formerly part of the British mandated territory of Palestine, which had never been before under Israeli jurisdiction or administration. In other words, an armed conflict as provided for in Article 2, paragraph 1, of the Geneva Convention, brought about a situation falling under Article 42 of the Hague Regulations. A typical case of belligerent occupation.\n\nThese are clear texts that dispose clearly of the matter. But Israel contests this conclusion on the basis of the second paragraph of Article 2 of the Fourth Convention, which provides: “The Convention shall also apply” so this is a second case “to all cases of partial or total occupation of the territory of a High Contracting Party, even if the said occupation meets with no armed resistance.”\n\nThis provision was added ex abundante cautela in 1949 to cover the case of occupatio pacifica, that meets with no armed resistance, like the occupation of the Suddeten in 1938. Even that is considered an occupation, and triggers the application of the Convention. But in such cases, as there is no visible armed conflict, there is a need for another criterion which explains the reference to the legal status or title to the territory thus occupied, a title which does not belong to the occupant.\n\nBut in cases of belligerent occupation, covered by the first paragraph of Article 2, what matters is the taking of control over the territory in the course of an international armed conflict, and maintaining it by military force; not the title of the entity that was peacefully administering the territory before the occupation, or any other entity that may have a claim on this. This particularly applies to claims laid by the belligerent occupant on the occupied territory. It would make a mockery of the law if an invader could evade the application of the jus in bello by merely formulating a claim on the territory it occupies by force. It would be tantamount to an invitation to annex the territory.\n\nThis rule also applies, regardless of the characterization of the use of force by the belligerent occupant, that is whether it is an alleged aggressor or allegedly exercising self-defence. For it is a cardinal principle of jus in bello that its rules apply equally to all parties, irrespective of their rights and wrongs under the jus ad bellum.\n\nI shall not go into the specific arguments of Israel relating to the non-incorporation of the Hague Rules and the Fourth Geneva Convention into its municipal law, nor on the alleged application de facto of only the humanitarian components of the Fourth Geneva Convention. After all, are there any non-humanitarian components in the Geneva Conventions? Even the procedural aspects provide guarantees for the observance of the substantive protective rules. And can one apply only de facto instruments and rules by which one is legally bound? Indeed, this august Court itself has found that both the Hague Regulations and the Geneva Conventions have passed into general international law (Legality of the Threat or Use of Nuclear Weapons, I.C.J. Reports 1996, para. 79) and even characterize them as being intransgressable not to use jus cogens. As such they are universally binding, regardless of the conventional limitations that may be attached to them as treaties.\n\nThe same can be said of most of the provisions of Additional Protocol I to the Geneva Conventions, in any case those provisions that may be relevant here, such as Article 75 on Fundamental Guarantees.\n\nMr. President, Members of the Court, I have been addressing the legal rationale of the applicability of the law of belligerent occupation to the Occupied Palestinian Territory. But this rationale, moreover, has been endorsed by almost the unanimity of the international community apart from Israel.\n\nI need not recapitulate here all the resolutions of the General Assembly and the Security Council, or of the Conference of the Contracting Parties to the Fourth Geneva Convention or the declarations of the International Committee of the Red Cross, the latest being on the 18th of this month and the ICRC is the institutional guardian of the Conventions or of the different States or groups of States. All these declarations assert the applicability de jure of the Fourth Convention to the Occupied Palestinian Territory (Palestine Written Statement, paras. 387-392). I would like simply in this respect to make a short remark on the status and role of the General Assembly and Security Council resolutions which are specifically referred to in the request for the advisory opinion.\n\nThe Israeli statement in these proceedings, in an attempt to undermine the basic role of the General Assembly, which has just been described by Professor Crawford, declares: “Resolution ES-10/13, which purports to determine illegality, cannot properly be relied upon as an authoritative determination of legality. It is not binding.” (P. 116, para. 9.9.) The Statement contrasts that resolution with Security Council Resolution 276 (1970) (ibid., para. 9.10), which was referred to in the request for an advisory opinion in the Namibia case (I.C.J. Reports 1971). However, in that very Advisory Opinion on Namibia the Court has said: “it would not be correct to assume that, because the General Assembly is in principle vested with recommendatory powers, it is debarred from adopting, in specific cases within the framework of its competence, resolutions which make determinations or have operative designs”\n\nMaking determinations is part and parcel of the functions of the General Assembly and the Security Council. It is only on the basis of such determinations that they can envisage further action, on items they deal with, within the limits of their powers under the Charter. This is the quasi-judicial role of these two organs, as has been already described by the regretted Professor Oskar Scharffer already in 1964.\n\nThe Court has, on numerous occasions, particularly in advisory proceedings, recognized and acted upon such determinations by the General Assembly and the Security Council, and has never, to my knowledge at least, ignored or set aside such a determination.\n\nOf particular significance to the question put to the Court are the resolutions of the General Assembly and the Security Council relating to settlements and the annexation of East Jerusalem and its surroundings. These resolutions, particularly several resolutions of the Security Council, adopted unanimously with the positive vote of the United States, determine I am quoting from the dispositif of such resolutions the illegality of the settlements (see Palestine Statement, paras. 165-167), and of the annexation of Jerusalem, characterizing this annexation as a flagrant violation of the Fourth Geneva Convention, that does not affect the continued applicability of that Convention to Jerusalem and the rest of the Occupied Territory (ibid., paras. 168, 361-364). Resolution 478 goes even further and determines that “all legislative and administrative measures taken by Israel, the occupying Power, which have altered or purport to alter the status and character of the Holy City of Jerusalem... are null and void... and must be rescinded forthwith...”\n\nMr. President, I turn now very briefly to the content of international humanitarian law inasmuch as it regulates belligerent occupation.\n\nArticle 42 of the Hague Regulations defines belligerent occupation as a de facto status arising from the effective control of the territory by a hostile army, and extending only as far as this effective control (or “authority” as it calls it) “has been established and can be exercised”. International humanitarian law takes cognizance of this de facto status, to which it attaches legal consequences or a régime. This legal régime is guided by two major principles:\n\nThe first is that occupation is a temporary (or transient) state of affairs. It is an abnormal or emergency situation, and the law of occupation tries to strike a balance between, on the one hand, accommodating the military needs of the Occupying Power in prosecuting the war and its war aims and, on the other hand, protecting the rights, freedoms and welfare of the population of the occupied territory, as well as their normal way and train of life from being excessively disturbed and affected by the occupation.\n\nIn this respect, international humanitarian law, while recognizing to the Occupying Power the prerogatives of government over the occupied territory, imposes on it the positive obligations of government in terms of restoring and ensuring “public order and safety” (Article 43 of the Hague Regulations), as well as ensuring food and medical supplies and services for the population to the fullest extent possible (Articles 55 and 56 of the Fourth Geneva Convention) as well as respecting their human rights and dignity and so forth.\n\nThe second governing principle of the law of occupation is that occupation, being a temporary, transient régime, cannot affect nor transfer sovereignty to the Occupying Power. In this respect, the régime of occupation operates to a large extent as an interim measure (une mesure conservatoire), by freezing the status juris of the occupied territory for as long and as far as occupation remains effective; so that it cannot be changed by any unilateral act or action on the part of the Occupying Power.\n\nThe legal effects of this principle are reflected in Article 47 of the Fourth Convention which provides: \n\n“Protected persons who are in occupied territory shall not be deprived, in any case or in any manner whatsoever, of the benefits of the present Convention by any change introduced, as the result of the occupation of a territory, into the institutions or government of the said territory, nor by any agreement concluded between the authorities of the occupied territories and the Occupying Power, nor by any annexation by the latter of the whole or part of the occupied territory.”\n\nBut the law of occupation goes even further. It enjoins the Occupying Power to leave things as they were before the occupation to the fullest extent possible; for example, “not [to] alter the status of public officials and judges” in Article 54 of the Geneva Convention. In the same vein, Article 43, which I have just referred to, of the Hague Regulations directs the Occupying Power to “take all measures in his power to restore and to ensure, as far as possible, public order and safety” and here is a clause I want to underline “while respecting, unless absolutely not necessarily absolutely prevented, the laws in force in the country” (and the same about criminal laws in Article 64 of the same Convention).\n\nReferring to Article 43, the ICRC Commentary on the Fourth Geneva Convention says the following: “This provision of the Hague Regulations is not applicable only to the inhabitants of the occupied territory, it also protects the separate existence of the State, its institutions and its laws.”\n\nIndeed, the protection of the separate status and corporate existence of the occupied territory is reflected in the Hague Regulations by the protection they provide not only to private property (Arts. 46 and 47), but also to the commons and to public property in the form of “public buildings, real estate, forests and agricultural estates” of which “the occupying power shall be regarded only as administrator and usufructuary” and “must safeguard the capital of these properties and administer them in accordance with the rules of usufruct”.\n\nThe prohibition of effecting durable changes by the unilateral act or action of the Occupying Power is not limited to the formal legal status of the territory (through a purported change of sovereignty). It extends also to such changes in the human and material components of the occupied territorial entity whence the prohibition, in Article 49 of the Fourth Convention, of demographic changes through “individual or mass forcible transfer as well as deportation” of civilians outside the occupied territory; as well as the deportation or transfer by the Occupying Power of “parts of its own civilian population into the territory it occupies”.\n\nThese prohibited acts constitute, under the Geneva Conventions and Article 147 particularly of the Fourth Convention, as well as Article 85 of Protocol I and Article 8 of the recent Rome Statute, grave breaches of international law which entail individual criminal responsibility.\n\nMr. President, it is by the standards of this legal régime that the legality of the Wall has to be assessed, and the justifications provided by Israel for its construction have to be weighted.\n\nOne of these justifications, self-defence, does not belong to international humanitarian law or the jus in bello, but to the jus ad bellum. Israel makes here an impermissible confusion between the two branches of the law of war that have to be kept radically apart. Once an armed conflict is brought into being, the jus in bello (or international humanitarian law) comes into play, as the lex specialis governing the ensuing situation regardless of the rules of the jus ad bellum.\n\nMoreover, logically, how can one say that a State exercises self-defence against a territory under its own military occupation, that is under its effective control, and in which it has the authority and even the obligation to “ensure public order and safety” according to Article 43 of the Hague Regulations? Can the Wall be then be justified as a military necessity? One of the great advances of international humanitarian law is that it has moved away from Clausewitz’s concept of military necessity as Kriegsraison, i.e. the idea that the aims of war justify using any means considered necessary to achieve them.\n\nThat concept of military necessity is ultimately negatory of international humanitarian law. Fortunately, at least since the Hague Regulations of 1899, it has been replaced by the modern and much narrower concept of military necessity, strictly limited to the contexts in which it is expressly recognized and under the conditions set by the provision in the relevant instruments that recognizes it.\n\nThose conditions include, in particular, specificity and proportionality. It is in this sense that the Declaration of the Contracting Parties to the Fourth Geneva Convention states in paragraph 5 that “the Fourth Geneva Convention, which takes fully into account imperative military necessity, has to be respected in all circumstances”\n\nThen we have to look in the Geneva Convention or the Hague Regulations. Where can we find in them a recognition of a military necessity (or even of a legitimate military need) that can be invoked to justify the Wall?\n\nIn my submission, the only possible justification for the Wall is as a safety measure taken by Israel in the exercise of its authority as an Occupying Power under Article 43 of the Hague Regulations and Article 27 of the Fourth Geneva Convention.\n\nAs my colleague Professor Vaughan Lowe will explain, neither provision justify the building of a Wall to protect civilian citizens of the Occupying Power implanted in the occupied territory. The argument that a similar barrier around Gaza has proved effective in reducing the attacks while debatable, as Ambassador Al-Kidwa has mentioned in his introductory speech still this argument, even if it were true, intentionally ignores the fact that the wall around Gaza had for purpose had for avowed purpose to seal it off hermetically; and that is what Israel is emphatically denying being the purpose and effect of the Wall in the West Bank. Why? Because if it admits that the purpose is for it to hermetically seal what is within the Wall, that will confirm all its flagrant features violative of international humanitarian law.\n\nThe Wall also starkly fails the test of necessity and proportionality as a security measure, because of the hundreds of thousands of Palestinians who remain unchecked on the other side of the Wall, on the western side for example. Unless of course they are made, directly or indirectly, to leave that area; which would constitute another flagrant grave breach of Article 49 of the Geneva Convention. Not much for possible justification.\n\nFinally, Mr. President, may I say in conclusion, that arguing on the basis of the law of occupation does not mean recognition or acceptance of the legality of this occupation, particularly when it turns into prolonged occupation that borders on annexation. Thank you, Mr. President."
    },
    {
        "voto": 1,
        "juez": "Palestine",
        "pregunta": "All States are under an obligation not to recognize the illegal situation resulting from the construction of the wall and not to render aid or assistance in maintaining the situation created by such construction; all States parties to the Fourth Geneva Convention relative to the Protection of Civilian Persons in Time of War of 12 August 1949 have in addition the obligation, while respecting the United Nations Charter and international law, to ensure compliance by Israel with international humanitarian law as embodied in that Convention",
        "texto": "We are here because the United Nations has a permanent responsibility—legally, politically and morally—for the question of Palestine until the question is resolved in all its aspects. The General Assembly has reaffirmed this in at least 25 resolutions. It is, after all, the General Assembly that, in accordance with the Charter of the United Nations, dealt with mandated Palestine, deciding on 29 November 1947, in resolution 181 (II), to partition Palestine into two States, one Jewish and one Arab. The Arab State has, of course, not yet been realized; and thus the Palestinian people have been unable to exercise their right to self-determination. Indeed, Palestine is still not a Member State of the United Nations, but remains an observer. Since 1947, however, the General Assembly has never ceased dealing with the question of Palestine or its aspects.\n\nOver the years, in light of the Council’s inaction, the General Assembly has tried to discharge its own responsibilities in line with General Assembly resolution 377 (V) of 1950. Four of its ten emergency special sessions have been on Palestine and the Middle East situation. In reaction to the last veto, the tenth emergency special session was resumed to consider the situation. Like the Security Council, the Assembly conducted a serious debate on the issue and two draft resolutions were submitted. One requested the International Court of Justice to issue an advisory opinion on the Wall. After intensive consultation and negotiations, however, the Members of the European Union introduced a draft resolution, with the understanding that the co-sponsors of the original two drafts would not insist on a vote on those drafts. The European Union co-sponsored draft resolution was adopted by an overwhelming majority, on 21 October 2003, as resolution ES-10/13."
    },
    {
        "voto": 1,
        "juez": "Palestine",
        "pregunta": "The United Nations, and especially the General Assembly and the Security Council, should consider what further action is required to bring to an end the illegal situation resulting from the construction of the wall and the associated régime, taking due account of the present Advisory Opinion",
        "texto": "The Road Map could be different; and we hope that it will be. It is rooted in the principles of resolution 242 (1967) and in the vision affirmed by the Security Council in resolution 1397 (2002) of “a region where two States, Israel and Palestine, live side by side within secure and recognized borders”. This initiative deserves a chance — we want it to succeed. But Israel cannot once again be permitted to continue its ceaseless taking of Palestinian property and rights, under the cover of the peace process or the semblance of a peace initiative. The legal rights of the Palestinian people cannot simply be ignored or suspended whenever there is a peace process under way. That plays into the hands of extremists on both sides. One of our chief hopes is that the Court will make it clear that the Palestinian people have rights and that international law is not irrelevant to the situation in the Occupied Palestinian Territory."
    }
]