[
    {
        "voto": 1,
        "juez": "Chile",
        "pregunta": "Finds that it has jurisdiction to give the advisory opinion requested",
        "texto": "Moving to the first point, it is Chile’s position that the Court has jurisdiction to give the requested advisory opinion and that there are no compelling reasons for the Court to refuse to do so.\n\nAs already stated in its written statements, Chile considers that the fact that a legal question may also involve certain political aspects or the fact that the parties concerned should pursue negotiations does not bar the Court from its jurisdiction. Indeed, complex situations, such as the Israeli-Palestinian conflict, are precisely the ones that can benefit the most from a clarification of the applicable law by this Court.\n\nWith regard to the principle of judicial propriety, which has been a matter of some debate in these proceedings, Chile underscores the fact that, by their very nature, advisory opinions do not resolve contentious disputes, and does not share the view of a few other States that rendering an advisory opinion in this case would be at odds with the agreed negotiation framework dealing with the ultimate status of the Occupied Palestinian Territory.\n\nWhile it is true that the Security Council has endorsed a political process based on a negotiation framework for the resolution of the Israeli-Palestinian conflict, it is also true that the Security Council itself has condemned.\n\n“all measures aimed at altering the demographic composition, character and status of the Palestinian Territory occupied since 1967, including East Jerusalem, including, inter alia, the construction and expansion of settlements, transfer of Israeli settlers, confiscation of land, demolition of homes and displacement of Palestinian civilians, in violation of international humanitarian law and relevant resolutions”.\n\nChile recalls that this Court, in the Namibia Advisory Opinion, was clear in stating that an international instrument, such as a Security Council resolution, “has to be interpreted and applied within the framework of the entire legal system prevailing at the time of the interpretation”. The Court has also noted that resolutions of the United Nations organs need to be analysed “having regard to the terms of the resolution to be interpreted, the discussions leading to it and, in general, all circumstances that might assist in determining the legal consequences of the resolution of the Security Council”.\n\nThus, to argue that Security Council resolutions supporting the need for a negotiated two-State solution impede the exercise of the Court’s advisory jurisdiction is simply untenable. Indeed, it is quite clear from the language used by those resolutions and the discussions leading to their adoption, that any such negotiated solution precisely requires the cessation and non-recognition of Israel’s illegal activities in the Occupied Palestinian Territory. It is difficult to understand how a legal opinion rendered by this Court, the purpose of which is precisely to determine the legal consequences of Israel’s behaviour in the Occupied Palestinian Territory, might be an obstacle for a prospective negotiated solution.\n\nIn addition, one should not lose sight of the fact that ongoing or prospective negotiations do not imply a suspension of the functions and powers of the Security Council or the General Assembly. Indeed, the purpose of the request for an advisory opinion in this case is precisely to assist the General Assembly in the exercise of its functions with regard to the situation in the Occupied Palestinian Territory. It is important to bear in mind that the General Assembly, in exercising its powers, can issue recommendations, the content of which is not restricted to calling the parties to agree on a negotiated solution.\n\nIn conclusion, Chile strongly supports the view that, by giving the requested advisory opinion, the Court will be acting within the scope of its advisory function, fulfilling its duty to provide the legal assistance that the General Assembly requires to exercise its power in the context of a long-standing conflict."
    },
    {
        "voto": 1,
        "juez": "Chile",
        "pregunta": "The construction of the wall being built by Israel, the occupying Power, in the Occupied Palestinian Territory, including in and around East Jerusalem, and its associated régime, are contrary to international law",
        "texto": "In its first written submissions, Chile referred to some of the evidence before the Court which demonstrates that Israel’s policies and practices in the Occupied Palestinian Territory, including East Jerusalem and Gaza, amount to serious and reiterated violations of international law, inter alia, of the right of the Palestinian people to self-determination, of the rules and basic principles of international humanitarian law and of international human rights law, including the prohibition of racial discrimination.Examining these violations is especially relevant in the present context of escalating hostilities. The upsurge of violence in the Occupied Palestinian Territory and in Israel is partly explained by decades of systematic disregard of international law. Less than four months before the Hamas terrorist attacks, former United Nations Secretary-General Ban Ki-moon and former United Nations High Commissioner for Human Rights Mary Robinson noted that Israel’s policies, including its attempts to exercise sovereignty over the Occupied Palestinian Territory “risks an uncontrollable explosion of violence on both sides”. The statement proved premonitory.\n\nNoting that the current escalation of hostilities is partly explained by the status quo does not entail condoning the attacks of Hamas. Chile unequivocally condemns terrorist actions and has called for the immediate and unconditional release of all hostages since day one. However, as noted by the United Nations Secretary-General, the escalation “does not come in a vacuum”, but grows out “of a long-standing conflict, with a 56-year long occupation, and no political end in sight”. This further confirms the importance of determining the legal consequences arising from the ongoing violations of international law.\n\nAs Chile explained in its first written submission, there is vast evidence demonstrating the existence of serious violations of international law by Israel. Although Chile agrees with other States in noting that the Court does not need to make detailed findings on every incident mentioned throughout the submissions and in the more than 1,800 documents contained in the dossier filed by the Secretary-General, I would like to point to certain particularly serious violations which the Court should address in its advisory opinion.\n\nFirst, Israel has violated and continues to violate human rights law, including the denial of the Palestinian people’s self-determination, a norm of jus cogens nature118. The evidence is clear including the establishment and expansion of settlements, the confiscation of Palestinian land and arbitrary demolition of Palestinian houses, and the unwillingness and inability of Israeli authorities and officials to protect the Palestinian population from violence in breach of Israel’s obligations as an occupying Power. The Human Rights Committee the views of which have been given significant weight by the Court in the past regretted that “Palestinians have been systematically deprived of their land and housing rights for decades”, expressed concern for the “systematic practice of demolitions and forced evictions based on discriminatory policies” and noted that such practices “led to the separation of Jewish and Palestinian communities in the Occupied Palestinian Territory, which amounts to racial segregation”.\n\nThese violations have worsened after the October 7 attacks. Israeli human rights nongovernmental organization (NGO) Yesh Din has noted that “2023 was the most violent year in settler violence against Palestinians in the West Bank in both the number of incidents and their severity”, and that the first two months after 7 October 2023 “were particularly violent”. Similar findings were made by Israeli NGO B’Tselem, Human Rights Watch and the UN Office for the Coordination of Humanitarian Affairs. The Office of the United Nations High Commissioner for Human Rights has also noted the rapid deterioration of the human rights situation in the West Bank and East Jerusalem after 7 October, including unnecessary and disproportionate use of force resulting in unlawful killing, mass arbitrary arrests, detentions and ill-treatment, and a further rise in settler violence, already at record-high levels. In parallel, high-ranking Israeli authorities have expressed that they have no intent to guarantee the Palestinian people’s right to self-determination in Gaza, by stating that “[t]he State of Israel will no longer be able to accept the existence of an independent entity in Gaza” and by calling for the re-settlement of the Strip.\n\nIsrael has not only violated the Palestinian people’s right to self-determination but also other rules of international law, including the jus ad bellum, by its de jure and de facto annexation of Palestinian territory. As developed in more detail in Chile’s written submissions, and as eloquently put by former Special Rapporteur Lynk, “the inexorable Israeli occupation has become indistinguishable from annexation”. Chile agrees with the views of most participants in these proceedings, in noting that Israel neither regards itself nor behaves as a temporary occupant of the Occupied Palestinian Territory, and that its practices and policies are inconsistent with a temporary administration of occupied territory.\n\nIsrael’s policies and practices in the Occupied Palestinian Territory also amount to serious violations of Israel’s obligations under international humanitarian law (including the prohibition of transferring civilian population into the occupied territory, which also amounts to a war crime), and under the rules of international human rights law, that forbid racial discrimination. This latter point has been repeatedly noted by authorities including the Secretary-General, the United Nations High Commissioner for Human Rights, Special Rapporteurs, among others. In his 2023 Report to the Human Rights Council, the High Commissioner documented “patterns of systematic discrimination in law, policy and practice, encompassing almost every sphere of life in particular, housing, land and property rights and the right to life, security of person and access to justice”. Already in 2019, the words of Prime Minister Netanyahu were crystal clear on this point: “Israel is not a State of all its citizens Israel is the nation State of the Jewish people and only it”.\n\nBefore moving to question, I want to note one additional feature of the abovementioned violations: Israel has incurred them in blatant disregard of repeated admonitions by the Security Council, the General Assembly, the Human Rights Council and the Court itself.\n\nFurthermore, as noted in February 2023 by the President of the Security Council, it is clear that Israel’s practices actually run contrary to the possibility of reaching a two-State solution and a sustainable peace in the region.These violations, among others, detailed in Chile’s written statements, trigger Israel’s international responsibility. Thus, Israel is under the obligation to cease these violations, make full reparation and offer appropriate assurances and guarantees of non-repetition. These violations also impose on other States various related obligations, including the obligation to co-operate to bring this situation to an end through lawful means. Chile is precisely co-operating to bring this situation to an end by participating in these advisory proceedings, and by its joint submission with Mexico of a referral to the International Criminal Court on the situation in Palestine."
    },
    {
        "voto": 1,
        "juez": "Chile",
        "pregunta": "Israel is under an obligation to terminate its breaches of international law; it is under an obligation to cease forthwith the works of construction of the wall being built in the Occupied Palestinian Territory, including in and around East Jerusalem, to dismantle forthwith the structure therein situated, and to repeal or render ineffective forthwith all legislative and regulatory acts relating thereto, in accordance with paragraph 151 of this Opinion",
        "texto": "In addressing question (b), it is important to distinguish it clearly from question (a). As previously explained, question (a) is concerned with the legal consequences arising from the violation by Israel of various international law obligations in the Occupied Palestinian Territory.\n\nThe second question is of a different nature. Question (b), focuses on the legal status of the occupation, that is to say, on the illegality of the occupation itself. In this regard, if the Court finds that the occupation is unlawful, it necessarily follows that the occupation must come to an end.\n\nThe conclusion that Israel’s occupation of Palestinian territory is illegal, lies on two grounds. First, there is ample evidence, as we have heard from States’ oral presentations during these two days, that the occupation has become an annexation. Second, the cumulative effect of the abovementioned systematic violations also requires the end of the occupation as the measure needed to effectively protect the rights of the Palestinians.\n\nWith regard to the legality of an occupation, the test put forward by former Special Rapporteur Lynk is particularly useful140. According to this test, the occupier cannot annex any of the occupied territory, the occupation must be temporary, and the occupant must seek to end the occupation and return the territory as soon as reasonably possible.\n\nThe de jure and de facto annexation of the Occupied Palestinian Territory by Israel contradicts the basic principle of no acquisition of territory by force. In this regard, General Assembly resolution 2625 (XXV) establishes that “[t]he territory of a State shall not be the object of acquisition by another State resulting from the threat or use of force”; and that “[n]o territorial acquisition resulting from the threat or use of force shall be recognized as legal”.\n\nThe principle of no acquisition of territory by force has been applied by this Court in relation to States, with regard to mandated territories, and in relation to peoples and their right to sovereignty and integrity of their national territory.\n\nThis Court has recognized that the territorial integrity is a key element for the exercise of the right of self-determination through which peoples freely determine their political status and pursue their economic, social and cultural development. In fact, the Court in the Chagos Advisory Opinion has considered there is an intrinsic link between territorial integrity and self-determination, such that “any detachment, [or annexation like in this case,] by the administering Power of part of a non-self-governing territory, unless based on the freely expressed and genuine will of the people of the territory concerned, is contrary to the right to self-determination”.\n\nOccupation is often the result of armed conflict and, in so far as one of the main purposes of humanitarian law is to protect the civilian population that lives in areas affected by war, humanitarian law imposes various obligations upon the occupying Power, precisely to prevent the violation of their basic rights and the conquest of their territory.\n\nIn this context, Article 47 of the Fourth Geneva Convention contains an absolute prohibition of the annexation of occupied territories. In this case, the intention to annex the territory of the Palestinian people is demonstrated by the fact that the Israeli occupation has already expanded for a period of 56 years with no intention to put an end to it and with no satisfactory explanation as to the relation between occupation and the protection of its citizens. The policy and practice of settlements pursued by Israel since 1967 indicate its intention to claim that its own population has a right to stay permanently on these territories. Similarly, its exploitation of Palestinian natural resources also demonstrates Israel’s attempt to exercise sovereign powers over the Occupied Palestinian Territory. As an occupying Power, Israel is obligated to act as a temporary administrator on behalf of the protected population and as such it cannot destroy or appropriate these resources. However, the fact that it has completely sequestered them145 clearly shows that Israel does not conduct itself as a provisional occupying Power.\n\nIndeed, by virtue of its actions, including the exploitation of natural resources, the policies of settlements, the erection of the Wall, the legalization of outposts, among others, Israel has demonstrated its intention to control indefinitely the Occupied Palestinian Territory, hence, Israel’s occupation has become an annexation.\n\nMr President, Members of the Court, turning now to the cumulative effects of the violation of self-determination, humanitarian law, human rights law and international criminal law in the Occupied Palestinian Territory, Chile contends that these systematic breaches are also a basis to declare that the occupation is illegal. Again, Special Rapporteur Lynk’s test is useful in this regard. According to this test146, the legality of an occupation requires the occupier to act in the best interests of the people under occupation and to administer the occupied territory in good faith, including acting in full compliance with the duties and obligations under international law.\n\nIt is important to clarify that not any violation of international law by an occupying Power leads to the conclusion that the occupation must come to an end. As was previously stated, occupation might be the result of an armed conflict and, in that context, it is the responsibility of the occupying Power to prevent and punish any act in breach of international law undertaken by its armed forces and persons under its control. In so far as the occupying State fulfils its duty to prevent and punish the individual perpetrators, the violations will not by themselves raise the question of the illegality of the occupation.\n\nBut in this case, the systematic violation of international law is part of a State policy, and then we think that the occupation has become illegal.\n\nTherefore, during this illegal occupation, the obligations of the occupying Power obviously persist, despite the fact that this occupation must come to an end."
    }
]
