[
    {
        "voto": 1,
        "juez": "Egypt",
        "pregunta": "Finds that it has jurisdiction to give the advisory opinion requested",
        "texto": "First, on the matter of jurisdiction and competence, the small number of States objecting to the Court’s exercise of jurisdiction have variously argued that the request is politically motivated, instrumentalizes the Court, circumvents the consent of Israel, covers too vast a scope or will prejudice the peace process and negotiations between the parties.\n\nLet me recall that the Court has repeatedly and consistently rejected such arguments. In the Kosovo Advisory Opinion, the Court did not concern itself with the motives which may have inspired the request or the political implications of its Opinion. Since the General Assembly is duly authorized under Article 96 of the United Nations Charter, and brought forth its request through a validly adopted resolution, the request, in the Court’s own words, “in principle, should not be refused”. In the Nuclear Weapons and Chagos Advisory Opinions, the Court refused to secondguess the decision of the General Assembly, stating that it “has the right to decide for itself on the usefulness of an opinion in the light of its own needs”.\n\nDistinguished Members of the Court, the General Assembly has turned to this august Court with what is manifestly a legal question, seeking a legal answer that would indisputably assist in discharging its functions. Allow me to recall that this very Court in the Wall Opinion affirmed the United Nations’ “permanent responsibility towards the question of Palestine” until such time as it may be “resolved in all its aspects in a satisfactory manner in accordance with international legitimacy”.\n\nIn the Wall Opinion, the Court found no merit in the proposition — echoed by some in these proceedings that the ongoing negotiations constituted a compelling reason to decline its competence. It reached a similar conclusion in the Nuclear Weapons Advisory Opinion, after noting that its opinion would “have relevance for the continuing debate on the matter in the General Assembly and would present an additional element on the matter”.\n\nIndeed, rather than prejudicing the peace process, the present advisory opinion serves not just as an “additional” element but rather an “essential” one for the General Assembly to continue to carry out its role in relation to the Palestinian-Israeli conflict. This is absolutely critical given the complete absence of any real prospect for a peaceful solution.\n\nThe Court could not possibly turn its back on this wealth of jurisprudence or disregard the many compelling reasons for it to honour the General Assembly’s request, as summarized so aptly by the representative of Palestine. The Middle East region yearns for peace and stability and a just, comprehensive and lasting resolution to the Palestinian-Israeli conflict, based on the principles of international law, and the establishment of a viable Palestinian State on the pre-1967 lines, with East Jerusalem as its capital. The legal determination by the Court in the present advisory opinion is indispensable to guide the General Assembly and the international community to achieve this objective."
    },
    {
        "voto": 1,
        "juez": "Egypt",
        "pregunta": "The construction of the wall being built by Israel, the occupying Power, in the Occupied Palestinian Territory, including in and around East Jerusalem, and its associated régime, are contrary to international law",
        "texto": "Second, Mr President, I turn to the question of the ongoing violation by Israel of the right of the Palestinian people to self-determination, from its prolonged occupation, settlement and annexation of the Palestinian territory occupied since 1967. 14. Distinguished Members of the Court, Palestine has been subjected to the longest protracted state of occupation in modern history, as well as de facto and de jure annexation that confirm the unlawful nature of the occupation28. 15. Israel’s persistent policy of implanting settlements in the West Bank and occupied Jerusalem for the purpose of creating facts on the ground and breaking up the territorial contiguity of the occupied territories, is a blatant disregard for international law. Twenty years ago, the representatives of the State of Palestine laid before this Court the facts of Israel’s intensive settlement and colonization policy, which had, at the time, transferred 400,000 illegal settlers to the occupied Palestinian territories. Today, that number stands at 750,000, deliberately and permanently altering the status of the occupied territories. 16. In addition to the policy of de facto annexation, Israel purported to annex East Jerusalem de jure through the Basic Law adopted by the Israeli Knesset in 1980, stipulating “Jerusalem, complete and united, is the capital of Israel”. 17. The very limited number of States defending these policies advance two principal claims, namely that “the legal status of occupation” does not change if the occupation is prolonged or involves illegal violations of jus in bello29 and that under jus ad bellum, Israeli occupation is lawful since, inter alia, relevant United Nations Security Council resolutions did not declare otherwise.\n\nEgypt submits that the proposition that occupation is, merely, a de facto situation whose legality cannot be called into question is seriously flawed. As highlighted by a number of participants, the legality of an occupation must be assessed by reference to the United Nations Charter and general international law.\n\nIn fact, Israel’s prolonged occupation violates a number of distinct legal régimes that exist and operate simultaneously and concurrently. These include: the law of occupation, part of the jus in bello, that is characterized by this Court as “intransgressible”; the jus ad bellum and the peremptory prohibition of the acquisition of territory through force; the principle of self-determination, also a peremptory norm of international law, described by this Court as erga omnes and “irreproachable” in the East Timor case; and the fundamental prohibition of racial discrimination, segregation and subjugation.\n\nIt is against this legal framework that the legality of Israel’s policies and practices in the occupied Palestinian territories must be assessed.\n\nFirst, with respect to the jus in bello, it is a fundamental principle of international law that an occupying Power is prohibited from changing the status of the occupied territory, as well as its annexation, in whole or in part. It is only entitled to exercise limited powers, intended to be temporary in nature, with the aim of balancing between its own military needs and the protection of the local inhabitants. These are not rights bestowed on the occupying Power, but rather limitations on its authority.\n\nIt flows from this that belligerent occupation is governed by two key principles. First, it is a temporary régime and, second, it cannot transfer sovereignty to the occupying Power. Rather, it freezes the legal order of the occupied territory throughout the duration of the occupation. The occupying authority is merely a de facto administrator, a principle intended to protect both the inhabitants of the occupied territory, as well as “the separate existence of the State, its institutions and its laws”. This is reflected in Article 47 of the Fourth Geneva Convention and is precisely what “distinguishes occupation from annexation”.\n\nThe prohibition of permanently changing the occupied territory extends also to its demographic component. Article 49 of the Fourth Convention prohibits “individual or mass forcible transfer” of civilians outside the occupied territory; and the transfer by the occupying Power of “parts of its own civilian population into the territory it occupies”. According to the 1958 Commentary, this was intended “to prevent a practice adopted during the Second World War by certain Powers, which transferred portions of their own population to occupied territory for political and racial reasons or in order, as they claimed, to colonize those territories”.\n\nAs demonstrated in Palestine’s statement, there is overwhelming evidence that Israeli support for and maintenance of settlements is intended to permanently alter the demographic composition of the Occupied Palestinian Territory and extend Israeli sovereignty over it. This is coupled with Israel’s mass forcible transfer and forced displacement of the Palestinians in Gaza, through its illegal evacuation orders and indiscriminate use of force, which has been labelled by the United Nations Special Rapporteur on the situation of human rights in the Occupied Palestinian Territory as “ethnic cleansing”.\n\nIt should be highlighted that Article 49 not only prohibits forced transfers, but also, in the Court’s own words, “any measures taken by an occupying Power in order to organize or encourage transfers of parts of its own population into the occupied territory”.\n\nNumerous resolutions of the General Assembly and Security Council affirmed the illegality of Israel’s settlements, annexation and measures altering the demographic composition, character and status of the Holy City of Jerusalem considering them invalid and a flagrant violation of the Fourth Convention, while requiring Israel to desist from such practices38.\n\nSecurity Council resolution 298 stated that “all legislative and administrative actions taken by Israel to change the status of the City of Jerusalem, including expropriation of land and properties, transfer of populations and legislation aimed at the incorporation of the occupied section, are totally invalid and cannot change that status”.\n\nThe Security Council also declared in relation to Jerusalem in resolution 478 (1980) that Israeli “legislative and administrative measures are null and void and must be rescinded forthwith”. Israel remains in defiance of these and subsequent resolutions, including resolution 2334 (2016) and numerous General Assembly resolutions in addition to the provisions of the Geneva Conventions previously described.\n\nIsrael’s prolonged military rule and its strategic settlement policy, considered a “national value” under Israeli legislation, is essentially a systemic “de-Palestinianization” of the occupied territory, including Jerusalem, intended to permanently change its demographic characteristics, and enhance its Jewish component, thereby achieving the de jure and de facto annexation of that territory. This leads to the conclusion that Israeli occupation is, in fact, an illegal annexation, conquest and de facto colonial endeavour.\n\nMr President, the second legal principle by which the legality of Israel’s occupation is to be assessed, is Article 2 (4) of the Charter of the United Nations, which prohibits the acquisition of territory through force; one of the most fundamental principles of the post-UN Charter era.\n\nThe vast majority of States participating in these proceedings submit that Israeli occupation by virtue of its permanence, de jure and de facto annexation manifestly violates the principle of inadmissibility of acquiring territory through force. Only one State has attempted to justify Israel’s actions, by contesting the Palestinians’ title to the occupied territories and justifying Israel’s territorial expansion as the product of a defensive war43.\n\nEgypt submits that these claims have no basis in fact or in law and seek to derail the Court by raising issues outside the temporal scope of this request. They are reminiscent of the archaic international law of the nineteenth century that justified territorial conquest through denying the sovereign status of colonized peoples, relegating them to the realm of terra nullius.\n\nThere is, also, no support for the proposition that Israel was acting defensively in 1967. International law recognizes neither pre-emptive nor preventive self-defence and the terms of the United Nations Charter on this matter are clear, requiring an armed attack to occur in order to trigger the right of self-defence. Israel’s attack in 1967 was, therefore, not a defensive but an aggressive war.\n\nEven if the claim of self-defence were valid — which clearly is not the case — a decades-long occupation is not reconcilable with the customary international law conditions of necessity, immediacy and proportionality44. In any event, the issue is a moot one, as it is universally recognized that a State may not gain title to territory through any use of force, regardless of its purported legitimacy.\n\nThese claims also find no basis in Security Council resolution 242, which unequivocally recognized the inadmissibility of acquiring territory through force, demanding Israel’s withdrawal from territories occupied in the recent conflict and emphasizing the duty of all States to act in accordance with Article 2 of the Charter. Resolution 242 was reaffirmed by resolution 338, while the inadmissibility of territorial acquisition through force was confirmed in at least nine subsequent Security Council resolutions. In fact, resolution 471 clearly stated, as far back as 1980, the overriding necessity to end the prolonged occupation of the Arab territories occupied by Israel since 1967 including Jerusalem.\n\nIn Egypt’s view, it is clear that under international law, the territorial status of the West Bank, including Jerusalem, and the Gaza Strip cannot lawfully be altered through armed conflict.\n\nIsrael’s protracted occupation, which is coupled with measures to permanently change the demographic characteristics of the occupied territory, and annex parts of the land de facto and de jure in violation of the cardinal principle of the prohibition of the acquisition of territory through force, is therefore, illegal per se and an ongoing violation of international law."
    },
    {
        "voto": 1,
        "juez": "Egypt",
        "pregunta": "Israel is under an obligation to make reparation for all damage caused by the construction of the wall in the Occupied Palestinian Territory, including in and around East Jerusalem",
        "texto": "Distinguished Members of the Court, the third legal principle against which Israel’s conduct must be assessed is self-determination. Egypt submits that Israel’s indefinite occupation amounts to a nullification and denial of the Palestinian people’s inalienable right to self-determination.\n\nIt is indisputable, that this right — enshrined in Article 1 of the United Nations Charter and both human rights Covenants is a cardinal principle in modern international law. Its erga omnes character, confirmed by the Court in the East Timor case, entails that all States and international organizations have a legal interest and a duty in respecting and protecting this right.\n\nThis Court already affirmed in the Wall Advisory Opinion the applicability of this right to the “Palestinian people”.\n\nMr President, Israel’s indefinite occupation of the Palestinian territories is as a whole inconsistent with the principle of self-determination and breaches three salient aspects of this principle. First, it obstructs the Palestinian people from freely determining their political status, achieving independent statehood, sovereignty and the right of return.\n\nSecond, it deprives Palestinians of their right to pursue their economic, social and cultural development. In gross breach of international law, Israel restricts Palestinians’ access to Jerusalem’s Christian and Muslim holy sites, notably Al-Aqsa Mosque, wantonly depletes Palestinian natural resources, imposes access restrictions to “Area C” and obstructs the movement of goods and people between the West Bank and Gaza, stunting Palestine’s economy and impeding the geographical unity of the State of Palestine.\n\nThird, the fragmentation and dismemberment of the occupied territories, through Israel’s settlements policy, the wall and measures of de facto and de jure annexation, are a blatant violation of the fundamental principle of the integrity of the self-determination unit. The territorial unit of Palestine includes both the West Bank, including the Holy City of Jerusalem, and the Gaza Strip. Although Israel withdrew its forces from Gaza in 2005, it still retains effective control by, inter alia: exercising complete control over Gaza’s airspace and territorial waters; the flow of people and goods in and out of Gaza; the Palestinian population registry; and the tax policy and transfer of tax revenues. Israel’s continuing military incursions into Gaza, including the ongoing brutal assault, indicate Israel’s continuing authority over the territory. Together, the West Bank and Gaza constitute a single territorial unit. This has been confirmed by numerous Security Council resolutions which refer to Gaza as an integral part of the territory occupied in 1967 and of the Palestinian State under the two-State solution.\n\nEgypt firmly denounces the ongoing obstruction of the Palestinian people’s inalienable, permanent and unqualified right to self-determination, a violation — as argued by Palestine — that is an “essential feature” of Israel’s prolonged occupation.\n\nOne only needs to look at Israel’s vicious, wholesale destruction of Gaza today, after years of imposing the medieval methods of siege and blockade, to realize the extent of Israel’s transgression of this principle. Israel’s prolonged occupation is therefore illegal, per se, and is an ongoing, internationally wrongful act that must be immediately brought to an end by Israel, by immediately ending the occupation.\n\nThe fourth legal principle against which Israel’s conduct must be assessed is the fundamental prohibition of racial discrimination, segregation and subjugation.\n\nOn a daily basis, under occupation, Palestinians face institutionalized discrimination and segregation under a dual legal system, applying different laws to Palestinians and Israelis. Israeli military orders in the occupied territories entrench racial discrimination between Palestinians and Israeli settlers. Israel also implements de facto and de jure measures of racial discrimination, including in the areas of detention, criminal justice, housing, land confiscations and house demolitions. How can such practices — which have been described by a number of participants as “crimes against humanity” — how can they be consistent with any notion of human rights and human dignity in the 21st century?\n\nIsrael is under an obligation to repeal all such legislation that maintains its systematic, oppressive and institutionalized policy of racial discrimination and segregation against the Palestinian people, and to cease all discriminatory policies and practices.\n\nI now turn to whether self-defence or military necessity may justify Israel’s prolonged occupation.\n\nThe argument that a State may exercise self-defence against a territory under its own military occupation and effective control is counter-intuitive, particularly since the occupying State has the authority and even the obligation to “ensure public order and safety” in the occupied territory.\n\nIn the Wall Advisory Opinion, this Court found that Article 51 of the Charter, which recognizes the inherent right of self-defence, had no relevance, as the acts invoked by Israel were acts arising out of the occupied Palestinian territory, which is under Israeli effective control and not imputable to another State. Egypt finds no reason for the Court to depart from this considered Opinion in the current proceedings.\n\nThe Court also rejected the justification of military necessity. The modern conception of military necessity is strictly limited to the contexts in which it is expressly recognized. It is thus already considered in the formulation of the obligations set out in humanitarian conventions, some of which “expressly exclude reliance on military necessity”.\n\nFor example, no military necessity qualification is permitted under Article 49 of the Fourth Geneva Convention, which prohibits the transfer of any part of the occupying Power’s civilian population into an occupied territory. This cannot be justified as a safety measure taken by Israel in the exercise of its prerogatives as an occupying Power.\n\nAccording to the legal maxim ex injuria jus non oritur, one should not be able to profit from one’s own wrongdoing. Israel thus cannot invoke self-defence to maintain a situation created by its own illegal conduct, or to justify violations of peremptory norms of international law.\n\nDistinguished Members of the Court, for how much longer do the Palestinian people need to wait before they are able to exercise their legitimate rights under international law? For how much longer will the United Nations continue to manage the humanitarian impacts of Israeli violations, without addressing their root cause? History will judge us for how we respond today.\n\nEgypt respectfully submits that the Court should advise the General Assembly that: the prolonged Israeli occupation is, per se, a continuing violation of international law for its breach of: the jus in bello; the prohibition of the acquisition of territory through force; the right to self-determination of the Palestinian people; and the prohibition of racial discrimination, segregation and subjugation.\n\nIsrael — as the wrongdoing State is obliged to make full reparation through restitution, compensation and satisfaction, either singly or in combination, by ceasing immediately and unconditionally its unlawful occupation of Palestinian territory, and rescinding the associated unlawful policies and practices of annexation, settlements and discriminatory legislation.\n\nAll States have a duty not to recognize the illegal situation created by Israel’s ongoing violation, resulting from its prolonged occupation, settlement and annexation of the occupied territory, and not to render aid or assistance in maintaining that situation.\n\nMr President, the consequences of Israel’s prolonged occupation are clear, and there can be no peace, no security, no stability, no prosperity in the Middle East, without upholding justice and the rule of law for the Palestinian people. I thank you."
    }
]

