[
    {
        "voto": 1,
        "juez": "Guyana",
        "pregunta": "Finds that it has jurisdiction to give the advisory opinion requested",
        "texto": "THE COURT SHOULD NOT BE DETERRED FROM PROVIDING AN ADVISORY OPINION WHICH ANSWERS IN FULL THE QUESTIONS POSED BY THE GENERAL ASSEMBLY\n\nMr President, that belief is one that is shared by the overwhelming majority of States and international organizations which have chosen to participate in these advisory proceedings. However, a small number of States — just five in total — contend that the Court should decline to provide an advisory opinion because, they say, an opinion would prejudice negotiations between the State of Palestine and Israel. A further handful of States — which include the United States, from whom you heard earlier today — do not go quite so far, but they instead urge the Court to exercise caution to avoid undermining the existing negotiating 'framework'.\n\nBoth the advocates of abstention and the advocates of timidity are wrong. There are several reasons why the possible effect of an advisory opinion on negotiations between Israel and the State of Palestine does not constitute a good — still less a 'compelling' — basis for either declining to issue an opinion or for restricting its scope. I highlight two in particular.\n\nFirst, the arguments all rest on a fundamentally flawed factual premise. They assume the existence of ongoing negotiations between Israel and the State of Palestine which could be prejudiced by an advisory opinion. But such negotiations do not exist. There have been no negotiations between the two States for a decade. There are no live negotiations.\n\nAnd this is not a contentious proposition. Indeed, one of the most prominent and vocal advocates of judicial caution, the United States, expressly concedes in its Written Statement that negotiations between the two States 'are not currently occurring'. This is the unfortunate but very real actuality.\n\nNor, if the words of Israel’s leaders are anything to go by, is there any realistic prospect of Israel’s willing participation in such negotiations in the near future. Recent public statements by Israel’s Prime Minister make this abundantly clear. In November of last year, for example, Prime Minister Netanyahu proclaimed that Israel would prevent a Palestinian State in Gaza and the West Bank. That was a position he reiterated emphatically in January of this year.\n\nThe second — and more fundamental — reason why the Court should not be deterred from issuing an advisory opinion which answers in full the questions posed by the General Assembly, is that the General Assembly, the Security Council and this very Court have all made clear that the Israel-Palestine conflict must be — and can only be — resolved in accordance with international law.\n\nIn November 2022, for example, the General Assembly adopted resolution 77/25 which '[s]tress[ed] that compliance with and respect for the Charter of the United Nations and international law... is a cornerstone of peace and security in the region'. The General Assembly called upon Israel 'to comply strictly with its obligations under international law and to cease all of its measures that are contrary to international law' including measures which seek to 'prejudg[e] the final outcome of peace negotiations'. The resolution went on to refer to 'the illegality of the annexation of any part of the Occupied Palestinian Territory... which constitutes a breach of international law... and challenges the prospects for the achievement of a just, lasting and comprehensive peace'.\n\nIn other words, a just, lasting and comprehensive peace necessarily requires compliance with international law.\n\nIn a similar vein, in February of last year, the President of the Security Council issued a statement which emphasized that '[t]he Security Council reaffirms its unwavering commitment to the vision of the two-State solution where two democratic States, Israel and Palestine, live side by side in peace within secure and recognized borders, consistent with international law and relevant UN resolutions. The Security Council strongly underscores the need for all parties to meet their international obligations'.\n\nIn the Wall Opinion, the Court likewise stressed the importance of 'achieving as soon as possible, on the basis of international law, a negotiated solution' in order to achieve 'peace and security for all in the region'. In his concurring opinion in that case, Judge Al-Khasawneh stressed that 'it is of the utmost importance if... negotiations are not to produce non-principled solutions, that they be grounded in law'.\n\nThe principal judicial organs of the United Nations have spoken emphatically and with one consistent voice. They could not be clearer that any negotiations between Israel and the State of Palestine must be grounded in international law and must be aimed at ensuring a resolution of the conflict which is in accordance with international law. It is obvious and it is self-evident that an advisory opinion containing the Court’s answers to the questions of international law posed by the General Assembly will help, not hinder, the attainment of that end.\n\nIndeed, the very resolution which requested these advisory proceedings confirms that this is exactly what the General Assembly considers that an advisory opinion will help to achieve. Resolution 77/247 stressed the need to 'advanc[e] and accelerat[e] meaningful negotiations aimed at the achievement of a peace agreement that will bring a complete end to the Israeli occupation... and the resolution of all core final status issues... leading to a peaceful, just, lasting and comprehensive solution of the question of Palestine'.\n\nIn adopting this resolution, the General Assembly plainly considered that an advisory opinion from the International Court of Justice would facilitate, rather than frustrate, 'negotiations' leading to 'a peaceful, just, lasting and comprehensive solution'.\n\nIt follows that the Court can and should answer the questions posed by the General Assembly confident in the knowledge that its answers will help to achieve a peaceful resolution of the conflict in accordance with international law."
    },
    {
        "voto": 1,
        "juez": "Guyana",
        "pregunta": "Decides to comply with the request for an advisory opinion",
        "texto": "Mr President, this Court needs no reminding of the importance of international law or of the grave consequences which ensue when it is systematically disregarded. The Court also needs no reminding of the profound contributions that its past advisory opinions have made to the plight of peoples and States afflicted by the scourge of colonization.\n\nFor many, many years, Israel has chosen to place its own expansionist interests above the duty to respect international law, including jus cogens norms and the United Nations Charter. The result of that deliberate defiance of international law has been decades of dispossession, oppression and injustice for the State of Palestine and the Palestinian people, who have been systematically deprived of their fundamental right of self-determination.\n\nThese advisory proceedings are a vital opportunity for the World Court to address, and to begin to redress, the immense harm wrought by Israel’s unlawful occupation. With international law as its bedrock, and justice as its guide, an advisory opinion from the Court will provide a lodestar for the United Nations, and all of its Member States, to chart a course which reverses that dispossession, which relieves that oppression and which remedies that injustice.\n\nIn Guyana’s submission, it is only through the rule of international law that a permanent and peaceful resolution of this decades-long conflict may be achieved. An authoritative exposition of international law — including a determination by the Court that the occupation is illegal as a whole and must be brought to an immediate end — will serve the ends of justice, will vindicate the rule of international law, and will provide the basis for a just, comprehensive and lasting peace."
    },
    {
        "voto": 1,
        "juez": "Guyana",
        "pregunta": "The construction of the wall being built by Israel, the occupying Power, in the Occupied Palestinian Territory, including in and around East Jerusalem, and its associated régime, are contrary to international law",
        "texto": "Mr President, I turn now to an important issue of substance, namely whether as a matter of international law an occupation can be unlawful. The United States, as you heard earlier, contends that an occupation cannot be unlawful or lawful. It argues that occupation is governed exclusively by international humanitarian law, which is concerned only with the acts of the occupying Power and has nothing to say about the legality of the occupation itself. For the United States, when it comes to occupation international humanitarian law is both the start and the end; it is the only game in town.\n\nGuyana, like dozens of other States and international organizations, disagrees. Put simply, there is a distinction between the law of occupation, on the one hand, and the legality of an occupation, on the other. The conduct of an occupation is governed by international humanitarian law, while the legality of an occupation as a whole is determined by the United Nations Charter and general international law.\n\nThe argument advanced by the United States — that occupation is governed solely by international humanitarian law — leaves no room for the application of the Charter or general international law. In particular, it leaves no room for the principle enshrined in Article 2 (4) of the Charter that acquisition of territory by force is absolutely prohibited. An argument which leaves no room for the application of that fundamental principle of international law — a peremptory norm — is not a sound one.\n\nHow then does one determine whether Israel’s occupation of Palestinian territory is unlawful? The answer, Guyana submits, is straightforward. It is to be found in the principle that occupation is inherently and exclusively a temporary state of affairs, and in the jus cogens prohibition on acquisition of territory by force.\n\nThe inherently temporary character of occupation is reflected in the principle that an occupying Power does not acquire sovereignty — “not one atom”, as Oppenheim memorably put it — over the occupied territory. It is also reflected in the duty of the occupying Power to preserve the status quo ante and to refrain from making any permanent changes to the occupied territory. Temporariness, in short, is the very core and essence of occupation. It is notable that none of the 57 States and international organizations which filed written statements in these proceedings contend otherwise.\n\nIt follows that permanent “occupation” is not occupation at all; it is military conquest. It is annexation. And annexation is, of course, strictly forbidden under international law. It therefore necessarily follows that an “occupation” which is intended to be permanent is unlawful under international law."
    },
    {
        "voto": 1,
        "juez": "Guyana",
        "pregunta": "Israel is under an obligation to terminate its breaches of international law; it is under an obligation to cease forthwith the works of construction of the wall being built in the Occupied Palestinian Territory, including in and around East Jerusalem, to dismantle forthwith the structure therein situated, and to repeal or render ineffective forthwith all legislative and regulatory acts relating thereto, in accordance with paragraph 151 of this Opinion",
        "texto": "Applying these principles, Guyana submits that it is indisputable that Israel’s occupation of Palestinian territory is unlawful as a whole. The unlawfulness arises from the fact that Israel has annexed most of the occupied territory de jure and de facto, including by implanting almost three quarters of a million Israeli settlers in hundreds of settlements, which Israel’s leaders have promised never to remove.\n\nIn Jerusalem, Israel has formally declared sovereignty over the occupied territory and has expressly extended the application of its domestic laws to that territory. This is a classic, quintessential example of de jure annexation — and it is irrefutable evidence that Israel intends its occupation to be permanent.\n\nOver many years Israel’s leaders have repeatedly proclaimed East Jerusalem to be an inseparable part of Israel. In the words of Israel’s current Prime Minister, East Jerusalem “has been — and always will be ours” and “will remain only under Israel’s sovereignty”. This unequivocal declaration — and many others like it — have been accompanied by far-reaching actions. These include the systematic implantation of more than 230,000 Israeli settlers in East Jerusalem — an exercise in deliberate demographic manipulation that has profoundly changed the composition, the character and the status of the Holy City.\n\nIn the rest of the West Bank, Israel has conducted a similar, decades-long process of implanting half a million Israeli settlers in more than 270 illegal settlements. Those settlements, and the network of settler-only roads and infrastructure which connect them, form a vast interconnected constellation of illegal colonies, to which Israel has extended the application of its domestic laws. The intent — and the effect — is to establish permanent Israeli dominion throughout the West Bank. Indeed, the highest officials in successive Israeli governments have openly and brazenly declared an intention to exercise sovereignty over the entire West Bank, which they have renamed Judea and Samaria, and which they define as an integral and inseparable part of the land of Israel.\n\nIsrael has created, expanded and entrenched its sprawling network of settlements in the face of repeated condemnation of the illegality of those actions by the General Assembly, the Security Council, the Secretary-General, a plethora of United Nations committees and rapporteurs, as well as the international community and, of course, this very Court.\n\nIsrael’s annexation of the occupied territory and its intention for the occupation to be permanent has been widely recognized and condemned by the United Nations. I offer five examples, but I stress that these are merely illustrative, and they are very far from exhaustive.\n\nFirst, literally dozens of General Assembly resolutions from the early 1970s onwards have expressly referred to and condemned Israel’s “annexation” of the occupied territory. Examples of those resolutions, which span a period of more than half a century, are listed in Guyana’s Written Statement. This vast corpus of resolutions demonstrates a clear, consistent and emphatic recognition by the General Assembly that Israel has unlawfully annexed much of the occupied territory with the intention of retaining it forever.\n\nSecond, multiple resolutions of the Security Council between 1968 and 2016 expressly recalled the prohibition on acquisition of territory by force and condemned Israel’s annexation and settlement of Palestinian territory on that basis. Examples of those resolutions are also listed in Guyana’s Written Statement. Those resolutions represent a clear recognition by the Security Council that Israel has annexed most of the occupied territory in contravention of fundamental principles of international law, and that it intends to exert perpetual control over that territory.\n\nThird, successive Secretaries-General of the United Nations have also repeatedly described and condemned Israel’s “annexation” of Palestinian territory in official published reports. In 2010, for instance, the Secretary General referred to “Israel’s annexation of East Jerusalem” which is “a flagrant violation of international law”. In 2015, the Secretary-General reported to the General Assembly that: “In the West Bank... the establishment and maintenance of the settlements amount to a slow, but steady annexation of the occupied Palestinian territory.” Similar statements are once again cited in Guyana’s Written Statement.\n\nFourth, the United Nations Independent International Commission of Inquiry has also concluded that Israel has illegally annexed much of the West Bank and intends the occupation to be permanent. In its September 2022 report, the Independent Commission concluded that: “Israel treats the occupation as a permanent fixture and has — for all intents and purposes, annexed parts of the West Bank.” The report went on to describe Israel’s “settlement enterprise” as “the principal means” used by Israel “to create irreversible facts on the ground” to support “its permanent occupation”. The Commission added that “[s]tatements made by Israeli officials provide further evidence that Israel intends the occupation to be permanent”.\n\nFifth, successive United Nations Special Rapporteurs have similarly concluded that Israel has annexed the occupied territory. In 2021, for instance, the Special Rapporteur reported that Israel’s occupation “has become indistinguishable from annexation”. He highlighted “the de jure annexation plans made by Israel” and he cited the “plentiful... evidence” that “Israeli policies and practices” are designed to pursue “a strategy of de facto annexation and permanent control over the Palestinian territory”.\n\nIn a report published the following year, the Special Rapporteur observed that the implantation of hundreds of thousands of settlers in the occupied territory was intended to “demographically engineer an unlawful sovereignty claim through the annexation of the occupied territory”. He concluded that Israel’s occupation had “burst through the restraints of temporariness long ago” and that “Israel has progressively engaged in the de jure and de facto annexation of occupied territory”.\n\nMr President, Israel’s annexation of Palestinian territory, and its clear intention for the occupation to be permanent, render the occupation unlawful as a whole. This has already been recognized by the United Nations. In 2022, the Independent Commission of Inquiry concluded that: “there are reasonable grounds to believe that the Israeli occupation of Palestinian territory is now unlawful under international law owing to its permanence and to actions undertaken by Israel to annex parts of the land de facto and de jure”.\n\nIn January this year, the Secretary-General, citing international law and the resolutions of the Security Council and General Assembly, concluded bluntly that: “Israel’s occupation must end.” When the United States read aloud from the Secretary-General’s statement earlier today, it regrettably excised these crucial words. However, the State of Palestine read them to you on Monday. As the State of Palestine pointed out, the Secretary-General stated one month ago that: “Palestinians must see their legitimate aspirations for a fully independent, viable and sovereign State realized, in line with United Nations resolutions, international law and previous agreements. Israel’s occupation must end.”\n\nGuyana emphatically agrees, both with the Independent Commission of Inquiry and the Secretary-General. The occupation is unlawful. The occupation must therefore end — immediately, comprehensively, irreversibly."
    }
]


