[
    {
        "voto": 1,
        "juez": "Indonesia",
        "pregunta": "Finds that it has jurisdiction to give the advisory opinion requested",
        "texto": "On jurisdiction: Indonesia maintains that the Court has jurisdiction to render the advisory opinion and there is no ground for declining to exercise such jurisdiction. /n/nSecond, the request for the advisory opinion is not intended to decide on a final solution to the conflict. /n/nA comprehensive, just and lasting solution should only be achieved through direct negotiations between the parties to the conflict, not one imposed from outside or by one party. /n/nRather, the request is intended to seek the Court’s opinion on legal questions asked by the United Nations General Assembly within its competence. /n/nThe Court should only render its opinion on the legal consequences arising from the ongoing violations by Israel and how they should affect the legal status of the occupation. /n/nThe questions should be understood as a request for advice to facilitate the General Assembly in devising necessary actions within its functions. /n/nThus, Indonesia submits that there are no grounds to dismiss this request on the basis that it would risk fundamentally delegitimizing any future prospect of peace process."
    },
    {
        "voto": 1,
        "juez": "Indonesia",
        "pregunta": "Decides to comply with the request for an advisory opinion",
        "texto": "Third, the Court’s opinion will positively contribute to the peace process by presenting additional elements of the law for a comprehensive resolution of the dispute. /n/nA genuine and lasting peace process can only be achieved if it is consistent with international law. Thus, the Court’s opinion is very much needed. /n/nBy clarifying the relevant legal rules, the Court’s opinion will help in resolving the stalemate that had impeded the peace process. /n/nIn addition to this positive impact, the Court’s opinion would be useful to guide the future steps to be taken by the United Nations and all States. /n/nThe Court must pronounce that Israeli occupation is illegal as a whole."
    },
    {
        "voto": 1,
        "juez": "Indonesia",
        "pregunta":"The construction of the wall being built by Israel, the occupying Power, in the Occupied Palestinian Territory, including in and around East Jerusalem, and its associated régime, are contrary to international law",
        "texto": "We have all witnessed the ongoing humanitarian catastrophe in Gaza and the following escalation throughout the region, which have emboldened a global call to address the root cause, the illegal Israeli occupation on Palestine. /n/nIsrael’s unlawful occupation and its atrocities must stop, and neither should it be normalized, nor recognized. /n/nMr President, Members of the Court, it is clear that Israel has zero intention to respect let alone abide by its international legal obligations. /n/nThis is also evident in Israel’s actions in Gaza as it is continuing its indiscriminate campaign of annihilation against civilians in Gaza. /n/nApparently, the death of almost 30,000 lives is not enough for Israel as it is close to launching another strike on Rafah, once the only gateway for lifesaving humanitarian assistance to Gaza. /n/nI will begin with the continued denial of the inalienable right of Palestinians to self-determination. /n/nIn its 2004 Advisory Opinion on the Wall, the Court reasserted the Palestinians’ right to self-determination is no longer in issue. /n/nThis confirms the long-held belief of the international community, including as expressed through various United Nations Security Council and General Assembly resolutions that the Palestinian people are entitled to self-determination. /n/nLet me reconfirm Indonesia’s position, in line with the Court’s view, that the fulfilment of such right is an erga omnes obligation. /n/nIn other words, all countries  I repeat  all countries have a legal obligation to respect that right and to contribute to its realization. /n/nConsequently, any endorsement or recognition of Israel’s policies or practices that obstructs the right to self-determination of the Palestinians shall be unlawful. /n/nMr President, Members of the Court, in addressing the issue of the right to self- determination of the Palestinians, it is also important to remind ourselves that the occupation has become an instrument to suppress such a fundamental right. /n/nThis Court, in its Opinion on the Wall, as well as the United Nations Security Council and General Assembly, in their resolutions, have reaffirmed from time to time the status of Israel an occupying Power. /n/nThe occupation has been prolonged and enabled by Israel’s series of breaches of its obligations under international law, including international humanitarian law and international human rights law. /n/nFirst, the Israeli occupation is a result of an unjustified use of force. /n/nTherefore, the occupation should be unlawful from the beginning and continues to be so. /n/nThe use of force by Israel could not be justified under the guise of self-defence. It is also in breach of the principles of necessity and proportionality. /n/nIt is indeed against the prohibition of aggression, a peremptory norm of international law, from which no derogation is permitted /n/nSecond, the illegal annexation of the Occupied Palestinian Territory. /n/nAs an occupying Power, Israel is legally obliged to keep its occupation temporary. /n/nThis has been violated by Israel as it has been attempting to make its occupation permanent and also to annex parts of the occupied territory. /n/nAs a matter of law, under no circumstances shall Israel be allowed to annex any part of the occupied territory. /n/nThe United Nations Security Council, in its various resolutions, has reaffirmed the established principle that acquisition of territory by war is inadmissible. /n/nIt is an absolute principle that applies even in circumstances where war has been resorted to lawfully, such as in self-defence, which is certainly not the case for Israel. /n/nIsrael’s transgression to international law does not stop there as it has declared that Jerusalem is the “eternal undivided capital” of Israel /n/nNot only are these actions unlawful, they are also highly prejudicial to the prospect of a two-State solution. /n/nThird, continued expansion of illegal settlement. /n/nThe policy of Israel in transferring its own population and forcibly displacing Palestinians from the occupied territory contravenes the fundamental rules of international humanitarian law. /n/nThe policy of Israel in transferring its own population and forcibly displacing Palestinians from the occupied territory contravenes the fundamental rules of international humanitarian law. /n/nIt is worsened by Israel’s pursuit to change the demographic composition of the West Bank. /n/nThis policy demonstrates Israel’s complete disregard of international law and also shows the intention to make the situation irreversible. /n/nFourth, the apartheid policy against the Palestinians. /n/nAs an occupying Power, Israel is legally obliged to act in the best interest of the Palestinians. /n/nInstead, Israel has been reinforcing its prolonged occupation by imposing military orders on the Palestinian population which are not applied to Jewish Israeli settlers. /n/nThe existence of separate legal régimes that are applied exclusively on different groups of people is a textbook apartheid policy that constitutes a grave violation of human rights, particularly crimes against humanity. /n/nHaving said that, it is clear that the continuation of such apartheid régime is paramount to another breach of a peremptory norm of international law. /n/nThis should begin with respect to the fundamental rights of the Palestinian people, particularly the right to self-determination which has been systematically denied by Israel. /n/nIt follows that we must bring this illegal situation to an end."
    },
    {
        "voto": 1,
        "juez": "Indonesia",
        "pregunta": "Israel is under an obligation to terminate its breaches of international law; it is under an obligation to cease forthwith the works of construction of the wall being built in the Occupied Palestinian Territory, including in and around East Jerusalem, to dismantle forthwith the structure therein situated, and to repeal or render ineffective forthwith all legislative and regulatory acts relating thereto, in accordance with paragraph 151 of this Opinion",
        "texto": "First, there is no viable peace process to be undermined. /n/nIsrael has been consistently obstructing a negotiated two-State solution that is in line with international law and relevant United Nations resolutions. /n/nIsrael has even been circumventing negotiations through numerous strategic pretexts. /n/nWith such strong resistance from Israel to stop its colonial project and its fait-accompli unilateral actions, no peace process will viably bring a just, lasting and comprehensive solution. After all, negotiation with someone holding a gun against your head is not a negotiation at all /n/nDespite Israel’s rhetoric on peace, its successive governments have openly expressed their abandonment of the peace process, including by declaring the Oslo Accord “null and void”. /n/nIt is no wonder that Israeli officials of all levels have been openly ignoring the calls from the United Nations Security Council to settle this issue peacefully and abide by its international obligations. /n/nAlong with these attitudes, Israel has only been pursuing a one-sided “solution” without engaging Palestinians, let alone addressing their interest. /n/nIndonesia submits that these confirm that Israel has never been interested in any peace process. /n/nIsrael must cease completely, unconditionally and immediately all of its unlawful actions and policies in the Occupied Palestinian Territory. /n/nWith the continued presence of Israeli forces in the West Bank and Gaza, it is impossible to see Israeli compliance with its obligations. Thus, it is imperative that Israel must withdraw its forces. /n/nGiven the illegal nature of the occupation, Israel’s withdrawal must neither be done with pre-conditions nor subject to any negotiations. They must withdraw now! I repeat: they must withdraw now! /n/nMoreover, all States and the United Nations should also ensure Israel’s compliance with its obligations under international law."
    },
    {
        "voto": 1,
        "juez": "Indonesia",
        "pregunta": "Israel is under an obligation to make reparation for al1 damage caused by the construction of the wall in the Occupied Palestinian Territory,including in and around East Jerusalem",
        "texto": "Israel should also be obliged to make reparations both to the State of Palestine as well as to the Palestinian people."
    },
    {
        "voto": 1,
        "juez": "Indonesia",
        "pregunta": "All States are under an obligation not to recognize the illegal situation resulting from the construction of the wall and not to render aid or assistance in maintaining the situation created by such construction; all States parties to the Fourth Geneva Convention relative to the Protection of Civilian Persons in Time of War of 12 August 1949 have in addition the obligation, while respecting the United Nations Charter and international law, to ensure compliance by Israel with international humanitarian law as embodied in that Convention",
        "texto": "Mr President, please allow me to recall a legal maxim which states that no one may enjoy legal benefits from illegal actions. /n/nTherefore, Israel’s attempt to make its occupation permanent shall never be a valid ground to claim a legitimate title over the Palestinian territory. /n/nIn line with this, all States and the United Nations must not recognize the illegal situation arising from the violation of international law by Israel. /n/nAll States must not render any assistance to the maintenance of such violation."
    }
]