[
    {
        "voto": 1,
        "juez": "Kuwait",
        "pregunta": "Finds that it has jurisdiction to give the advisory opinion requested",
        "texto": "With your permission, I turn now to my first topic focusing on whether the Court has jurisdiction to render the advisory opinion requested. In Kuwait’s view, the answer is a categorical yes. Indeed, the majority of submissions in these proceedings argue in favour of the Court’s jurisdiction. Article 65 of the Statute of the Court provides that the Court may render an advisory opinion “on any legal question at the request of [any organ or institution] authorized by . . . the Charter of the United Nations to make such a request”. In turn, Article 96 of the United Nations Charter: “The General Assembly or the Security Council may request the International Court of Justice to give an advisory opinion on any legal question”. In practice, it is primarily the General Assembly that has most frequently utilized this procedure to date. After all, when the General Assembly decides to request the Court to deliver an advisory opinion, this means that the request reflects an important concern of the international community, seeking a legal answer. The Court itself observed that the General Assembly, within the scope of its peacekeeping responsibilities, has a broader perspective than that of the Security Council, as it also considers humanitarian, social and economic aspects. /n/nAn attentive look at the Court’s jurisprudence points to the fact that “only ‘compelling reasons’ may lead the Court to refuse its opinion in response to a request falling within its jurisdiction”. Although the Court has the discretionary power to refuse to respond to a request for an advisory opinion for reasons of judicial propriety, it has not availed itself of this option thus far. /n/nIn the present case, it is incontestable that the questions included in the relevant General Assembly resolution are clearly specific questions of legal character. Any attempt to qualify them as non-specific or non-legal should fail. It is worth noting that the Court in the Wall Advisory Opinion rejected similar attempts. In essence, in the Wall Advisory Opinion, the central issue revolved around the construction of the wall and its impact on the right to self-determination of the Palestinian people. Twenty years later, the context has broadened substantially. The Court is now tasked with determining the legal status of the ongoing occupation of the Occupied Palestinian Territory since 1967, given its persistence for over 57 years."
    },
    {
        "voto": 1,
        "juez": "Kuwait",
        "pregunta": "Decides to comply with the request for an advisory opinion",
        "texto": "The Court has an important role to play in this regard, by stating what the applicable rules of international law are — including the rights and obligations of the relevant parties, all States and the United Nations. This is exactly the purpose of the United Nations General Assembly resolution requesting the Court to deliver an advisory opinion. By so doing, the Court may in fact help revive negotiations and inspire a return to a peace process premised on international law. After all, the Court’s advisory opinions shed light on complicated legal issues, appeasing tensions, uncertainties and potential disputes."
    },
    {
        "voto": 1,
        "juez": "Kuwait",
        "pregunta":"The construction of the wall being built by Israel, the occupying Power, in the Occupied Palestinian Territory, including in and around East Jerusalem, and its associated régime, are contrary to international law",
        "texto": "Regrettably, the above-mentioned foundational rules have not been upheld in the case of Palestine. The conflict between Palestine and Israel, hereafter referred to as the “occupying Power,” is an illegal occupation conflict, involving on one side an occupying Power equipped with all military means, and on the other side an occupied nation without defensive capabilities, facing daily expulsion, human rights violations and all sufferings associated with any occupation situation. /n/nOver the past decades, the situation between the Palestinians and the occupying Power has been extremely tense, resulting in serious human rights law and humanitarian law violations committed by the latter. Various intergovernmental and non-governmental organizations have documented these violations by publishing comprehensive reports. This climate of violence compromises any possibility of reasonably discussing the issues at stake. This is further exacerbated by the recent developments in Gaza. The occupying Power has waged an illegitimate war on the Palestinians in Gaza characterized by numerous international law violations. The ongoing flagrant violations have been highlighted in a series of statements issued, amongst others, by the United Nations Secretary-General, the United Nations High Commissioner for Human Rights and the Special Procedures of the United Nations Human Rights Council. /n/nIn the 1948 Nakba, 750,000 Palestinians were forcibly displaced, and since then millions more. The situation has deteriorated exponentially since the illegal occupation started in 1967. The occupying Power has engaged in a forced displacement campaign against the Palestinians by demolishing their homes and confiscating their lands. Forced displacement violates international law. The occupying Power is under the obligation to ensure that its operations in the Occupied Palestinian Territory comply with the Fourth Geneva Convention of 1949 relative to the Protection of Civilian Persons in Time of War to which it is a party. Article 49 of this convention clearly prohibits “forcible transfers, individual or mass... regardless of their motive,” which includes forced displacements as well as expulsions from the Occupied Palestinian Territory. Furthermore, Article 53 of the same instrument prohibits the destruction of property. Finally, under Article 147, illegal transfers, destruction, and appropriation of property carried out on a large scale is prohibited. /n/nAs Kuwait explained in its Written Submission, the occupying Power has also committed other grave violations of international law, including the policy of settling parts of its population in the Occupied Palestinian Territory. This unlawful policy has and continues to be deplorably promoted by the successive governments of the occupying Power. Since 1967, the occupying Power has embarked on an intensive campaign of colonization. Some settlements consisted of just a few prefabricated houses, while others expanded to become fully fledged small towns. In early 2023, there were around 730,000 Israeli settlers and over 280 Israeli settlements in the occupied West Bank, including 230,000 settlers in East Jerusalem. These settlements are sustained by a network of military checkpoints and restricted zones, as well as Jewish-only roads and highways, all of which limit gravely the lives and livelihoods of Palestinians and violate their fundamental human rights. Both the construction of settlements and the transfer of settlers to the West Bank and Gaza are grave violations of international law, in particular Article 49 of the Fourth Geneva Convention which states that “the occupying power shall not deport or transfer parts of its own civilian population into the territory it occupies”. /n/nIt is also noteworthy, Mr President, that settlers in the Occupied Palestinian Territory are not governed by the same laws that apply to the indigenous inhabitants of the territory. Jewish settlers are provided with special rights, facilities and subsidies that are denied to the indigenous Palestinian population. The occupying Power’s policy not only supports the existing settlers, but also incentivizes new settlers. The discriminatory policies and practices also violate the sovereignty of Palestinians over their natural resources — allowing the settlers and foreign companies to exploit the water and agricultural products of the occupied land without any benefit to the occupied population. It is widely recognized that the occupying Power has codified its discriminatory policies and practices against Palestinians in its legislation. Specifically, it grants rights to Israeli Jews and systematically discriminates against Palestinians. For instance, the Land Acquisition Law of 1953 facilitates the alienation of confiscated Palestinian land for the benefit of various institutions of the occupying Power. Quasi-public organizations, such as the Jewish Agency, engage in material discrimination, in particular through the allocation of confiscated Palestinian land to Israeli Jews. /n/nIn their written submissions, the great majority of States participating in these proceedings, along with three intergovernmental organizations, concluded that the occupation of the Occupied Palestinian Territory is illegal. Kuwait firmly agrees with this view. In its Written Submission, Kuwait identified several reasons proving the illegality of this occupation. I will provide a brief overview of these reasons for the Court. /n/nThe occupation violates a series of jus cogens norms. First, the obligation to respect the right to self-determination of the Palestinian people. The right of people to self-determination is a right clearly recognized in international law as evidenced by several instruments, and as submitted by 35 States and international organizations participating in these proceedings. This is articulated in Article 1 (2) of the United Nations Charter which defines the purposes of the United Nations including “[t]o develop friendly relations among nations based on respect for the principle of equal rights and self-determination of peoples, and to take other appropriate measures to strengthen universal peace”. The same obligations are expressed in Article 1 of the International Covenant on Civil and Political Rights and the International Covenant on Economic, Social and Cultural Rights. /n/nSecond, Kuwait joins the participants in these proceedings who have concluded in their Written Submissions that the ongoing military occupation of the Occupied Palestinian Territory is illegal because it violates the jus cogens prohibition on the use of force. Third, the occupying Power, by confiscating and annexing parts of the Occupied Palestinian Territory, violates the prohibition on the acquisition of territory by force. This was underscored by 38 participants in the written proceedings. This fundamental norm was incorporated into Security Council resolution 242 of 1967 and reaffirmed in Security Council resolution 338 of 1973. Accordingly, the occupying Power does not have the right to claim sovereignty over the Occupied Palestinian Territory occupied since 1967. /n/nFourth, the occupation is illegal because it obviously violates the law of military occupation. For instance, the occupation of the Occupied Palestinian Territory is not of a minimal duration. Facts clearly demonstrate that it is intended to be prolonged and ultimately permanent. A permanent occupation constitutes a serious violation of international law. Based on the verifiable evidence available to us, it is indisputable that this is precisely what is happening in the Occupied Palestinian Territory. This prolonged occupation and indefinite violation of the Palestinians’ right to self-determination renders the occupation illegal. Moreover, the conduct of the occupying Power in the Occupied Palestinian Territory violates the rules of international humanitarian law. In the Wall Advisory Opinion, the Court stated that: “the Fourth Geneva Convention . . . is applicable in the [occupied] Palestinian territories.” The Court also determined that the Hague Regulations are reflective of customary international law and thus applicable to the conduct of the occupying Power in the Occupied Palestinian Territory. Far from complying with the law of occupation, the actions of the occupying Power disregard international law. These actions include, inter alia, the establishment of settlements in the Occupied Palestinian Territory, confiscation of Palestinian public and private property, and its failure to protect Palestinians from violence caused by State actors and private parties, including, inter alia, armed illegal settlers. /n/nFinally, the occupation violates the jus cogens prohibition of apartheid. Twenty-one participants in these proceedings supported this in their Written Submissions, while fourteen maintained that the situation of apartheid qualifies the occupation as illegal under international law. The prohibition of apartheid is evidenced in various sources of international law. The occupying Power is bound by the 1965 Convention on the Elimination of All Forms of Racial Discrimination, to which it is a party. Furthermore, it shall abide by the prohibition of apartheid as enshrined in the 1973 International Convention on the Suppression and the Punishment of the Crime of Apartheid, which codifies customary international law. Several voices and independent experts have warned that the occupation of the Occupied Palestinian Territory amounts to a régime of apartheid. For instance, in March 2022, the Special Rapporteur on the situation of human rights in the Palestinian territories occupied since 1967 in his report reached a similar conclusion."
    },
    {
        "voto": 1,
        "juez": "Kuwait",
        "pregunta": "Israel is under an obligation to terminate its breaches of international law; it is under an obligation to cease forthwith the works of construction of the wall being built in the Occupied Palestinian Territory, including in and around East Jerusalem, to dismantle forthwith the structure therein situated, and to repeal or render ineffective forthwith all legislative and regulatory acts relating thereto, in accordance with paragraph 151 of this Opinion",
        "texto": "Kuwait respectfully suggests that the above violations cannot be reconciled with the fundamental rules of international law. Hence, the occupation must be declared illegal in accordance with international law and the relevant United Nations Security Council resolutions. It must stop. This will guarantee the right of the Palestinian people to be a viable State and along 1967 borders, with East Jerusalem as its capital. /n/nAs indicated, the actions of the occupying Power and the occupation as a whole are plainly incompatible with the rights of the Palestinian people and obligations of the occupying Power under international law. Its breaches of these rights and obligations engage the occupying Power’s international responsibility. The occupying Power must therefore take several measures. First, it must provide Palestinians with relief in accordance with the principles of customary international law on the responsibility of States for internationally wrongful acts. This must be achieved through the immediate cessation of its illegal occupation."
    },
    {
        "voto": 1,
        "juez": "Kuwait",
        "pregunta": "Israel is under an obligation to make reparation for al1 damage caused by the construction of the wall in the Occupied Palestinian Territory,including in and around East Jerusalem",
        "texto": "Second, the occupying Power must give assurances and guarantees of non-repetition of its international law violations. The occupying Power shall commit itself to not repeating the same breaches in the future. Finally, the occupying Power is under the obligation to make full reparation for the injury caused by its occupation and discriminatory policies and practices."
    },
    {
        "voto": 1,
        "juez": "Kuwait",
        "pregunta": "All States are under an obligation not to recognize the illegal situation resulting from the construction of the wall and not to render aid or assistance in maintaining the situation created by such construction; all States parties to the Fourth Geneva Convention relative to the Protection of Civilian Persons in Time of War of 12 August 1949 have in addition the obligation, while respecting the United Nations Charter and international law, to ensure compliance by Israel with international humanitarian law as embodied in that Convention",
        "texto": "As for all other States, they are all obliged to refrain from acknowledging the legality of the situation created by the illegal occupation and associated illegal policies and practices. They shall also abstain from offering support or assistance to sustain the circumstances stemming from the unlawful occupation and associated actions. Third States shall also contribute to safeguarding the Palestinian population against war crimes, genocide and crimes against humanity, and ensure that those responsible for crimes committed within the framework of illegal occupation are held accountable."
    },
    {
        "voto": 1,
        "juez": "Kuwait",
        "pregunta": "The United Nations, and especially the General Assembly and the Security Council, should consider what further action is required to bring to an end the illegal situation resulting from the construction of the wall and the associated régime, taking due account of the present Advisory Opinion",
        "texto": "In turn, the United Nations shall refrain from acknowledging the legality of the situation resulting from the illegal occupation and associated actions. The United Nations shall also refrain from offering support or assistance to prolong the situation and should instead co-operate to bring an end to this illegal occupation."
    }
]