[
    {
        "voto": 0,
        "juez": "Norway",
        "pregunta":"The construction of the wall being built by Israel, the occupying Power, in the Occupied Palestinian Territory, including in and around East Jerusalem, and its associated régime, are contrary to international law",
        "texto": "Israel’s occupation of Palestinian Territory has continued since 1967. Recent developments give rise to the utmost concern. They include ongoing indiscriminate and disproportionate use of force and other measures in the Gaza Strip, as well as illegal settlements in the West Bank, including East Jerusalem. House evictions, demolitions, forced displacement and settler violence against the Palestinian population are aspects of the Israeli occupation. /n/nSuch acts run counter to fundamental human rights, international humanitarian law and the right to self-determination of the Palestinian people. They threaten the foundations under international law for the vision of a region where two States, Israel and Palestine, live side by side within secure and recognized borders. Against this background, an advisory opinion will provide essential and timely guidance to the international community /n/nMr President, the Israeli settlements in the West Bank and East Jerusalem constitute a chief obstacle to any prospect of settlement and peace in the area. In its Advisory Opinion of 2004 on the legality of the construction of a wall, this Court stated that “the Israeli settlements in the Occupied Palestinian Territory (including East Jerusalem) have been established in breach of international law”40. The Security Council has in numerous resolutions, including 2334 of 2016, restated its determination that the settlements constitute “a flagrant violation of international law”41 and stressed the need to reverse the negative trends on the ground, which are steadily eroding the two-State solution and entrenching a one-State reality. /n/nAt the outset, we recall that the definition of “occupied territory” in Article 42 of the 1907 Hague Regulations relies on a factual assessment. A territory is considered occupied when it is “actually placed under the authority” of the hostile army. This triggers key legal rules, in particular out of humanitarian considerations, notably pursuant to the Fourth Geneva Convention. /n/nThe factual assessment made by this Court at the time of the Wall Opinion remains, in our view, entirely true today: both the Gaza Strip and the West Bank are integral parts of the territory occupied by Israel in 1967, irrespective of the Israeli military withdrawal from Gaza in 2005. The Security Council recently stressed in its resolution 2720 of 2023 “that the Gaza Strip constitutes an integral part of the territory occupied in 1967” and reiterated “the vision of the two-State solution, with the Gaza Strip as part of the Palestinian State”, echoing its resolution 1860 of 2009. /n/nThe protection given to the civilian population by the laws of occupation continue to apply. This does, however, not impede a consideration of the legality of the occupation as such. The occupation has now lasted for more than half a century. While international law does not set any specific time limit, military occupation is, in essence, temporary42. This is evident from provisions such as Articles 6 (3) and 47 of the Fourth Geneva Convention and was recalled by the General Assembly in its resolution 77/126 in 2022, emphasizing “that the occupation of a territory is to be a temporary, de facto situation, whereby the occupying Power can neither claim possession nor exert its sovereignty over the territory it occupies”. Recognized authorities have reminded us that “the law on belligerent occupation is based on the assumption that occupation of foreign territory, being an extraordinary measure, may be justified for a limited time only”43. /n/nA military occupation cannot be permanent. If an occupation is allowed to be indefinite, then the distinction, under jus ad bellum, between occupation and annexation dissolves. Furthermore, risks are patent with regard to “deportations, transfers and evacuations” in breach of Article 49 of the Fourth Geneva Convention. Both this Court and the Security Council have found Israel to have violated this provision. Such developments give reason to ask whether the situation is turning into a de facto annexation. /n/nIn its Advisory Opinion on the Wall, the Court noted that “the principle of self-determination of peoples has been enshrined in the United Nations Charter and reaffirmed by the General Assembly in resolution 2625 (XXV) . . ., pursuant to which ‘Every State has the duty to refrain from any forcible action which deprives peoples referred to . . . of their right to self-determination’”44. The Court notes in paragraph 149 that Israel is bound to comply with its obligation to respect the right of the Palestinian people to self-determination. /n/nIt added that there was a risk of further alterations to the demographic composition of the territory, contributing to the departure of Palestinian populations from certain areas. On this basis, the Court concluded that the construction of the wall, along with measures taken previously, severely impeded the exercise by the Palestinian people to its right to self-determination and is therefore a breach of Israel’s obligation to respect that right. /n/nIn its 2019 Advisory Opinion on Chagos45, paragraph 160, the Court emphasized the customary law character of the right to territorial integrity of a non-self-governing territory as a corollary of the right to self-determination. It follows that any detachment by the administering Power of part of a non-self-governing territory, unless based on the freely expressed and genuine will of the people of that territory, is contrary to the right to self-determination. /n/nNorway believes that permanent or irreversible measures taken by Israel on Occupied Palestinian Territory would likewise be contrary to the Palestinian people’s right to self-determination. /n/nI turn now to annexation. Annexation is a unilateral act by which a State incorporates into its territory all or part of the territory of another. As a concomitant of the prohibition on the threat or use of force in Article 2 (4) of the United Nations Charter, annexation is prohibited under customary international law. /n/nThis prohibition is reflected in Security Council resolution 242 of 1967, referring to the “inadmissibility of the acquisition of territory by war”, repeated in its resolution 298 of 1971. It is on this basis that the Security Council in its resolution 469 of 1980 declared Israel’s de jure annexation of East Jerusalem to be “invalid”. /n/nWhat form annexation takes is irrelevant. To quote the Court: “With regard to the question of form, it should be observed that this is not a domain in which international law imposes any special or strict requirements”. This is why it must be reiterated that annexation under any form — whether de jure or de facto — is illegal under international law. The formal characterization is immaterial. /n/nNevertheless, there are grounds for asking whether Israel’s occupation may be seen as tantamount to de facto annexation, as the Court did in the Wall Opinion: “the construction of the wall and its associated régime create a ‘fait accompli’ on the ground that could well become permanent, in which case, and notwithstanding the formal characterization of the wall by Israel, it would be tantamount to de facto annexation”46. /n/nIn its September 2022 report, the Independent International Commission of Inquiry on the Occupied Palestinian Territory, including East Jerusalem, held that “Israel treats the occupation as permanent and has — for all intents and purposes — annexed parts of the West Bank, while seeking to hide behind a fiction of temporariness. Actions by Israel constituting de facto annexation include expropriating land and natural resources, establishing settlements and outposts, maintaining a restrictive and discriminatory planning and building regime for Palestinians and extending Israeli law extraterritorially to Israeli settlers in the West Bank.”47 /n/nThe Commission considered the situation tantamount to a de facto annexation, as alluded to by the Court48. /n/nFirst, the establishment of settlements in the Occupied Palestinian Territory represents a transfer, over decades, of parts of the occupying Power’s own civilian population into the territory it occupies, in breach of Article 49 (6) of the Fourth Geneva Convention. The Security Council has repeatedly, including in resolution 2334 (2016), condemned all measures aimed at altering the demographic composition, character and status of the territory occupied since 1967. /n/nSecond, it could be asked whether the duration of the occupation, which has now lasted for more than half a century, in itself renders the occupation tantamount to de facto annexation. /n/nThird, there are grounds for serious concerns regarding announced plans for further expansion of Israeli settlements in the West Bank, including East Jerusalem. /n/nFourth, Israel has appropriated natural resources of the West Bank, including water resources, and seized control of the physical infrastructure in order to bind the area closer to itself and, it seems, to render irreversible its presence in the territory49. Of particular concern are the repeated demolitions of the local Palestinian Bedouin communities and plans for infrastructure constructions that will isolate Bethlehem and the southern West Bank from East Jerusalem."
    },
    {
        "voto": 0,
        "juez": "Norway",
        "pregunta": "Israel is under an obligation to terminate its breaches of international law; it is under an obligation to cease forthwith the works of construction of the wall being built in the Occupied Palestinian Territory, including in and around East Jerusalem, to dismantle forthwith the structure therein situated, and to repeal or render ineffective forthwith all legislative and regulatory acts relating thereto, in accordance with paragraph 151 of this Opinion",
        "texto": "Clear legal obligations incumbent on Israel include access of humanitarian actors to the Occupied Palestinian Territory, including the Gaza Strip. In resolution 2720 (2023), the Security Council reiterated its demand that all parties to the conflict, including Israel, comply with their obligations including with regard to humanitarian access and the protection of humanitarian personnel and their freedom of movement55."
    }
]