[
    {
        "voto": 1,
        "juez": "Republic of Maldives",
        "pregunta": "The construction of the wall being built by Israel, the occupying Power, in the Occupied Palestinian Territory, including in and around East Jerusalem, and its associated régime, are contrary to international law",
        "texto": "Mr President, Members of the Court, representing the final State appearing, I have the honour of identifying the main points addressed during the course of this hearing on the violations by Israel of international law.\n\nThe Maldives provides this analysis with a focus on the issue of water resources. Why? Because of two streams of significance.\n\nFirst, the significance of water resources to the Palestinian people: in fact, it has been described as the “most vital resource in the [Occupied Palestinian Territory]” by Palestine. A tidal wave of suffering has been unleashed by Israeli policies and practices with respect to water resources, which are characterized by deprivation, denial, discrimination and destruction:\n\nDeprivation of access to water many Palestinians in the Gaza Strip simply have, I use the Court’s own words, “no access to potable water”.\n\nDenial of enjoyment of those resources on a discriminatory basis—in the West Bank, where Israel has seized control of water resources, use of vital groundwaters is marred by grossly inequitable allocations between Israelis and Palestinians.\n\nDestruction of vital infrastructure, with Israel demolishing sanitation structures and pipelines. The second stream of significance is to the questions before the Court. The issue of water resources flows through four key aspects of the unlawfulness of Israeli policies and practices on which the Oral Submissions have focused. I address each aspect in turn.\n\nThe first key aspect: the violation of the right of the Palestinian people to self-determination. The following points are crystal clear.\n\nFirst, the Palestinians are a distinct people with a right to self-determination, an inalienable norm of jus cogens.\n\nSecond, Israel’s conduct has violated different components of that right, notably the right to territorial integrity, the right not to be subjected to demographic manipulation within that territory by a foreign Power, the right of the people to pursue its chosen economic, social and cultural development and its right to exercise permanent sovereignty over its natural resources.\n\nThe critical importance of this well-established latter component the Palestinian people’s right to exercise permanent sovereignty over their natural resources was recently stressed by the General Assembly in its resolution of December 2023. Such resources clearly include water. Israel’s policies and practices with respect to water resources the deprivation, denial on a discriminatory basis and destruction thus constitute one acutely serious and ongoing facet of the breach of the Palestinian people’s right of self-determination. Described by a United Nations body as “one of the most fundamental conditions for survival”, for a people sufficient clean water is indispensable.\n\nTurning to the second key aspect, the policies and practices of Israel in the Occupied Palestinian Territory violate the prohibition of the acquisition of territory by force.\n\nThis afternoon, we have heard some attempts to muddy the waters in this regard, so I will recall the points of crystal clarity.\n\nFirst, a corollary of the jus cogens prohibition of use of force is the prohibition of any acquisition of territory by threat or use of force. Irrespective of international recognition of Palestine’s borders, the applicability of this prohibition to the Occupied Palestinian Territory cannot be in doubt, as expressly recognized in resolutions of both the General Assembly and Security Council.\n\nSecond, international law requires that occupation be temporary.\n\nThird, any purported exercise of the use of self-defence must be necessary and proportionate.\n\nFourth, and flowing from the three previous points, an occupying Power cannot acquire sovereignty over an occupied territory, including by annexation, irrespective of whether it claims to have acted in self-defence at any point during the occupation.\n\nYet Israel has annexed all of the Occupied Palestinian Territory, whether through Israeli law or conduct manifesting a de facto annexation, creating a “fait accompli”. There is no shortage of evidence on this reality, as emphasized by many United Nations bodies and demonstrated by the map recently shown by the Prime Minister of Israel before the General Assembly referred to on the first day of this hearing.\n\nIsrael’s deprivation, denial on a discriminatory basis and destruction with respect to water resources is one facet of this annexation. The scale and nature of Israel’s conduct in this regard makes clear that it forms an integral element of Israel’s establishment of control through coercive measures reflecting its intention to appropriate that territory permanently, the occupation having (to quote the Special Rapporteur) “burst through the restraints of temporariness long ago”.\n\nIsrael’s settlement expansion is plainly another integral element of that annexation, with Palestinians reduced to inhabiting a “fragmented archipelago of disparate patches of land”.\n\nOf course, the different aspects of Israel’s violations of international law are not watertight from one another. Such prolonged occupation, annexation and settlement expansion also violate the right of self-determination, to which I referred earlier, a right which cannot be exercised in the face of a foreign occupier purporting to appropriate territory for itself and thereby dispossess the Palestinian people.\n\nThe third key aspect is that the policies and practices of Israel in the Occupied Palestinian Territory violate the law of occupation.\n\nThe indisputable starting-point is that, as an occupying power, Israel is bound to respect, throughout the occupied territory, its obligations under international humanitarian law, a régime designed to ensure the protection of the people under occupation.\n\nThe Maldives agrees that the continuing applicability of international humanitarian law is without prejudice to the unlawfulness of Israel’s occupation.\n\nNow, many examples of international humanitarian law breaches have been cited before the Court, including with respect to Israel’s settlement policy as a breach of Article 49 of the Fourth Geneva Convention. Israel’s policies and practices with respect to water resources constitute a cascade of further violations of the Fourth Geneva Convention and the 1907 Hague Regulations, notably:\n\nIsrael’s conduct is a violation of the rules prohibiting destruction of property, which includes water and sanitation infrastructure, in circumstances where it is clearly not “absolutely necessary” for military operations.\n\nIt is a violation of the prohibition on destruction or removal of objects essential for survival of the civilian population, with water installations and supplies obviously qualifying as such.\n\nIt is a violation of the prohibition on pillage, as well as the rules of usufruct.\n\nIt is also a violation of the obligation to ensure and maintain public health and hygiene in territory it occupies. This goes to a point of grave practical concern a raft of horrific diseases spring directly from the lack of clean water, with little children particularly vulnerable.\n\nThe fourth and final key aspect is that Israel’s policies and practices in the Occupied Territory are in violation of international human rights law, including the fundamental jus cogens prohibition of discrimination.\n\nThe irrefutable starting-point: this is that Israel bears a duty to secure respect for the applicable rules of international human rights law throughout the territory that it occupies.\n\nInternational human rights law encompasses the right to water. Notably:\n\nThat right emanates from Articles 11 and 12 of the International Covenant on Economic, Social and Cultural Rights. As the General Assembly affirmed in 2016, “the human rights to safe drinking water and sanitation as components of the right to an adequate standard of living are essential for the full enjoyment of the right to life and all human rights”.\n\nFurther, as a party to the Convention on the Rights of the Child, Israel has expressly undertaken to pursue “full implementation” of each child’s rights to the enjoyment of the highest attainable standard of health, including through the provision of clean drinking water.\n\nEqually clearly, international human rights law prohibits discrimination. Notably, pursuant to the Convention on the Elimination of All Forms of Racial Discrimination, Israel is obliged to prohibit and to eliminate racial discrimination in all its forms and to guarantee the right of everyone, without distinction as to race, colour, national or ethnic origin, to the enjoyment of rights, which include a right to water.\n\nYet Israel’s discriminatory policies and practices with respect to access to water have been well documented and condemned by a deluge of United Nations bodies, with the Committee on the Elimination of Racial Discrimination “appalled at the hermetic character of the separation of the two groups [Jewish communities in illegal settlements on the one hand and Palestinian populations on the other hand] who do not enjoy equal access to water resources”.\n\nThe impact on women and children is notably egregious, with the dearth of clean water an acute crisis for mothers trying to feed their babies.\n\nIsrael’s policy and practices relating to water are but one among many examples of systematic discrimination which have been detailed by other States in these proceedings.\n\nThe Maldives joins the plethora of other States in confirming before this Court that the régime which Israel has established throughout the occupied territory constitutes apartheid, pursuant to the customary international law definition as reflected in Article II of the Apartheid Convention.\n\nMr President, Members of the Court, at a human level, Israel’s policies and practices with regard to water resources are inexcusably intensifying the hardship being endured by the Palestinian people and exemplify the illegality which has characterized Israel’s occupation. The final speech for the Maldives will address how the Court should answer the questions posed by the General Assembly in light of Israel’s breaches of international law."
    },
    {
        "voto": 1,
        "juez": "Republic of Maldives",
        "pregunta": "Israel is under an obligation to terminate its breaches of international law; it is under an obligation to cease forthwith the works of construction of the wall being built in the Occupied Palestinian Territory, including in and around East Jerusalem, to dismantle forthwith the structure therein situated, and to repeal or render ineffective forthwith all legislative and regulatory acts relating thereto, in accordance with paragraph 151 of this Opinion",
        "texto": "Question asks the Court to opine on the legal consequences of Israel’s ongoing violation of the Palestinian people’s right to self-determination, its prolonged occupation, settlement and annexation of the Occupied Palestinian Territory, and its discriminatory legislation and measures.\n\nThe States appearing before you have been largely consistent on this question. And that is unsurprising because the relevant principles are well established in the customary international law rules on State responsibility and the Court’s jurisprudence.\n\nFirst, Israel is obliged to cease its continuing unlawful acts. This includes, of course, an obligation to terminate its occupation, just as South Africa was obliged to withdraw from Namibia where its presence was illegal. The Court there specifically stated that withdrawal must occur “immediately”. Here, the General Assembly has recently stressed “the urgency of achieving without delay an end to the Israeli occupation”.\n\nBut that is not all. Israel must also cease the discrete unlawful practices which have characterized its occupation. For example, it must dismantle the discriminatory régime concerning water resources referred to in Ms Sander’s speech, in precisely the same way as the Court previously stated that Israel must dismantle both the wall and the associated legislative and regulatory régime which entrenched discrimination77.\n\nSecondly, at the same time as terminating its unlawful acts, Israel must provide assurances that it will not repeat them."
    },
    {
        "voto": 1,
        "juez": "Republic of Maldives",
        "pregunta": "Israel is under an obligation to make reparation for all damage caused by the construction of the wall in the Occupied Palestinian Territory, including in and around East Jerusalem",
        "texto": "Israel is obliged to provide comprehensive reparations. Restitution is optimal, as far as possible. But you heard from Palestine last Monday that no action by Israel now could ever restore the Palestinian people to the situation which would have existed without its violations. In that case, Israel’s reparations must include compensation. And, to the extent that compensation will not fully make good the harms caused, Israel must provide just satisfaction in other forms, such as acknowledging its breaches and providing formal apologies.\n\nFourth, there are obligations on third States. States parties to the Fourth Geneva Convention must search for individuals accused of committing or ordering grave breaches of that instrument, including the rules of occupation, and prosecute or extradite them. Further consequences flow from the occupation’s unlawful status, and I will deal with those in relation to the second question."
    },
    {
        "voto": 1,
        "juez": "Republic of Maldives",
        "pregunta": "All States are under an obligation not to recognize the illegal situation resulting from the construction of the wall and not to render aid or assistance in maintaining the situation created by such construction; all States parties to the Fourth Geneva Convention relative to the Protection of Civilian Persons in Time of War of 12 August 1949 have in addition the obligation, while respecting the United Nations Charter and international law, to ensure compliance by Israel with international humanitarian law as embodied in that Convention",
        "texto": "In question, the General Assembly asked the Court how Israel’s policies and practices in the Occupied Palestinian Territory affect the legal status of the occupation, and what legal consequences arise for all States and the United Nations.\n\nMs Sander has addressed the many illegal aspects of Israel’s occupation. Each and every one of Israel’s unlawful acts engages its responsibility as a State. But what is it that determines the status of the occupation? The factors affecting status are those that go beyond illegality in the conduct of the arbitration and that make the occupation irremediable, meaning that the occupation is what the Court described in the Namibia Opinion as “a situation which is maintained in violation of international law”. In other words, it is those breaches of international law that cannot be cured within the occupation, but only by the occupation coming to an end, that render it unlawful as a matter of status.\n\nOne such matter is the permanence of Israel’s occupation — notably the fait accompli that this Court warned about in its Wall Opinion. Israel has sought to “create irreversible facts on the ground”. As Ms Sander has highlighted, by installing itself as an interminable presence, Israel has violated the prohibition on acquisition of territory by force. The Court need not decide whether Israel’s occupation was unlawful ab initio; its wrongfulness can be established even if one looks only at the fact of its prolonged continuation with no end in contemplation. The wrongful permanence of Israel’s presence — that breach of a peremptory norm of international law — cannot be corrected for as long as Israel remains in the occupied territory at all. That is why it goes to the occupation’s status.\n\nThe same is true when it comes to Israel’s breaches of the right to self-determination. For example, that right encompasses an entitlement to territorial integrity. Whether or not the territory is within internationally recognized borders, contrary to what you have been told this afternoon. It is inherent in Israel’s ongoing occupation that it dispossesses Palestinians of their territory and that it divides the territory: recall the “fragmented archipelago” that Ms Sander referred to. Israel’s presence and the Palestinian people’s right to territorial integrity are mutually exclusive. And again, this is determinative of the occupation’s status.\n\nWhat are the legal consequences of this analysis? For Israel, they include those I have already addressed in relation to question, starting with a duty immediately to terminate the occupation in its entirety. Given the occupation’s unlawful status, Israel simply cannot achieve compliance with international law as long as it remains in occupation. As well, Israel’s ongoing presence cannot produce any effects as a matter of international law, and in particular cannot change the status of any occupied territory.\n\nHowever, as Ms Sander has alluded to, it is not a consequence of the occupation’s status that Israel can somehow escape obligations concerning the conduct of an occupation. To the contrary, pending its urgent withdrawal, Israel remains bound by rules of international humanitarian law. Those rules apply whenever an occupation exists in fact, lawful or not — and, as the Court has stated, “regardless of the status of the occupied territories”. The same is true of Israel’s obligations under international human rights law. Those duties are engaged based on Israel’s exercise of jurisdiction — again, a purely factual state of affairs.\n\nThe conduct of third States and the United Nations is likely to be of critical practical importance in leading Israel to end its unlawful actions. The people of Palestine, like the people of Namibia half a century ago, should be able to “look to the international community for assistance” in realising their rights.\n\nIn light of Israel’s gross and systematic breaches of jus cogens norms, third States bear certain negative duties articulated in the Court’s previous advisory opinions. They must not recognize the situation created by Israel’s occupation as lawful or lend that occupation any support or assistance. Accordingly, they must avoid acts which could imply such recognition, such as engaging in trade or any “other forms of relationship” with Israel which may “entrench” its position. They also must not enter into or maintain treaty relations in which Israel purports to act on behalf of or concerning that territory, except treaties of a humanitarian character. Third States must not send diplomatic or special missions to Israel with a remit extending to the occupied territory, as if that territory were simply part of Israel. A third State which does not uphold these duties may encounter consequences in its own relations with other States. According to the Court in Namibia, “no State which enters into relations with South Africa concerning Namibia may expect the United Nations or its Members to recognize the validity or effects of such relationship”. The same applies here.\n\nEqually, third States bear certain positive duties: an obligation to co-operate, including through the United Nations, to complete Israel’s extraction from the occupied territory; a duty to remove any impediments to the Palestinian people’s exercise of the right to self-determination; and a duty to ensure Israel’s compliance with international humanitarian law.\n\nAs for the United Nations, all of its component parts, but especially the General Assembly and the Security Council, should “consider what further action is required to bring to an end the illegal situation”. In 2004, the Court urged the United Nations, as a matter of “urgent necessity”, to “redouble its efforts to bring the Israeli-Palestinian conflict to a speedy conclusion”. That urgency has not abated; it has intensified. How the Court advises the General Assembly on this occasion will, it is to be hoped, help to illuminate the path forward for the entire United Nations system."
    }
]

