[
    {
        "voto": 1,
        "juez": "Russian Federation",
        "pregunta": "The construction of the wall being built by Israel, the occupying Power, in the Occupied Palestinian Territory, including in and around East Jerusalem, and its associated régime, are contrary to international law",
        "texto": "The other key problem that leads to continuous violations of human rights of Palestinians are the Israeli settlement activities. This policy, sometimes referred to as creation of “facts on the ground”, was launched back in 1967 and has led to progressive shrinking of Palestinian lands. This has effectively undermined prospects of a negotiated solution of the one element of the final status, namely the issues of territory and borders. The overall number of Israeli settlers in the West Bank, including East Jerusalem, is over 700,000. The situation is exacerbated by other arbitrary moves by the Israeli authorities, such as confiscation of lands, demolition of homes and prohibition of new construction. Most recently, this has been accompanied by violence emanating from Israeli settlers.\n\nIn 2023, that is, after the present request for an advisory opinion was made, the settlement activities of Israel have gained a record-breaking speed. Thus, according to the latest report of the United Nations Secretary-General, in 2023, plans for more than 24,700 housing units were advanced, approved or tendered. This is more than double the 11,700 units in 2022, which in itself was a remarkable figure.\n\nDuring the current wave of violence, we have witnessed public statements by Israeli cabinet members announcing plans to resume settlement activities in the Gaza Strip. Thus, on 28 January 2024, at a conference in West Jerusalem, cabinet ministers openly called for deportation of Palestinians from Gaza and presented a map with 21 settlement blocs. One cannot help noting that the event was held two days after this Court indicated provisional measures in the South Africa v. Israel case. The Court agreed that the situation in Gaza poses risks of irreparable harm to the rights of Palestinians guaranteed by the Genocide Convention. This fact alone underscores the gravity of the situation.\n\nIn this connection, it is worth recalling that this Court, in its Advisory Opinion on the Wall, recognized that “the Israeli settlements in the Occupied Palestinian Territory (including East Jerusalem) ha[d] been established in breach of international law”. As explained in that Advisory Opinion, the settlements are contrary to the principle of inadmissibility of acquisition of territory by force. They also contradict the provisions of the Fourth Geneva Convention prohibiting transfers of population and deportations from an occupied territory. Resolutions of the Security Council have characterized that policy as changing the legal status and geographical nature of the occupied territories, and materially affecting their demographic composition.\n\nIn its resolution 2334, the Security Council reaffirmed that the settlements “have no legal validity and constitute a flagrant violation under international law and a major obstacle to the achievement of the two-State solution and a just, lasting and comprehensive peace”.\n\nThis policy is aggravated by numerous violations of other rules of international humanitarian law and human rights law. These include the right to life, to respect for private and family life, to property, to freedom of movement, to freedom of religion, to work, to health, to education, and to an adequate standard of living.\n\nAs mentioned earlier, this policy continues unabated, in defiance of Security Council resolutions and the Quartet Roadmap12. Importantly, as stressed in resolution 2334, the settlements are “dangerously imperilling the viability of the two-State solution based on the 1967 lines”. They are thus also violating the right of the Palestinian people to self-determination.\n\nIsraeli policies in Palestine, to Russia’s deep regret, include other international law violations. Many examples have been provided by other delegations here. The Russian Federation expects the Court to give them due consideration.\n\nThe continued Israeli occupation of Palestine impedes the realization of the Palestinian people of its right to self-determination. Israeli settlements are contrary to the principle of inadmissibility of acquisition of territory by force. They also run counter to the prohibition of transfer and deportation of population of an occupied territory. The settlement activities are aggravated by numerous other violations of international humanitarian law and human rights law. All States are under an obligation not to recognize the illegal situation resulting from Israel’s violations."
    },
    {
        "voto": 1,
        "juez": "Russian Federation",
        "pregunta": "Israel is under an obligation to terminate its breaches of international law; it is under an obligation to cease forthwith the works of construction of the wall being built in the Occupied Palestinian Territory, including in and around East Jerusalem, to dismantle forthwith the structure therein situated, and to repeal or render ineffective forthwith all legislative and regulatory acts relating thereto, in accordance with paragraph 151 of this Opinion",
        "texto": "Mr President, Members of the Court, the question before us, therefore: the legal consequences of those violations. The starting-point here is the well-established rule whereby “every internationally wrongful act of a State entails the international responsibility of that State”14. In the present proceedings, the Court will be right to conclude that Israel’s violations result in Israel’s duty to comply with the obligations it has breached, to put an end to its ongoing violations and to provide reparation for the damage caused.\n\nThis means, first and foremost, that Israel is under an international legal obligation to respect the right of the Palestinian people to self-determination and to stop all settlement activities in the occupied territory.\n\nGiven the particular legal framework in the Middle East peace process, Israel is also under an obligation to cease all activities that impede reaching a final status agreement based on the right of the Palestinian people to self-determination in an independent, viable and contiguous Palestinian State with East Jerusalem as its capital.\n\nHaving said that, the Court will be wise not to engage in a detailed discussion on a precise scope and forms of implementation of Israel’s responsibility. This is important for two reasons.\n\nFirst, advisory proceedings before the Court are not an exercise in implementation of responsibility. No State is invoking Israel’s responsibility in these proceedings, as indeed Israel is precluded from invoking responsibility of others.\n\nA State may only be brought before this Court on the basis of its own consent. Full respect for the principle of consent is a crucial importance for the integrity of international judicial procedures.\n\nSecondly, the international community has established a solid legal framework for the Middle East peace process. This legal framework is a universally recognized and a legally binding one. It contains crucial elements that effectively coincide with the aims of international responsibility. A negotiated two-State solution with an independent, viable and contiguous Palestinian State peacefully co-existing with Israel will be the best recipe for bringing an end to Israeli violations, creating guarantees of their non-repetition and redressing the damage.\n\nThe advantage of the peace process is an idea of direct negotiations between Israel and Palestine. They are to reach an agreement on the basis of their free will. In Russia’s opinion, that significantly strengthens the chances that an agreement will actually be achieved, will indeed satisfy the interests of both parties and will be implemented in practice.\n\nThe Russian Federation invites the Court to be guided by the need to contribute to creating conditions for successful final status negotiations. The best contribution would be a confirmation by the Court that Israel and Palestine are under an obligation to resume such negotiations, while all States and international organizations shall co-operate in order to make that possible.\n\nIn its Written Statement, the Russian Federation has discussed the status of the Court as one of the principal organs of the United Nations15. The Court has on many occasions recognized that its advisory opinions “represent its participation in the activities of the Organization”. When asked by the General Assembly to provide an advisory opinion, the Court should give an opinion that would indeed be useful for the Assembly. For these reasons, we respectfully submit that the Court, when giving an advisory opinion in this case, should be guided by the principles of the peace process and should actively seek to give an opinion that would contribute to their implementation.\n\nIsrael shall terminate its breaches of international law. It must in particular cease all settlement activities and all other activities that impede reaching a final status agreement. At the same time, discussion on Israel’s responsibility must remain within the limits imposed by the advisory nature of these proceedings and to the need to create conditions for successful final status negotiations."
    },
    {
        "voto": 1,
        "juez": "Russian Federation",
        "pregunta": "Israel is under an obligation to make reparation for al1 damage caused by the construction of the wall in the Occupied Palestinian Territory,including in and around East Jerusalem",
        "texto": "Mr President, Members of the Court, the question before us, therefore: the legal consequences of those violations. The starting-point here is the well-established rule whereby “every internationally wrongful act of a State entails the international responsibility of that State”14. In the present proceedings, the Court will be right to conclude that Israel’s violations result in Israel’s duty to comply with the obligations it has breached, to put an end to its ongoing violations and to provide reparation for the damage caused.\n\nThis means, first and foremost, that Israel is under an international legal obligation to respect the right of the Palestinian people to self-determination and to stop all settlement activities in the occupied territory.\n\nGiven the particular legal framework in the Middle East peace process, Israel is also under an obligation to cease all activities that impede reaching a final status agreement based on the right of the Palestinian people to self-determination in an independent, viable and contiguous Palestinian State with East Jerusalem as its capital.\n\nHaving said that, the Court will be wise not to engage in a detailed discussion on a precise scope and forms of implementation of Israel’s responsibility. This is important for two reasons.\n\nFirst, advisory proceedings before the Court are not an exercise in implementation of responsibility. No State is invoking Israel’s responsibility in these proceedings, as indeed Israel is precluded from invoking responsibility of others.\n\nA State may only be brought before this Court on the basis of its own consent. Full respect for the principle of consent is a crucial importance for the integrity of international judicial procedures.\n\nSecondly, the international community has established a solid legal framework for the Middle East peace process. This legal framework is a universally recognized and a legally binding one. It contains crucial elements that effectively coincide with the aims of international responsibility. A negotiated two-State solution with an independent, viable and contiguous Palestinian State peacefully co-existing with Israel will be the best recipe for bringing an end to Israeli violations, creating guarantees of their non-repetition and redressing the damage.\n\nThe advantage of the peace process is an idea of direct negotiations between Israel and Palestine. They are to reach an agreement on the basis of their free will. In Russia’s opinion, that significantly strengthens the chances that an agreement will actually be achieved, will indeed satisfy the interests of both parties and will be implemented in practice.\n\nThe Russian Federation invites the Court to be guided by the need to contribute to creating conditions for successful final status negotiations. The best contribution would be a confirmation by the Court that Israel and Palestine are under an obligation to resume such negotiations, while all States and international organizations shall co-operate in order to make that possible.\n\nIn its Written Statement, the Russian Federation has discussed the status of the Court as one of the principal organs of the United Nations15. The Court has on many occasions recognized that its advisory opinions “represent its participation in the activities of the Organization”. When asked by the General Assembly to provide an advisory opinion, the Court should give an opinion that would indeed be useful for the Assembly. For these reasons, we respectfully submit that the Court, when giving an advisory opinion in this case, should be guided by the principles of the peace process and should actively seek to give an opinion that would contribute to their implementation."
    },
    {
        "voto": 1,
        "juez": "",
        "pregunta": "All States are under an obligation not to recognize the illegal situation resulting from the construction of the wall and not to render aid or assistance in maintaining the situation created by such construction; all States parties to the Fourth Geneva Convention relative to the Protection of Civilian Persons in Time of War of 12 August 1949 have in addition the obligation, while respecting the United Nations Charter and international law, to ensure compliance by Israel with international humanitarian law as embodied in that Convention",
        "texto": "Mr President, a lot has already been said in this hall on the numerous violations of international law by Israel. Russia supports the assessments given in the General Assembly resolution 77/247 and the respective reports of the Secretary-General. We also support relevant resolutions of the Human Rights Council based on the reports of its Special Rapporteurs. In today’s statement, let me focus on two of the most important aspects.\n\nThe first one is the persistent denial by Israel of the right of Palestinians to self-determination. The right to self-determination through the establishment of an independent Palestinian State has been at the heart of efforts of the international community. This right has been recognized by the General Assembly, the Security Council and by this Court.\n\nIt is worth recalling that the principle of self-determination of peoples is one of the foundations of the United Nations, mentioned in the very first Article of its Charter. Every State has the duty to refrain from any forcible action which deprives peoples of their right to self-determination. Meanwhile, as recognized by the General Assembly, the protracted Israeli occupation prevents the Palestinians from implementing that right.\n\n“An end to the Israeli occupation” has been identified as a goal for the international community by legally binding resolutions of the Security Council, including resolution 2334. Israel is accordingly under an obligation to cease its violations of international law and to allow the Palestinian people to establish an independent State. This necessarily means that the occupation must come to an end.\n\nIsrael and Palestine are under an obligation to conduct, in good faith and without delay, negotiations aimed at reaching a final status agreement. All States and international organizations are under an obligation to contribute to creating conditions for such negotiations. The agreement thus reached shall result in the implementation by the Palestinian people of its right to self-determination and emergence of an independent, viable and contiguous Palestinian State with East Jerusalem as its capital. This will bring an end to the ongoing violations of human rights of Palestinians and to the Israeli occupation."
    }
]


