[
    {
        "voto": 1,
        "juez": "Saudi Arabia",
        "pregunta": "Finds that it has jurisdiction to give the advisory opinion requested",
        "texto": "This brings me to the next part of my statement. The Kingdom of Saudi Arabia submits that the Court has jurisdiction to issue the opinion and there are no compelling reasons for it not to do so24. To the contrary, given the recent increase in bloodshed and destruction by Israel in the Occupied Palestinian Territory, as well as the dangerous statements made at the highest levels of the Israeli Government25, we respectfully submit that the Court is under a duty to issue its opinion. /n/nI will now discuss the arguments advanced by some States that the Court should not issue the opinion for two primary reasons. First, because the opinion might prejudice a negotiation process aimed at resolving the Israeli-Palestinian conflict, which those States consider to be ongoing26. And second, because the questions posed concern a bilateral dispute between Israel and Palestine. Not only are those arguments misguided, but they have been repeatedly rejected by this esteemed Court under highly analogous circumstances, including in the Wall Advisory Opinion27. /n/nMr President, Members of the Court, the second argument raised by certain States is that the Court should refrain from rendering the requested opinion because it relates to a strictly bilateral matter between Israel and Palestine47. This argument has been rejected by the Court in several prior contexts, including in the Wall Advisory Opinion48, and should, we believe, be disposed of by the Court in the same manner in this case. /n/nNot only is the argument legally unfounded49, but the fact that the questions posed to the Court are of a multilateral nature is self-evident. As explained in the Kingdom’s Written Statement, the legal questions are located in a broader context, involve erga omnes obligations and jus cogens norms, and ask about the consequences of Israel’s policies and practices on all States as well as the United Nations50. /n/nTo conclude on the question of the Court’s jurisdiction, I leave you with one thought that the Kingdom also voiced in the context of the Wall Advisory Opinion51. If this Court, the principal judicial organ of the United Nations, should not consider the critical questions put before it, then we cannot but conclude that the system to maintain international peace and security set up following the atrocities of World War II has not stood the test of time. /n/nFor those reasons, we respectfully ask the Court to expressly declare that Israel’s occupation of the Palestinian territories is illegal."
    },
    {
        "voto": 1,
        "juez": "Saudi Arabia",
        "pregunta": "Decides to comply with the request for an advisory opinion",
        "texto": "The Kingdom regards the first argument as being based on a blatantly false premise and devoid of any legal foundation. Its lack of legal credibility has been addressed by the League of Arab States in its October 2023 Comments28. In the interest of time I would respectfully direct the Court’s attention to those comments, which we fully endorse. Simply put, the Court’s prior practice should prevail in this instance. The practice gives deference to the General Assembly when requesting guidance from the Court on an issue the Assembly considers relevant to its work."
    },
    {
        "voto": 1,
        "juez": "Saudi Arabia",
        "pregunta":"The construction of the wall being built by Israel, the occupying Power, in the Occupied Palestinian Territory, including in and around East Jerusalem, and its associated régime, are contrary to international law",
        "texto": "Israel defends this obscene brutality as the necessary price for defeating Hamas. The Kingdom of Saudi Arabia firmly rejects this twisted logic. Israel’s actions in laying waste to the Gaza Strip, killing and maiming tens of thousands of innocent civilians, depriving them of food, water and the basic means of survival while displacing virtually the entire population of 2.3 million people are not justified under any circumstances. Israel’s actions have severely dehumanized the Palestinian population, treating them as dispensable objects rather than human beings. These disgraceful acts, which have brought about formal accusation before this esteemed Court that Israel is committing genocide against the Palestinian population, as well as an Order on provisional measures recognizing the plausibility of those accusations and ordering Israel to comply with its obligations under the Genocide Convention23, necessarily weigh heavily upon the consideration of the questions before the Court in this proceeding. For if nothing else, they demonstrate all too vividly how the illegality of the Israeli occupation over more than five decades can degenerate into the ugliest of consequences. /n/nThe only logical conclusion that can be drawn from all of this is that Israel’s policies and practices in the Occupied Palestinian Territory are legally indefensible. /n/nIn the 2004 Wall proceedings, the Kingdom of Saudi Arabia described Israel’s modus operandi in the Occupied Palestinian Territory since 1967 as “deliberately enhance[ing] its position and chang[ing] the territorial status quo to its benefit”29. The Court rightly recognized this reality in its Advisory Opinion, referring to the illegality of Israel’s settlement practice in the Occupied Palestinian Territory30. The Court also warned “the construction of the wall and its associated régime create a ‘fait accompli’ on the ground that could well become permanent, in which case . . . it would be tantamount to de facto annexation”31. This assessment was prescient, and tragically — but predictably — resulted in no change in Israel’s illegal conduct. Nowhere is this seen more clearly than in the number of illegal settlers residing in the Occupied Palestinian Territory, which has grown from roughly 424,000 in 200432 to some 700,000 settlers today33. /n/nSince 1967, far from engaging in negotiations, Israel has made it virtually impossible to establish a cohesive Palestinian State. It has done so by annexing more than 2 million dunams of land34, building more than 279 illegal settlements throughout the West Bank35, illegally annexing East Jerusalem and declaring Jerusalem as its undivided capital36, confiscating natural resources37, demolishing Palestinian homes38, and much more. Those actions are well documented in the many United Nations reports discussed in the Kingdom’s Written Statement and I will not dwell on them further, except to make the self-evident point that Israel’s actions have clearly aimed at frustrating a negotiated settlement rather than opening the door to such a settlement39. /n/nWe submit that the catastrophic consequences of Israel’s policies and practices on the ground, as well as their sheer illegality, are undeniable. The international community has seen stark evidence of these consequences during the current war in Gaza. The ongoing situation is so appalling that last December the United Nations General Assembly overwhelmingly passed a resolution demanding an immediate humanitarian ceasefire in Gaza54, while the Court has recognized the plausibility that Israel’s conduct amounts to genocide and ordered it to comply with a series of provisional measures55. /n/nMoreover, Israel has continued implementing its infamous settlement practice in the Occupied Palestinian Territory despite the repeated condemnation of this practice by the Security Council and this Court’s determination of their illegality in the Wall Advisory Opinion58. Yet Israel makes no secret of its intention to maintain and expand settlements, as well as its possession of all or part of the Occupied Palestinian Territory, in violation of the Fourth Geneva Convention and the prohibition on the acquisition of territory by the use of force. /n/nIsrael’s 2018 Basic Law also shows Israel’s disdain for the Palestinian people’s right to self-determination by declaring the Holy City of Jerusalem “complete and united” as Israel’s capital. Stipulating that “[t]he exercise of the right to national self-determination in the State of Israel is unique to the Jewish People” is also incompatible with the Palestinian people’s right to self-determination in the Occupied Palestinian Territory, including East Jerusalem59. /n/nMr President, Members of the Court, the Kingdom of Saudi Arabia wishes to emphasize that international law obligations, particularly those embodied in the peremptory norms of general international law, are not abstract rules, and are not intended to be. Their violations entail particular legal consequences, but also have real and tangible consequences. The latter include most prominently the denial to human beings of their right to life and dignity, and more widely the creation of threats to peace and stability, with unpredictable consequences. The multiple and grave violations by Israel of its international obligations in the Occupied Palestinian Territory is therefore of undeniable concern not only to those directly affected, but also to the international community as a whole61. /n/nTo be clear, Israel’s occupation was, from its commencement in June 1967, an illegal use of force, and it continues to be so. The Kingdom noted this in its submission in the Wall Advisory Opinion62. The illegal nature of the 56-year occupation has only been aggravated by Israel’s numerous other international law violations, including of jus cogens norms. Given the illegality surrounding every aspect of Israel’s occupation, that occupation is simply indefensible as a matter of international law."
    },
    {
        "voto": 1,
        "juez": "Saudi Arabia",
        "pregunta": "Israel is under an obligation to terminate its breaches of international law; it is under an obligation to cease forthwith the works of construction of the wall being built in the Occupied Palestinian Territory, including in and around East Jerusalem, to dismantle forthwith the structure therein situated, and to repeal or render ineffective forthwith all legislative and regulatory acts relating thereto, in accordance with paragraph 151 of this Opinion",
        "texto": "The reality today has become more discouraging. At the senior levels of the Israeli Government, calls are openly made to forcibly transfer, or ethnically cleanse, Palestinians out of their homeland42, expand settlements even further43, annex further areas of the West Bank44, and at all costs to reject the notion of establishing a Palestinian State along the lines of the two-State solution45. And while the brutal and genocidal onslaught of Gaza by the Israeli military since October 2023 has led it to become, in the words of the United Nations Under-Secretary-General for Humanitarian Affairs, a “place of death and despair”46, it should not be forgotten that Israel’s aggression has been accompanied by unyielding statements by its leaders that it will never agree to a sovereign Palestinian State or cede control over the Occupied Palestinian Territory. Such statements hardly reflect Israel’s intention to engage in genuine peace negotiations. /n/nHowever, as we speak, Israel continues to defy the international community’s call for a ceasefire and to wilfully ignore the provisional measures ordered by the Court. More generally, Israel has over the decades of its occupation persisted in its egregious violations of its most fundamental international law obligations. As explained in our Written Statement, Israel is in continuous breach of several jus cogens norms, notwithstanding multiple Security Council and General Assembly resolutions condemning its conduct and this Court’s findings in the Wall Advisory Opinion56. /n/nThese violations include Israel taking continuous measures to prevent the Palestinian people from exercising their right of self-determination through various policies and practices, including, among others, the illegal settlement practice in the Occupied Palestinian Territory, the expulsion of Palestinians from their homes and theft of Palestinian property, the denial of sovereignty over their natural resources, and the breach of their civil, political, economic, social and cultural rights57. /n/nBut Israel’s breaches of international law do not end there. There can be no serious debate that Israeli policies and practices also amount to racial discrimination and are tantamount to apartheid, in grave violation of the Palestinian people’s human rights. Israel’s seizure of land and resources for Israeli settlers and its discriminatory application of laws and regulations to the detriment of the Palestinian people are merely examples of this egregious conduct. Israel violates the human rights of the Palestinian people in multiple other ways and in breach of its conventional obligations, including the rights of women and children. /n/nI will now move on to the second question before the Court, regarding the manner in which Israel’s conduct affects the legal status of its occupation. The Kingdom respectfully submits that the only conclusion which may be reached from the multiple and grave breaches of international law emanating from its occupation is that Israel’s occupation itself is illegal and must be brought to an unconditional end. Any other conclusion would be anomalous and inconsistent with the clearly illegal origin and conduct of the occupation, including the violations of jus cogens norms, that Israel has and continues to engage in through its occupation."
    },
    {
        "voto": 1,
        "juez": "Saudi Arabia",
        "pregunta": "Israel is under an obligation to make reparation for al1 damage caused by the construction of the wall in the Occupied Palestinian Territory,including in and around East Jerusalem",
        "texto": "The Court is also asked to address the legal consequences of Israel’s breaches. I will address these briefly. The Kingdom of Saudi Arabia and numerous other States have laid out in their written statements the legal obligations which flow from Israel’s breaches63. Pursuant to Article 30 of the Articles on State Responsibility64, and as explained by this Court in the Wall Advisory Opinion, Israel must cease its wrongful conduct, resume compliance with its obligations and offer appropriate assurances and guarantees of non-repetition65. Articles 31 and 36 also require that Israel makes full reparation for the damage caused over the decades of its illegal occupation66."
    },
    {
        "voto": 1,
        "juez": "Saudi Arabia",
        "pregunta": "All States are under an obligation not to recognize the illegal situation resulting from the construction of the wall and not to render aid or assistance in maintaining the situation created by such construction; all States parties to the Fourth Geneva Convention relative to the Protection of Civilian Persons in Time of War of 12 August 1949 have in addition the obligation, while respecting the United Nations Charter and international law, to ensure compliance by Israel with international humanitarian law as embodied in that Convention",
        "texto": "The international community has spoken on these issues on many occasions through the United Nations principal bodies, demanding that Israel completely ceases all settlement activities, revokes its annexation of East Jerusalem and complies with its international obligations in other respects. The list of resolutions is long. We have addressed many of them in our Written Statement60. Israel continues to ignore them. /n/nAs for all other States, Israel’s breach of jus cogens norms entails that the international community has an obligation not to recognize that illegal conduct. All States must also co-operate to bring Israel’s violations of international law to an end, and make sure that they do not render aid or assistance in furtherance of Israel’s breaches."
    },
    {
        "voto": 1,
        "juez": "Saudi Arabia",
        "pregunta": "The United Nations, and especially the General Assembly and the Security Council, should consider what further action is required to bring to an end the illegal situation resulting from the construction of the wall and the associated régime, taking due account of the present Advisory Opinion",
        "texto": "The consequences for the United Nations are clear. All United Nations organs must, within their competences, take steps to bring Israel’s violations to an end, and they must also refrain from recognizing those violations or giving aid or assistance to maintain the illegal situation. Finally, they must also require the unconditional and immediate end to the occupation itself."
    }
]