[
    {
        "voto": 1,
        "juez": "Zambia",
        "pregunta": "Finds that it has jurisdiction to give the advisory opinion requested",
        "texto": "Mr President, we have carefully looked at the question that has been posed to the Court and we submit at the very outset that the Republic of Zambia recognizes the Court’s jurisdiction to render advisory opinions in accordance with Article 65 of the Statute, as it did in the Advisory Opinion on the Legal Consequences of the Construction of a Wall in the Occupied Palestinian Territory in 2004. /n/nMr President, Members of the Court, as we conclude we wish to submit that the Court is neither the only dispute resolution mechanism available, nor is it the best in all circumstances. The best dispute resolution mechanism is one that delivers optimal and sustainable solutions depending on the peculiar circumstances of each case and there is certainly no “one size fits all”. /n/nWhere, for instance, the objective of the dispute resolution mechanism is to blame one party or the other, or to solely determine a winner or a loser, then we have no doubt that the Court is the best forum."
    },
    {
        "voto": 1,
        "juez": "Zambia",
        "pregunta": "Decides to comply with the request for an advisory opinion",
        "texto": "We, however, make the case that the question posed to the Court this time around is more complex and requires “Solomonic wisdom” to obviate rendering an opinion that may exacerbate rather than resolve the complex and nuanced situation which both Palestine and Israel find themselves in. /n/nMr President, Members of the Court, this Court did pronounce itself on the importance of continued negotiations in its Advisory Opinion of 2004 on the Legal Consequences of the Construction of a Wall in the Occupied Palestinian Territory. The Court encouraged efforts to achieve a negotiated solution to the conflict and the establishment of a Palestinian State, existing side by side with Israel for peace and security for all in the region. This Court, while noting that illegal actions and unilateral decisions were taken on both sides, confirmed the continued validity of the legal framework by stipulating that this situation can be ended only through implementation of the agreements in good faith. /n/nMr President, those of us that have practised law for many years know how, in determining a winner and a loser, the Court’s decisions have, in almost all cases, left permanently ruined relationships between neighbours on a difference which could have been resolved in a better way by adopting alternative dispute mechanisms such as a negotiated settlement, conciliation or mediation. /n/nWe conclude in the alternative, that should the Court decide to exercise its jurisdiction to render the sought advisory opinion — which, as we said, it has the jurisdiction — then the opinion should encourage and assist the parties to respect the legal commitments, including conducting credible negotiations and not make it more difficult for them to do so. This is also anchored on the fundamental international legal principle of pacta sunt servanda. In this way, Your Lordship, the Court would essentially be upholding the sovereign rights of the two parties."
    },
    {
        "voto": 1,
        "juez": "Zambia",
        "pregunta": "Israel is under an obligation to terminate its breaches of international law; it is under an obligation to cease forthwith the works of construction of the wall being built in the Occupied Palestinian Territory, including in and around East Jerusalem, to dismantle forthwith the structure therein situated, and to repeal or render ineffective forthwith all legislative and regulatory acts relating thereto, in accordance with paragraph 151 of this Opinion",
        "texto": "The same especially goes for the policies and practices of Israel in Jerusalem and the holy places. Any Israeli act and measure aimed at altering the character and status of the City of Jerusalem, and of the holy places, including Haram Al-Sharif, should be considered null and void and must be ended and rescinded immediately. /n/nThe Republic of Türkiye reiterates its firm support to a negotiated two-State solution based on the United Nations resolutions, thus the establishment of an independent, sovereign and contiguous State of Palestine on the pre-5 June 1967 lines, with East Jerusalem as its capital /n/nIn conclusion, therefore, the Republic of Zambia reiterates the call for relentless efforts aimed at achieving peace in the Middle East based on the principles of a two-State solution. Both Israel and Palestine have a duty to respect international human rights law and international humanitarian law. Therefore, any recourse to the conflict should not be one that puts the blame squarely on one party but rather one that advances a negotiated solution which culminates in a two-State solution. The Republic of Zambia surmises that the Court should not exercise its jurisdiction under Article 65 of the Statute, but rather give deference and sanctity to the bilateral agreements existing between the two States and indeed give deference to the doctrine of party autonomy and pacta sunt servanda."
    },
    {
        "voto": 1,
        "juez": "Zambia",
        "pregunta": "All States are under an obligation not to recognize the illegal situation resulting from the construction of the wall and not to render aid or assistance in maintaining the situation created by such construction; all States parties to the Fourth Geneva Convention relative to the Protection of Civilian Persons in Time of War of 12 August 1949 have in addition the obligation, while respecting the United Nations Charter and international law, to ensure compliance by Israel with international humanitarian law as embodied in that Convention",
        "texto": "The parties have an obligation under Article XXXI (7) of the 1995 Palestinian Interim Agreement on the West Bank and the Gaza Strip (Oslo II Accord) not to “initiate or take any step that will change the status of the West Bank and the Gaza Strip pending the outcome of the permanent status negotiations”."
    },
    {
        "voto": 1,
        "juez": "Zambia",
        "pregunta": "The United Nations, and especially the General Assembly and the Security Council, should consider what further action is required to bring to an end the illegal situation resulting from the construction of the wall and the associated régime, taking due account of the present Advisory Opinion",
        "texto": "Mr President, Members of the Court, there is an argument that negotiations have proved to be ineffective in the past and, therefore, the resort to advisory opinions. The Republic of Zambia respectfully submits that the Israelis, the Palestinians, regional States and the broader international community, and indeed the United Nations Security Council should consider the reasons why the negotiations failed in the first place, and address that issue before resorting to a solution that seeks to bypass the agreed-upon negotiations."
    }
]