[
  {
    "pregunta": "Israel is under an obligation to terminate its breaches of international law; it is under an obligation to cease forthwith the works of construction of the wall being built in the Occupied Palestinian Territory, including in and around East Jerusalem, to dismantle forthwith the structure therein situated, and to repeal or render ineffective forthwith all legislative and regulatory acts relating thereto, in accordance with paragraph 151 of this Opinion",
    "texto": "Question: Israel is under an obligation to terminate its breaches of international law; it is under an obligation to cease forthwith the works of construction of the wall being built in the Occupied Palestinian Territory, including in and around East Jerusalem, to dismantle forthwith the structure therein situated, and to repeal or render ineffective forthwith all legislative and regulatory acts relating thereto, in accordance with paragraph 151 of this Opinion.\n\n149. The Court notes that Israel is first obliged to comply with the international obligations it has breached by the construction of the wall in the Occupied Palestinian Territory (see paragraphs 114-137 above). Consequently, Israel is bound to comply with its obligation to respect the right of the Palestinian people to self-determination and its obligations under international humanitarian law and international human rights law. Furthermore, it must ensure freedom of access to the Holy Places that came under its control following the 1967 War (see paragraph 129 above).\n\n150. The Court observes that Israel also has an obligation to put an end to the violation of its international obligations flowing from the construction of the wall in the Occupied Palestinian Territory. The obligation of a State responsible for an internationally wrongful act to put an end to that act is well established in general international law, and the Court has on a number of occasions confirmed the existence of that obligation (Military and Paramilitary Activities in and against Nicaragua (Nicaragua v. United States of America), Merits, Judgment, I.C.J. Reports 1986, p. 149; United States Diplomatic and Consular Staff in Tehran, Judgment, I.C.J. Reports 1980, p. 44, para. 95; Haya de la Torre, Judgment, I.C.J. Reports 1951, p. 82).\n\n151. Israel accordingly has the obligation to cease forthwith the works of construction of the wall being built by it in the Occupied Palestinian Territory, including in and around East Jerusalem. Moreover, in view of the Court's finding (see paragraph 143 above) that Israel's violations of its international obligations stem from the construction of the wall and from its associated régime, cessation of those violations entails the dismantling forthwith of those parts of that structure situated within the Occupied Palestinian Territory, including in and around East Jerusalem. All legislative and regulatory acts adopted with a view to its construction, and to the establishment of its associated régime, must forthwith be repealed or rendered ineffective, except in so far as such acts, by providing for compensation or other forms of reparation for the Palestinian population, may continue to be relevant for compliance by Israel with the obligations referred to in paragraph 153 below.\n\n152. Moreover, given that the construction of the wall in the Occupied Palestinian Territory has, inter alia, entailed the requisition and destruction of homes, businesses and agricultural holdings, the Court finds further that Israel has the obligation to make reparation for the damage caused to all the natural or legal persons concerned. The Court would recall that the essential forms of reparation in customary law were laid down by the Permanent Court of International Justice in the following terms:\n\n\"The essential principle contained in the actual notion of an illegal act a principle which seems to be established by international practice and in particular by the decisions of arbitral tribunals — is that reparation must, as far as possible, wipe out all the consequences of the illegal act and reestablish the situation which would, in all probability, have existed if that act had not been committed. Restitution in kind, or, if this is not possible, payment of a sum corresponding to the value which a restitution in kind would bear; the award, if need be, of damages for loss sustained which would not be covered by restitution in kind or payment in place of it such are the principles which should serve to determine the amount of compensation due for an act contrary to international law.\" (Factory at Chorzów, Merits, Judgment No. 13, 1928, P.C.I.J., Series A, No. 17, p. 47.)\n\n153. Israel is accordingly under an obligation to return the land, orchards, olive groves and other immovable property seized from any natural or legal person for purposes of construction of the wall in the Occupied Palestinian Territory. In the event that such restitution should prove to be materially impossible, Israel has an obligation to compensate the persons in question for the damage suffered. The Court considers that Israel also has an obligation to compensate, in accordance with the applicable rules of international law, all natural or legal persons having suffered any form of material damage as a result of the wall's construction.\n\n154. The Court will now consider the legal consequences of the internationally wrongful acts flowing from Israel's construction of the wall as regards other States.\n\n"
  },
  {
    "voto": 1,
    "juez": "Higgins",
    "pregunta": "All States are under an obligation not to recognize the illegal situation resulting from the construction of the wall and not to render aid or assistance in maintaining the situation created by such construction; all States parties to the Fourth Geneva Convention relative to the Protection of Civilian Persons in Time of War of 12 August 1949 have in addition the obligation, while respecting the United Nations Charter and international law, to ensure compliance by Israel with international humanitarian law as embodied in that Convention",
    "texto": "Question: All States are under an obligation not to recognize the illegal situation resulting from the construction of the wall and not to render aid or assistance in maintaining the situation created by such construction; all States parties to the Fourth Geneva Convention relative to the Protection of Civilian Persons in Time of War of 12 August 1949 have in addition the obligation, while respecting the United Nations Charter and international law, to ensure compliance by Israel with international humanitarian law as embodied in that Convention. \n\n149. The Court notes that Israel is first obliged to comply with the international obligations it has breached by the construction of the wall in the Occupied Palestinian Territory (see paragraphs 114-137 above). Consequently, Israel is bound to comply with its obligation to respect the right of the Palestinian people to self-determination and its obligations under international humanitarian law and international human rights law. Furthermore, it must ensure freedom of access to the Holy Places that came under its control following the 1967 War (see paragraph 129 above).\n\n150. The Court observes that Israel also has an obligation to put an end to the violation of its international obligations flowing from the construction of the wall in the Occupied Palestinian Territory. The obligation of a State responsible for an internationally wrongful act to put an end to that act is well established in general international law, and the Court has on a number of occasions confirmed the existence of that obligation (Military and Paramilitary Activities in and against Nicaragua (Nicaragua v. United States of America), Merits, Judgment, I.C.J. Reports 1986, p. 149; United States Diplomatic and Consular Staff in Tehran, Judgment, I.C.J. Reports 1980, p. 44, para. 95; Haya de la Torre, Judgment, I.C.J. Reports 1951, p. 82).\n\n151. Israel accordingly has the obligation to cease forthwith the works of construction of the wall being built by it in the Occupied Palestinian Territory, including in and around East Jerusalem. Moreover, in view of the Court's finding (see paragraph 143 above) that Israel's violations of its international obligations stem from the construction of the wall and from its associated régime, cessation of those violations entails the dismantling forthwith of those parts of that structure situated within the Occupied Palestinian Territory, including in and around East Jerusalem. All legislative and regulatory acts adopted with a view to its construction, and to the establishment of its associated régime, must forthwith be repealed or rendered ineffective, except in so far as such acts, by providing for compensation or other forms of reparation for the Palestinian population, may continue to be relevant for compliance by Israel with the obligations referred to in paragraph 153 below.\n\n152. Moreover, given that the construction of the wall in the Occupied Palestinian Territory has, inter alia, entailed the requisition and destruction of homes, businesses and agricultural holdings, the Court finds further that Israel has the obligation to make reparation for the damage caused to all the natural or legal persons concerned. The Court would recall that the essential forms of reparation in customary law were laid down by the Permanent Court of International Justice in the following terms:\n\n\"The essential principle contained in the actual notion of an illegal act a principle which seems to be established by international practice and in particular by the decisions of arbitral tribunals — is that reparation must, as far as possible, wipe out all the consequences of the illegal act and reestablish the situation which would, in all probability, have existed if that act had not been committed. Restitution in kind, or, if this is not possible, payment of a sum corresponding to the value which a restitution in kind would bear; the award, if need be, of damages for loss sustained which would not be covered by restitution in kind or payment in place of it such are the principles which should serve to determine the amount of compensation due for an act contrary to international law.\"(Factory at Chorzów, Merits, Judgment No. 13, 1928, P.C.I.J., Series A, No. 17, p. 47.)\n\n153. Israel is accordingly under an obligation to return the land, orchards, olive groves and other immovable property seized from any natural or legal person for purposes of construction of the wall in the Occupied Palestinian Territory. In the event that such restitution should prove to be materially impossible, Israel has an obligation to compensate the persons in question for the damage suffered. The Court considers that Israel also has an obligation to compensate, in accordance with the applicable rules of international law, all natural or legal persons having suffered any form of material damage as a result of the wall's construction.\n\n154. The Court will now consider the legal consequences of the internationally wrongful acts flowing from Israel's construction of the wall as regards other States.
    \n\nSEPARATE OPINION OF JUDGE HIGGINS 
    \n\n36. The latter part of the dispositif deals with the legal consequences of the findings made by the Court. 
    \n\n37. I have voted in favour of subparagraph (3) (D) of the dispositif but, unlike the Court, i do not think that the specified consequence of the identified violations of international law have anything to do with the concept of ergu omnes (cf. paras. 154-159 of this Opinion). The Court's celebrated dictum in Barcelona Traction, Light and Power Company, Limited, Second Phase (Judgment, I. C.J. Reports 1970, p. 32, para. 33) is frequently invoked for more than it can bear. Regrettably, this is now done also in this Opinion, at paragraph 155. That dictum was directed to a very specific issue of jurisdictional locus standi. As the International Law Commission has correctly put it in the Commentaries to the draft Articles on the Responsibility of States for Internationally Wrongful Acts (Al56110 at p. 278), there are certain rights in which, by reason of their importance all states have a legal interest in their protection. It has nothing to do with imposing substantive obligations on third parties to a case. 
    \n\n38. That an illegal situation is not to be recognized or assisted by third parties is self-evident, requiring no invocation of the uncertain concept of ergu onznes. It follows from a finding of an unlawful situation by the Security Council, in accordance with Articles 24 and 25 of the Charter entails decisions that are consequently binding on all States Members of the United Nations, which are thus under obligation to accept and carry them out (Legal Consequences for States of the Continued Presence of South Africa in Namibia (South West Africa) notwithstanding Security Council Resolution 276 (19701, Advisory Opinion, I. C. J. Reports 1971, p. 53, para. 115). The obligation upon United Nations Members not to recognize South Africa's illegal presence in Namibia, and not to lend support or assistance, relied in no way whatever on erga omnes. Rather, the Court emphasized that A binding determination made by a competent organ of the United Nations to the effect that a situation is illegal cannot remain without consequence. (Ibid, para. 117.) The Court had already found in a contentious case that its determination of an illegal act entails a legal consequence, namely that of putting an end to an illegal situation (Haya de la Torre, Judgment, I.C.J. Reports 1951, p. 82). Although in the present case it is the Court, rather than a United Nations organ acting under Articles 24 and 25, that has found the illegality; and although it is found in the context of an advisory opinion rather than in a contentious case, the Court's position as the principal judicial organ of the United Nations suggests that the legal consequence for a finding that an act or situation is illegal is the same. The obligation upon United Nations Members of non-recognition and non-assistance does not rest on the notion of erga omnes. 
    \n\n39. Finally, the invocation (para. 157) of the erga omnes nature of violations of humanitarian law seems equally irrelevant. These intransgressible principles are generally binding because they are customary international law, no more and no less. And the first Article to the Fourth Geneva Convention, under which The High Contracting Parties undertake to respect and to ensure respect for the present Convention in all circumstances while apparently viewed by the Court as something to do with the erga ommes principle, is simply a provision in an almost universally ratified multilateral Convention. The Final Record of the diplomatic conference of Geneva of 1949 offers no useful explanation of that provision; the commentary thereto interprets the phrase ensure respect as going beyond legislative and other action within a State's own territory. It observes that in the event of a Power failing to fulfil its obligations, the other Contracting Parties (neutral, allied or enemy) may, and should, endeavour to bring it back to an attitude of respect for the Convention. The proper working of the system of protection provided by the Convention demands in fact that the Contracting Parties should not be content merely to apply its provisions themselves, but should do everything in their power to ensure that the humanitarian principles underlying the Conventions are applied universally. (The Geneva Conventions of 12 August 1949: Commentary, IV Geneva Convention relative to the protection of civilian persons in time of war, Pictet, ed., p. 16.)\n\nIt will be noted that the Court has, in subparagraph (3) (D) of the dis- positif; carefully indicated that any such action should be in conformity with the Charter and international law. 
    \n\n40. In conclusion, i would add that, although there has indeed been much information provided to the Court in this case, that provided directly by Israel has only been very partial. The Court has based itself largely on the Secretary-General's report from 14 April2002 to 20 November 2003 and on the later Written Statement of the United Nations (see para. 79). It is not clear whether it has availed itself of other data in the public domain. Useful information is in fact contained in such documents as the Third Report of the current Special Rapporteur and Israel's Reply thereto (E/CN.4/2004/6/Add.1), as well as in The Impact of Israel's Separation Barrier on Affected West Bank Communities: An Update to the Humanitarian and Emergency Policy Group (HEPG), Constructionof the Barrier, Access, and Its Humanitarian Impact, March 2004. In any event, the Court's findings of law are notably general in character, saying remarkably little as concerns the application of specific provisions of the Hague Rules or the Fourth Geneva Convention along particular sections of the route of the wall. i have nonetheless voted in favour of subparagraph (3) (A) of the dispositif because there is undoubtedly a significant negative impact upon portions of the population of the West Bank that cannot be excused on the grounds of military necessity allowed by those Conventions; and nor has Israel explained to the United Nations or to this Court why its legitimate security needs can be met only by the route selected." 
  },
  {
    "pregunta": "The United Nations, and especially the General Assembly and the Security Council, should consider what further action is required to bring to an end the illegal situation resulting from the construction of the wall and the associated régime, taking due account of the present Advisory Opinion",
    "texto": "Question: The United Nations, and especially the General Assembly and the Security Council, should consider what further action is required to bring to an end the illegal situation resulting from the construction of the wall and the associated régime, taking due account of the present Advisory Opinion. /n/n160. Finally, the Court is of the view that the United Nations, and especially the General Assembly and the Security Council, should consider what further action is required to bring to an end the illegal situation resulting from the construction of the wall and the associated régime, taking due account of the present Advisory Opinion.\n\n"
  },
  {
    "pregunta": "The construction of the wall being built by Israel, the occupying Power, in the Occupied Palestinian Territory, including in and around East Jerusalem, and its associated régime, are contrary to international law",
    "texto": "Question: The construction of the wall being built by Israel, the occupying Power, in the Occupied Palestinian Territory, including in and around East Jerusalem, and its associated régime, are contrary to international law.\n\n66. The Court will now address the question put to it by the General Assembly in resolution ES-10/14. The Court recalls that the question is as follows:\n\n\"What are the legal consequences arising from the construction of the wall being built by Israel, the occupying Power, in the Occupied Palestinian Territory, including in and around East Jerusalem, as described in the report of the Secretary-General, considering the rules and principles of international law, including the Fourth Geneva Convention of 1949, and relevant Security Council and General Assembly resolutions?\"\n\n67. As explained in paragraph 82 below, the \"wall\" in question is a complex construction, so that that term cannot be understood in a limited physical sense. However, the other terms used, either by Israel (\"fence\") or by the Secretary-General (\"barrier\"), are no more accurate if understood in the physical sense. In this Opinion, the Court has therefore chosen to use the terminology employed by the General Assembly.\n\nThe Court notes furthermore that the request of the General Assembly concerns the legal consequences of the wall being built \"in the Occupied Palestinian Territory, including in and around East Jerusalem\". As also explained below (see paragraphs 79-84 below), some parts of the complex are being built, or are planned to be built, on the territory of Israel itself; the Court does not consider that it is called upon to examine the legal consequences arising from the construction of those parts of the wall.\n\n68. The question put by the General Assembly concerns the legal consequences of the construction of the wall in the Occupied Palestinian Territory. However, in order to indicate those consequences to the General Assembly the Court must first determine whether or not the construction of that wall breaches international law (see paragraph 39 above). It will therefore make this determination before dealing with the consequences of the construction.\n\n69. To do so, the Court will first make a brief analysis of the status of the territory concerned, and will then describe the works already constructed or in course of construction in that territory. It will then indicate the applicable law before seeking to establish whether that law has been breached.\n\n70. Palestine was part of the Ottoman Empire. At the end of the First World War, a class \"A\" Mandate for Palestine was entrusted to Great Britain by the League of Nations, pursuant to paragraph 4 of Article 22 of the Covenant, which provided that:\n\n\"Certain communities, formerly belonging to the Turkish Empire have reached a stage of development where their existence as independent nations can be provisionally recognized subject to the rendering of administrative advice and assistance by a Mandatory until such time as they are able to stand alone.\"\n\nThe Court recalls that in its Advisory Opinion on the International Status of South West Africa, speaking of mandates in general, it observed that \"The Mandate was created, in the interest of the inhabitants of the territory, and of humanity in general, as an international institution with an international object - a sacred trust of civilization.\" (I.C.J. Reports 1950, p. 132.) The Court also held in this regard that \"two principles were considered to be of paramount importance: the principle of non-annexation and the principle that the well-being and development of ... peoples [not yet able to govern themselves] formed a sacred trust of civilization\" (ibid., p. 131).\n\nThe territorial boundaries of the Mandate for Palestine were laid down by various instruments, in particular on the eastern border by a British memorandum of 16 September 1922 and an Anglo-Transjordanian Treaty of 20 February 1928.\n\n71. In 1947 the United Kingdom announced its intention to complete evacuation of the mandated territory by 1 August 1948, subsequently advancing that date to 15 May 1948. In the meantime, the General Assembly had on 29 November 1947 adopted resolution 181 (Il) on the future government of Palestine, which \"Recommends to the United Kingdom ... and to all other Members of the United Nations the adoption and implementation ... of the Plan of Partition\" of the territory, as set forth in the resolution, between two independent States, one Arab, the other Jewish, as well as the creation of a special international régime for the City of Jerusalem. The Arab population of Palestine and the Arab States rejected this plan, contending that it was unbalanced; on 14 May 1948, Israel proclaimed its independence on the strength of the General Assembly resolution; armed conflict then broke out between Israel and a number of Arab States and the Plan of Partition was not implemented.\n\n72. By resolution 62 (1948) of 16 November 1948, the Security Council decided that \"an armistice shall be established in all sectors of Palestine\" and called upon the parties directly involved in the conflict to seek agreement to this end. In conformity with this decision, general armistice agreements were concluded in 1949 between Israel and the neighbouring States through mediation by the United Nations. In particular, one such agreement was signed in Rhodes on 3 April 1949 between Israel and Jordan. Articles V and VI of that Agreement fixed the armistice demarcation line between Israeli and Arab forces (often later called the \"Green Line\" owing to the colour used for it on maps; hereinafter the \"Green Line\"). Article III, paragraph 2, provided that \"No element of the ... military or para-military forces of either Party ... shall advance beyond or pass over for any purpose whatsoever the Armistice Demarcation Lines ...\" It was agreed in Article VI paragraph 8, that these provisions would not be \"interpreted as prejudicing, in any sense, an ultimate political settlement between the Parties\". It was also stated that \"the Armistice Demarcation Lines defined in articles V and VI of [the] Agreement [were] agreed upon by the Parties without prejudice to future territorial settlements or boundary lines or to claims of either Party relating thereto\". The Demarcation Line was subject to such rectification as might be agreed upon by the parties.\n\n73. In the 1967 armed conflict, Israeli forces occupied all the territories which had constituted Palestine under British Mandate (including those known as the West Bank, lying to the east of the Green Line).\n\n74. On 22 November 1967, the Security Council unanimously adopted resolution 242 (1967), which emphasized the inadmissibility of acquisition of territory by war and called for the \"Withdrawal of Israel armed forces from territories occupied in the recent conflict\", and \"Termination of all claims or states of belligerency\".\n\n75. From 1967 onwards, Israel took a number of measures in these territories aimed at changing the status of the City of Jerusalem. The Security Council, after recalling on a number of occasions \"the principle that acquisition of territory by military conquest is inadmissible\", condemned those measures and, by resolution 298 (1971) of 25 September 1971, confirmed in the clearest possible terms that:\n\n\"all legislative and administrative actions taken by Israel to change the status of the City of Jerusalem, including expropriation of land and properties, transfer of populations and legislation aimed at the incorporation of the occupied section, are totally invalid and cannot change that status\".\n\nLater, following the adoption by Israel on 30 July 1980 of the Basic Law making Jerusalem the \"complete and united\" capital of Israel, the Security Council, by resolution 478 (1980) of 20 August 1980, stated that the enactment of that Law constituted a violation of international law and that \"all legislative and administrative measures and actions taken by Israel, the occupying Power, which have altered or purport to alter the character and status of the Holy City of Jerusalem ... are null and void\". It further decided \"not to recognize the 'basic law' and such other actions by Israel that, as a result of this law, seek to alter the character and status of Jerusalem\".\n\n76. Subsequently, a peace treaty was signed on 26 October 1994 between Israel and Jordan. That treaty fixed the boundary between the two States \"with reference to the boundary definition under the Mandate as is shown in Annex 1 (a) ... without prejudice to the status of any territories that came under Israeli military government control in 1967\" (Article 3, paragraphs 1 and 2). Annex 1 provided the corresponding maps and added that, with regard to the \"territory that came under Israeli military government control in 1967\", the line indicated \"is the administrative boundary\" with Jordan.\n\n77. Lastly, a number of agreements have been signed since 1993 between Israel and the Palestine Liberation Organization imposing various obligations on each party. Those agreements inter alia required Israel to transfer to Palestinian authorities certain powers and responsibilities exercised in the Occupied Palestinian Territory by its military authorities and civil administration. Such transfers have taken place, but, as a result of subsequent events, they remained partial and limited.\n\n78. The Court would observe that, under customary international law as reflected (see paragraph 89 below) in Article 42 of the Regulations Respecting the Laws and Customs of War on Land annexed to the Fourth Hague Convention of 18 October 1907 (hereinafter \"the Hague Regulations of 1907\"), territory is considered occupied when it is actually placed under the authority of the hostile army, and the occupation extends only to the territory where such authority has been established and can be exercised. The territories situated between the Green Line (see paragraph 72 above) and the former eastern boundary of Palestine under the Mandate were occupied by Israel in 1967 during the armed conflict between Israel and Jordan. Under customary international law, these were therefore occupied territories in which Israel had the status of occupying Power. Subsequent events in these territories, as described in paragraphs 75 to 77 above, have done nothing to alter this situation. All these territories (including East Jerusalem) remain occupied territories and Israel has continued to have the status of occupying Power.\n\n79. It is essentially in these territories that Israel has constructed or plans to construct the works described in the report of the Secretary-General. The Court will now describe those works, basing itself on that report. For developments subsequent to the publication of that report, the Court will refer to complementary information contained in the Written Statement of the United Nations, which was intended by the Secretary-General to supplement his report (hereinafter \"Written Statement of the Secretary-General\").\n\n80. The report of the Secretary-General states that \"The Government of Israel has since 1996 considered plans to halt infiltration into Israel from the central and northern West Bank...\" (para. 4). According to that report, a plan of this type was approved for the first time by the Israeli Cabinet in July 2001. Then, on 14 April 2002, the Cabinet adopted a decision for the construction of works, forming what Israel describes as a \"security fence\", 80 kilometres in length, in three areas of the West Bank.\n\nThe project was taken a stage further when, on 23 June 2002, the Israeli Cabinet approved the first phase of the construction of a \"continuous fence\" in the West Bank (including East Jerusalem). On 14 August 2002, it adopted the line of that \"fence\" for the work in Phase A, with a view to the construction of a complex 123 kilometres long in the northern West Bank, running from the Salem checkpoint (north of Jenin) to the settlement at Elkana. Phase B of the work was approved in December 2002, It entailed a stretch of some 40 kilometres running east from the Salem checkpoint towards Beth Shean along the northern part of the Green Line as far as the Jordan Valley. Furthermore, on 1 October 2003, the Israeli Cabinet approved a full route, which, according to the report of the Secretary-General, \"will form one continuous line stretching 720 kilometres along the West Bank\". A map showing completed and planned sections was posted on the Israeli Ministry of Defence website on 23 October 2003. According to the particulars provided on that map, a continuous section (Phase C) encompassing a number of large settlements will link the north-western end of the \"security fence\" built around Jerusalem with the southern point of Phase A construction at Elkana. According to the same map, the \"security fence\" will run for 115 kilometres from the Har Gilo settlement near Jerusalem to the Carmel settlement south-east of Hebron (Phase D). According to Ministry of Defence documents, work in this sector is due for completion in 2005. Lastly, there are references in the case file to Israel's planned construction of a \"security fence\" following the Jordan Valley along the mountain range to the west.\n\n81. According to the Written Statement of the Secretary-General, the first part of these works (Phase A), which ultimately extends for a distance of 150 kilometres, was declared completed on 31 July 2003. It is reported that approximately 56,000 Palestinians would be encompassed in enclaves. During this phase, two sections totalling 19.5 kilometres were built around Jerusalem. In November 2003 construction of a new section was begun along the Green Line to the west of the Nazlat IssaBaqa al-Sharqiya enclave, which in January 2004 was close to completion at the time when the Secretary-General submitted his Written Statement.\n\nAccording to the Written Statement of the Secretary-General, the works carried out under Phase B were still in progress in January 2004. Thus an initial section of this stretch, which runs near or on the Green Line to the village of al-Mutilla, was almost complete in January 2004. Two additional sections diverge at this point. Construction started in early January 2004 on one section that runs due east as far as the Jordanian border. Construction of the second section, which is planned to run from the Green Line to the village of Taysir, has barely begun. The United Nations has, however, been informed that this second section might not be built.\n\nThe Written Statement of the Secretary-General further states that Phase C of the work, which runs from the terminus of Phase A, near the Elkana settlement, to the village of Nu'man, south-east of Jerusalem, began in December 2003. This section is divided into three stages. In Stage C1, between inter alia the villages of Rantis and Budrus, approximately 4 kilometres out of a planned total of 40 kilometres have been constructed. Stage C2, which will surround the so-called \"Ariel Salient\" by cutting 22 kilometres into the West Bank, will incorporate 52,000 Israeli settlers. Stage C3 is to involve the construction of two \"depth barriers\"; one of these is to run north-south, roughly parallel with the section of Stage C1 currently under construction between Rantis and Budrus, whilst the other runs east-west along a ridge said to be part of the route of Highway 45, a motorway under construction. If construction of the two barriers were completed, two enclaves would be formed, encompassing 72,000 Palestinians in 24 communities.\n\nFurther construction also started in late November 2003 along the south-eastern part of the municipal boundary of Jerusalem, following a route that, according to the Written Statement of the Secretary-General, cuts off the suburban village of El-Ezariya from Jerusalem and splits the neighbouring Abu Dis in two.\nAs at 25 January 2004, according to the Written Statement of the Secretary-General, some 190 kilometres of construction had been completed, covering Phase A and the greater part of Phase B. Further construction in Phase C had begun in certain areas of the central West Bank and in Jerusalem. Phase D, planned for the southern part of the West Bank, had not yet begun.\n\nThe Israeli Government has explained that the routes and timetable as described above are subject to modification. In February 2004, for example, an 8-kilometre section near the town of Baqa al-Sharqiya was demolished, and the planned length of the wall appears to have been slightly reduced.\n\n82. According to the description in the report and the Written Statement of the Secretary-General, the works planned or completed have resulted or will result in a complex consisting essentially of:\n(l) a fence with electronic sensors;\n(2) a ditch (up to 4 metres deep);\n(3) a two-lane asphalt patrol road;\n(4) a trace road (a strip of sand smoothed to detect footprints) running parallel to the fence;\n(5) a stack of six coils of barbed wire marking the perimeter of the complex.\n\nThe complex has a width of 50 to 70 metres, increasing to as much as 100 metres in some places. \"Depth barriers\" may be added to these works.\n\nThe approximately 180 kilometres of the complex completed or under construction as of the time when the Secretary-General submitted his report included some 8.5 kilometres of concrete wall. These are generally found where Palestinian population centres are close to or abut Israel (such as near Qalqiliya and Tulkarm or in parts of Jerusalem).\n\n83. According to the report of the Secretary-General, in its northernmost part, the wall as completed or under construction barely deviates from the Green Line. It nevertheless lies within occupied territories for most of its course. The works deviate more than 7.5 kilometres from the Green Line in certain places to encompass settlements, while encircling Palestinian population areas. A stretch of 1 to 2 kilometres west of Tulkarm appears to run on the Israeli side of the Green Line. Elsewhere, on the other hand, the planned route would deviate eastward by up to 22 kilometres. In the case of Jerusalem, the existing works and the planned route lie well beyond the Green Line and even in some cases beyond the eastern municipal boundary of Jerusalem as fixed by Israel.\n\n84. On the basis of that route, approximately 975 square kilometres (or 16.6 per cent of the West Bank) would, according to the report of the Secretary-General, lie between the Green Line and the wall. This area is stated to be home to 237,000 Palestinians. If the full wall were completed as planned, another 160,000 Palestinians would live in almost completely encircled communities, described as enclaves in the report. As a result of the planned route, nearly 320,000 Israeli settlers (of whom 178,000 in East Jerusalem) would be living in the area between the Green Line and the wall.\n\n85. Lastly, it should be noted that the construction of the wall has been accompanied by the creation of a new administrative régime. Thus in October 2003 the Israeli Defence Forces issued Orders establishing the part of the West Bank lying between the Green Line and the wall as a Closed Area. Residents of this area may no longer remain in it, nor may non-residents enter it, unless holding a permit or identity card issued by the Israeli authorities. According to the report of the Secretary-General, most residents have received permits for a limited period. Israeli citizens, Israeli permanent residents and those eligible to immigrate to Israel in accordance with the Law of Return may remain in, or move freely to, from and within the Closed Area without a permit. Access to and exit from the Closed Area can only be made through access gates, which are opened infrequently and for short periods.
    \n\n86. The Court will now determine the rules and principles of international law which are relevant in assessing the legality of the measures taken by Israel. Such rules and principles can be found in the United Nations Charter and certain other treaties, in customary international law and in the relevant resolutions adopted pursuant to the Charter by the General Assembly and the Security Council. However, doubts have been expressed by Israel as to the applicability in the Occupied Palestinian Territory of certain rules of international humanitarian law and human rights instruments. The Court will now consider these various questions.\n\n87. The Court first recalls that, pursuant to Article 2, paragraph 4, of the United Nations Charter: All Members shall refrain in their international relations from the threat or use of force against the territorial integrity or political independence of any State, or in any other manner inconsistent with the Purposes of the United Nations.On 24 October 1970, the General Assembly adopted resolution 2625 (XXV),  entitled Declaration on Principles of International Law concerning Friendly Relations and Co-operation among States (hereinafter resolution 2625 (XXV)), in which it emphasized that  No territorial acquisition resulting from the threat or use of force shall be recognized as legal. As the Court  stated in its Judgment in the case concerning Military and Paramilitary Activities in and against Nicaragua (Nicaragua v. United States of America), the principles as to the use of force incorporated in the Charter reflect customary international law (see I.C.J. Reports 1986, pp. 98-101, paras. 187-190); the same is true of its corollary entailing the illegality of territorial acquisition resulting from the threat or use of force.
    \n\n88. The Court also notes that the principle of self-determination of peoples has been enshrined in the United Nations Charter and reaffirmed by the General Assembly in resolution 2625 (XXV) cited above, pursuantto which Every State has the duty to refrain from any forcible action which deprives peoples referred to [in that resolution] ... of their right to self-determination. Article I common to the International Covenant on Economic, Social and Cultural Rights and the International Covenant on Civil and Political Rights reaffirms the right of all peoples to self-determination, and lays upon the States parties the obligation to promote the realization of that right and to respect it, in conformity with the provisions of the United Nations Charter.\n\nThe Court would recall that in 1971 it emphasized that current developments in international law in regard to non-self-governing territories, as enshrined in the Charter of the United Nations, made the principle of self-determination applicable to all [such territories]. The Court went on to state that These developments leave little doubt that the ultimate objective of the sacred trust referred to in Article 22, paragraph 1 , of the Covenant of the League of Nations was the self-determination ... of the  peoples concerned (Legal Consequences for Stales of the Continued Presence of South Africa in Namibia (South West Africa) notwithstanding Security Council Resolution 276 (1970), Advisory Opinion, I.C.J. Reports 1971, p. 31, paras. 52-53). The Court has referred to this principle on a number of occasions in its jurisprudence (ibid. ; see also Western Sahara, Advisory Opinion, I.C.J. Reports 1975, p. 68, para. 162). The Court indeed made it clear that the right of peoples to self-determination is today a right erga omnes (see East Timor (Portugal v. Australia), Judgment, I.C.J. Reports 1995, p. 102, para. 29).  
    \n\n89. As regards international humanitarian law, the Court would first note that Israel is not a party to the Fourth Hague Convention of 1907, to which the Hague Regulations are annexed. The Court observes that, in the words of the Convention, those Regulations were prepared to revise the general laws and customs of war existing at that time. Since then, however, the International Military Tribunal of Nuremberg has found that the rules laid down in the Convention were recognised by all civilised nations, and were regarded as being declaratory of the laws and customs of war (Judgment of the International Military Tribunal of Nuremberg, 30 September and 1 October 1946, p. 65). The Court itself reached the same conclusion when examining the rights and duties of belligerents in their conduct of military operations (Legality of the Threat or Use of Nuclear Weapons, Advisory Opinion, I.C.J. Reports 1996 (I) , p . 256, para. 75). The Court considers that the provisions of the Hague Regulations have become part or customary law, as is in fact recognized by all the participants in the proceedings before the Court.\n\nThe Court also observes that, pursuant to Article 154 of the Fourth Geneva Convention, that Convention is supplementary to Sections II and III of the Hague Regulations. Section III of those Regulations, which concerns Military authority over the territory or the hostile State, is particularly pertinent in the present case.
    \n\n90. Secondly, with regard to the Fourth Geneva Convention, differing views have been expressed by the participants in these proceedings. Israel, contrary to the great majority of the other participants, disputes the applicability de jure of the Convention to the Occupied Palestinian Territory. In particular, in paragraph 3 of Annex 1 to the report of the Secretary-General, entitled Summary Legal Position of the Government of Israel, it is stated that Israel does not agree that the Fourth Geneva Convention is applicable to the occupied Palestinian Territory, citing the lack of recognition of the territory as sovereign prior to its annexation by Jordan and Egypt and inferring that it is not a territory of a High Contracting Party as required by the Convention
    \n\n91. The Court would recall that the Fourth Geneva Convention was ratified by Israel on 6 July 1951 and that Israel is a party to that Convention. Jordan has also been a party thereto since 29 May 1951. Neither of the two States has made any reservation that would be pertinent to the present proceedings.  Furthermore, Palestine gave a unilateral undertaking, by declaration of 7 June 1982, to apply the Fourth Geneva Convention. Switzerland, as depositary State, considered that unilateral undertaking valid. It concluded, however, that it ¨[was] not - as a depositary - in a position to decide whether¨ ¨the request [dated 14 June 1989] from the Palestine Liberation Movement in the name of the 'State of Palestine' to accede inter alia to the Fourth Cieneva Convention can be considered as an instrument of accession
    \n\n92. Moreover, for the purpose of determining the scope of application of the Fourth Geneva Convention, it should be recalled that under common Article 2 of the four Conventions of 12 August 1949:  \n\nIn addition to the provisions which shall be implemented in peacetime, the present Convention shall apply to all cases of declared war or of any other armed conflict which may arise between two or more of the High Contracting Parties, even if the state of war is not recognized by one of them.  \n\nThe Convention shall also apply to all cases of partial or total occupation of the territory of a High Contracting Party, even if the said occupation meets with no armed resistance.  Although one of the Powers in conflict may not be a party to the present Convention, the Powers who are parties thereto shall remain bound by it in their mutual relations. They shall furthermore be bound by the Convention in relation to the said Power, if the latter accepts and applies the provisions thereof.  
    \n\n93. After the occupation of the West Bank in 1967, the Israeli authorities issued an order No. 3 stating in its Article 35 that: \n\nThe Military Court ... must apply the provisions of the Geneva  Convention dated 12 August 1949 relative to the Protection of  Civilian Persons in Time of War with respect to judicial procedures. In case of conflict between this Order and the said Convention, the Convention shall prevail.¨\n\nSubsequently, the Israeli authorities have indicated on a number of occasions that in fact they generally apply the humanitarian provisions of the Fourth Geneva Convention within the occupied territories. However, according to Israel's position as briefly recalled in paragraph 90 above, that Convention is not applicable de jure within those territories because, under Article 2, paragraph 2, it applies only in the case of occupation of territories falling under the sovereignty of a High Contracting Party involved in an armed conflict. Israel explains that Jordan was admittedly a party to the Fourth Geneva Convention in 1967, and that an armed conflict broke out at that time between Israel and Jordan, but it goes on to observe that the territories occupied by Israel subsequent to that conflict had not previously fallen under Jordanian sovereignty. It infers from this that that Convention is not applicable de jure in those territories. According however to the great majority of other participants in the proceedings, the Fourth Geneva Convention is applicable  to those territories pursuant to Article 2, paragraph 1 , whether or not Jordan had any rights in respect thereof prior to 1967.
    \n\n94. The Court would recall that, according to customary international law as expressed in Article 31 of the Vienna Convention on the Law of Treaties of 23 May 1969, a treaty must be interpreted in good faith in accordance with the ordinary meaning to be given to its terms in their context and in the light of its object and purpose. Article 32 provides that: \n\nRecourse may be had to supplementary means of interpretation, including the preparatory work of the treaty and the circumstances of its conclusion, in order to confirm the meaning resulting from the application of article 31, or to determine the meaning when the interpretation according to article 31 ... leaves the meaning ambiguous or obscure: or ... leads to a result which is manifestly obscure or unreasonable. (See Oil Platforms (Islamic Republic of Iran v. United States of America), Preliminary Objection,  Judgment, I.C.J. Reports 1996 (II), p. 812, para. 23; see, similarly, Kasikili/Sedudu Island (Botswana/Namibia), Judgment, I.C.J. Reports 1999 (II), p. 1059, para. 18, and Sovereignty over Pulau Ligitan and Pulau Sipadan (Indonesia/Malaysia), Judgment , I.C.J. Reports 2002, p. 645, para. 37.)
    \n\n95. The Court notes that, according to the first paragraph of Article 2 of the Fourth Geneva Convention, that Convention is applicable when two conditions are fulfilled: that there exists an armed conflict (whether or not a state of war has been recognized); and that the conflict has arisen between two contracting parties. If those two conditions are satisfied, the Convention applies, in particular, in any territory occupied in the course of the conflict by one of the contracting parties.  The object of the second paragraph of Article 2 is not to restrict the scope of application of the Convention, as defined by the first paragraph, by excluding therefrom territories not falling under the sovereignty of one of the contracting parties. It is directed simply to making it clear that, even if occupation during the conflict met no armed resistance, the Convention is still applicable.\n\nThis interpretation reflects the intention of the drafters of the Fourth Geneva Convention to protect civilians who find themselves, in whatever way, in the hands of the occupying Power. Whilst the drafters of the Hague Regulations of 1907 were as much concerned with protecting the rights of a State whose territory is occupied, as with protecting the inhabitants of that territory, the drafters of the Fourth Geneva Convention sought to guarantee the protection of civilians in time of war, regardless of the  status of the occupied territories, as is shown by Article 47 of the Convention.  That interpretation is confirmed by the Convention's travaux préparatoires.  The Conference of Government Experts convened by the International  Committee the Red Cross (hereinafter, ICRC) in the aftermath of the Second  World War for the purpose of preparing the new Geneva Conventions  recommended that these conventions be applicable to any armed conflict  whether [it] is or is not recognized as a state of war by the parties and in cases of occupation of territories in the absence of any state of war (Report on the Work of the Conference of Government Experts for the Study of the Conventions for the Protection of War Victims, Geneva, 14-26 April 1947, p. 8). The drafters of the second paragraph of Article 2 thus had no intention, when they inserted that paragraph into the Convention, of restricting the latter's scope of application. They were merely seeking to provide for cases of occupation without combat, such as the occupation of Bohemia and Moravia by Germany in 1939. 
    \n\n96. The Court would moreover note that the States parties to the Fourth Geneva Convention approved that interpretation at their Conference on 15 July 1999. They issued a statement in which they reaffirmed the applicability of the Fourth Geneva Convention to the Occupied Palestinian Territory, including East Jerusalem. Subsequently, on 5 December the High Contracting Parties, referring in particular to Article 1 of the Fourth Geneva Convention of 1949, once again reaffirmed the applicability of the Fourth Geneva Convention to the Occupied Palestinian Territory, including East Jerusalem. They further reminded the Contracting Parties participating in the Conference, the parties to the conflict, and the State of Israel as occupying Power, of their respective obligations.  
    \n\n97. Moreover, the Court would observe that the ICRC, whose special position with respect to execution of the Fourth Geneva Convention must be recognized and respected at all times by the parties pursuant  to Article 142 of the Convention, has also expressed its opinion on the interpretation to be given to the Convention. In a declaration of 5 December 2001, it recalled that the ICRC has always affirmed the de jure applicability of the Fourth Geneva Convention to the territories occupied since 1967 by the State of Israel, including East Jerusalem.  
    \n\n98. The Court notes that the General Assembly has, in many of its resolutions, taken a position to the same effect. Thus on 10 December 2001 and 9 December 2003, in resolutions 56/60 and 58/97, it reaffirmed\n\nthat the Geneva Convention relative to the Protection of Civilian Persons in Time of War, of 12 August 1949, is applicable to the Occupied Palestinian Territory, including East Jerusalem, and other Arab territories occupied by Israel since 1967.
    \n\n99. The Security Council, for its part, had already on 14 June 1967 taken the view in resolution 237 (1967) that all the obligations of the Geneva Convention relative to the Treatment of Prisoners of War  should be complied with by the parties involved in the conflict. Subsequently, on 15 September 1969, the Security Council, in resolution 271 (1969), called upon Israel scrupulously to observe the provisions of the Geneva Conventions and international law governing military occupation.\n\nTen years later, the Security Council examined the policy and practices of Israel in establishing settlements in the Palestinian and other Arab territories  occupied since 1967. In resolution 446 (1979) of 22 March 1979, the Security Council considered that those settlements had no legal validity and affirmed once more that the Geneva Convention relative to the Protection of Civilian Persons in Time of War, of 12 August 1949, is applicable to the Arab territories occupied by Israel since 1967, including  Jerusalem. It called once more upon Israel, as the occupying Power, to abide scrupulously by that Convention.\n\nOn 20 December 1990, the Security Council, in resolution 681 (1990), urged the Government of Israel to accept the de jure applicability of the  Fourth Geneva Convention... to all the territories occupied by Israel since 1967 and to abide scrupulously by the provisions of the Convention. It further  called upon the high contracting parties to the said Fourth Geneva  Convention to ensure respect by Israel, the occupying Power, for its  obligations under the Convention in accordance with article 1 thereof.\n\nLastly, in resolutions 799 (1992) of 18 December 1992 and 904 (1994) of 18 March 1994, the Security Council reaffirmed its position concerning the  applicability of the Fourth Geneva Convention in the occupied territories.
    \n\n100. The Court would note finally that the Supreme Court of Israel, in a judgment dated 30 May 2004, also found that:\n\nThe military operations of the [Israeli Defence Forces] in Rafah, to the extent they affect civilians, are governed by Hague Convention IV Respecting the Laws and Customs of War on Land 1907 ...  and the Geneva Convention relative to the Protection of Civilian Persons in Time of War 1949.
    \n\n101. In view of the foregoing, the Court considers that the Fourth Geneva Convention is applicable in any occupied territory in the event of an armed conflict arising between two or more High Contracting Parties. Israel and Jordan were parties to that Convention when the 1967 armed conflict broke out. The Court accordingly finds that that Convention is applicable in the Palestinian territories which before the conflict lay to the east of the Green Line and which, during that conflict, were occupied by Israel, there being no need for any enquiry into the precise prior status of those territories.  
    \n\n102. The participants in the proceedings before the Court also disagree whether the international human rights conventions to which Israel is party apply within the Occupied Palestinian Territory. Annex I to the report of the Secretary -General states :  4. Israel denies that the International Covenant on Civil and Political Rights and the International Covenant on Economic, Social and Cultural Rights, both of which it has signed, are applicable to the occupied Palestinian territory. It asserts that humanitarian law is the protection granted in a conflict situation such as the one in the West Bank and Gaza Strip, whereas human rights treaties were intended for the protection of citizens from their own Government in times of peace.  Of the other participants in the proceedings, those who addressed this issue contend that, on the contrary, both Covenants are applicable within the Occupied Palestinian Territory.  
    \n\n103. On 3 October 1991 Israel ratified both the International Covenant on Economic, Social and Cultural Rights of 19 December 1966 and the International Covenant on Civil and Political Rights of the same date, as well as the United Nations Convention on the Rights of the Child of 2() November 1989. It is a party to these three instruments.  
    \n\n104. In order to determine whether these texts are applicable in the Occupied Palestinian Territory, the Court will first address the issue of the relationship between international humanitarian law and human rights law and then that of the applicability of human rights instruments outside national territory.
    \n\n105. In its Advisory Opinion of 8 July 1996 on the Legality of the threat or Use of Nuclear Weapons, the Court had occasion to address the first or these issues in relation to the International Covenant on Civil  and Political Rights. In those proceedings certain States had argued that the Covenant was directed to the protection of human rights in peacetime, but that questions relating to unlawful loss of life in hostilities were governed by the law applicable in armed conflict (I. C.I Reports 1996 p. 239, 24).  The Court rejected this argument, stating that:  the protection of the International Covenant of Civil and Political Rights does not cease in times of war, except by operation of Article 4 of the Covenant whereby certain provisions may be derogated from in a time of national emergency. Respect for the r ight to life is not, however, such a provision. In principle, the right not arbitrarily to be deprived of one's life applies also in hostilities. The test of what is an arbitrary deprivation of life, however, then falls to be determined by the applicable lex specialis, namely, the law applicable in armed conflict which is designed to regulate the conduct of hostilities. (Ibid., p. 240, para. 25.)  
    \n\n106. More generally, the Court considers that the protection offered by human rights conventions does not cease in case of armed conflict, save through the effect of provisions for derogation of the kind to be found in Article 4 of the International Covenant on  Civil and Political Rights. As regards the relationship between international humanitarian law and human rights law, there are thus three possible situations: some rights may be exclusively matters of international humanitarian law; others may be exclusively matters of human rights law; yet others may be matters of both these branches of international law. In order to answer the question put to it, the Court will have to take into consideration both these branches of international law, namely human rights law and, as lex specialis, international humanitarian law.  
    \n\n107. It remains to be determined whether the two international Covenants and the Convention on the Rights of the Child are applicable only on the territories 01 the States parties thereto or whether they are also applicable outside those territories and, if so , in what circumstances. The scope of application of the International Covenant on Civil and Political Rights is defined by Article 2, paragraph l , thereof, which provides :  
    \n\nEach State I Party to the present Covenant undertakes to respect and to ensure to all individuals within its territory and subject to its jurisdiction the rights recognized in the present Covenant, without distinction of any kind, such as race, colour, sex , language, religion, political or other opinion, national or social origin, property, birth or other status.\n\nThis provision can be interpreted as covering only individuals who are both present within a State's territory and subject to that State's jurisdiction. It can also be construed as covering both individuals present within 'a State's territory and those out side that territory but subject to that State's jurisdiction. The Court will thus seek to determine the meaning to be given to this text.  
    \n\n109. The Court would observe that, while the jurisdiction of States is primarily territorial, it may sometimes be exercised outside the national  territory. Considering the object and purpose of the International Covenant on Civil and Political Rights, it would seem natural that, even when such is the case, States parties to the Covenant should be bound to comply with its provisions.\n\nThe constant practice of the Human Rights Committee is consistent with this. Thus, the Committee has found the Covenant applicable where the State exercises its jurisdiction on foreign territory. It has ruled on the legality of acts by Uruguay in cases of arrests carried out by Uruguayan agents in Brazil or Argentina (case No. 52/79, Lopez Burgos v. Uruguay ; case No. 56/79, Lilian Celiberti de Casariego v. Uruguay). It decided to the same effect in the case of the confiscation of a passport by a Uruguayan consulate in Germany (case No. 106/81, Montero v. Uruguay).  \n\nThe travaux préparatories of the Covenant confirm the Committee's interpretation of Article 2 of that instrument. These show that, in adopting the  wording chosen, the drafters of the Covenant did not intend to allow States to escape from their obligations when they exercise jurisdiction outside their national territory. They only intended to prevent persons residing abroad from asserting, vis -å-vis their State of origin, rights that do not fall within the competence of that State, but of that of the State o f residence (see the discussion of the preliminary draft in the Commission on Human Rights, E/CN .4/SR.194, para. 46 ; and United Nations, Official Records of the General Assembly, Tenth Session, Annexes, A/2929, Part Il, Chap. V , para. 4 (1955)).  
    \n\n110. The Court takes note in this connection of the position taken by Israel, in relation to the applicability of the Covenant, in its communications to the Human Rights Committee, and of the view of the Committee.   In 1998, Israel stated that, when preparing its report to the Committee, it had had to face the question whether individuals resident in the occupied territories were indeed subject to Israel's jurisdiction for purposes of the application of the Covenant  (CCPR/C/SR.1675, para. 21). Israel took the position that the Covenant and similar instruments did not apply directly to the current situation in the occupied territories (ibid. para. 27).  The Committee, in its concluding observations after examination of the report, expressed concern at Israel's attitude and pointed to the long -standing presence of Israel in a [the occupied] territories, Israel's   ambiguous attitude towards their future status, as well as the exercise of  effective jurisdiction by Israeli security forces therein (CCPR/C/79/ Add.93,  para. 10). In 2003 in face of Israel's consistent position, to the effect that the Covenant does not apply beyond its own territory, notably in the West Bank and Gaza the Committee reached the following conclusion :   in the current circumstances, the provisions of the Covenant apply to the benefit of the population of the Occupied Territories, for all conduct by the State party's authorities or agents in those territories that affect the enjoyment of rights enshrined in the Covenant and fall within the ambit of State responsibility of Israel under the principles of public international law (CCPR/CO/78/ISR, para. II).
    \n\n111. In conclusion, the Court considers that the International Covenant on Civil and Political Rights is applicable in respect of acts done by a State in the exercise of its jurisdiction outside its own territory.  
    \n\n112. The International Covenant on Economic, Social and Cultural Rights contains no provision on its scope of application. This may be explicable by the fact that this Covenant guarantees rights which are essentially territorial. However, it is not to be excluded that it applies both to territories over which a State party has sovereignty and to those over which that State exercises territorial jurisdiction. Thus Article 14 makes provision for transitional measures in the case of any State which at the time of becoming a Party, has not been able to secure in its metropolitan territory or other territories under its jurisdiction compulsory primary education, free of charge.  \n\nIt is not without relevance to recall in this regard the position taken by Israel in its reports to the Committee on Economic, Social and Cultural Rights. In its initial report to the Committee of 4 December 1998, Israel provided statistics indicating the  enjoyment of the rights enshrined in the Covenant by Israeli settlers in the occupied Territories. The Committee noted that, according to Israel, the Palestinian population within the same jurisdictional areas were excluded from both the report and the protection of the Covenant (E/C.12/l/Add.27, para. 8). The Committee expressed its concern in this regard, to which Israel replied in a further report of 19 October 2001 that it has consistently maintained that the Covenant does not apply to areas that a re not subject to its sovereign territory and jurisdiction (a formula inspired by the language of the International Covenant on Civil and Political Rights). This position, continued Israel, is based on the well -established distinction between human rights and humanitarian law under international law. It added: the Committee's mandate  cannot relate to events in the West Bank and the Gaza Strip, inasmuch as they are part and parcel of the context of armed conflict as distinct from a relationship of human rights (E/ 1990/6/ Add. 32, para. 5). In view of these observations, the Committee  reiterated  its concern about Israel's position and reaffirmed its view that the State party's obligations under the Covenant apply to all territories and populations under its effective control (E/C. 12/1/Add.90, paras. 15 and 31).  For the reasons explained in paragraph 106 above, the Court cannot accept Israel's view. It would also observe that the territories occupied by Israel have for over 37 years been subject to its territorial jurisdiction as the occupying Power. In the exercise of the powers available to it on this basis, Israel is bound by the provisions of the International Covenant on Economic, Social and Cultural Rights. Furthermore, it is under an obligation not to raise any obstacle to the exercise of such rights in those fields where competence has been transferred to Palestinian authorities.  
    \n\n113. As regards the Convention on the Rights or the Child of 20 November 1989, that instrument contains an Article 2 according to which States Parties shall respect and ensure the rights set forth in the ... Convention to each child within their jurisdiction. That Convention is therefore applicable within the Occupied Palestinian Territory.  
    \n\n114. Having determined the rules and principles of international law relevant to reply to the question posed by the General Assembly, and having ruled in particular on the applicability within the Occupied Palestinian Territory of international humanitarian law and human rights law, the Court will now seek to ascertain whether the construction of the wall has violated those rules and principles.  
    \n\n115. In this regard, Annex Il to the report of the Secretary -General, entitled Summary Legal Position of the Palestine Liberation Organization' states that The construction of the Barrier is an attempt to annex the territory contrary to international law  and that The de facto annexation of land with the territorial sovereignty and consequently with the right of the Palestinians to self -determination. This view was echoed in certain of the written statements submitted to the Court and in the views expressed at the hearings. Inter alia, it was contended that:  The wall severs the territorial sphere over which the Palestinian people are entitled to exercise their right of self -determination and constitutes a violation of the legal principle prohibiting the acquisition of territory by the use of force.'\n\nIn this connection, it was in particular emphasized that at]he route of the wall is designed to change the demographic composition of the Occupied Palestinian Territory, including East Jerusalem, by reinforcing the Israeli  settlements illegally established on the Occupied Palestinian Territory. It was further contended that the wall aimed at reducing and parcelling out the territorial sphere over which the Palestinian people are entitled to exercise their right of self -determination' .  
    \n\n116. For its part, Israel has argued that the wall's sole purpose is to enable it effectively to combat terrorist attacks launched from the West Bank. Furthermore, Israel has repeatedly stated that the Barrier is a temporary measure (see report of the Secretary -General, para. 29). It did so inter alia through its Permanent Representative to the United Nations at the Security Council meeting of 14 October 2003, emphasizing that the route does not annex territories to the State of Israel, and that Israel  is 'ready and able, at tremendous cost, to adjust or dismantle a fence if so required as part of a political settlement (S/PV .4841, p. 10). Israel's Permanent Representative restated this view before the General Assembly on 20 October and 8 December 2003. On  this latter occasion, he added :  As soon as the terror ends, the fence will no longer be necessary. The fence is not a border and has no political significance. It does not change the legal status of the territory in any way. (A/ES -IO/  
    \n\n117. The Court would recall that both the General Assembly and the Security Council have referred, with regard to Palestine, to the customary rule of the inadmissibility of the acquisition of territory by war (see paragraphs 74 and 87 above). Thus in  resolution 242 (1967) of 22 November 1967, the Security Council, after recalling this rule, affirmed that: the fulfilment of Charter principles requires the establishment of a just and lasting peace in the Middle East which should include the application of both the following principles: \n\n(i) Withdrawal of Israel armed forces from territories occupied in the recent conflict;  \n\n(ii) Termination of all claims or states of belligerency and respect for and acknowledgement of the sovereignty, territorial integrity and political independence of every State in the area and their right to live in peace within secure and recognized boundaries free from threats or acts of force'  It is on this same basis that the Council has several times condemned the measures taken by Israel to change the status of Jerusalem (see paragraph 75 above).  
    \n\n118. As regards the principle of the right of peoples to self -determination, the Court observes that the existence of a Palestinian people is no   longer in issue. Such existence has moreover been recognized by Israel in the exchange of letters of 9 September 1993 between Mr. Yasser Arafat, President of the Palestine Liberation Organization (PLO) and Mr. Yitzhak Rabin, Israeli Prime Minister. In that  correspondence, the President of the PLO recognized the right of the State of Israel to exist in peace and security and made various other commitments. In reply, the Israeli Prime Minister informed him that, in the light of those commitments, the Government of Israel has decided to recognize the PLO as the representative or the Palestinian people. The Israeli -Palestinian Interim Agreement on the West Bank and the Gaza Strip of 28 September 1995 also refers a number of times to the Palestinian people an d its legitimate rights (Preamble, paras. 4, 7, 8; Article Il, para. 2; Article Ill, paras. I and 3; Article XXII, para. 2). The Court considers that those rights include the right to self -determination, as the General Assembly has moreover recognized on a number of occasions (see, for example, resolution 58/163 of 22 December 20()3).
    \n\n119. The Court notes that the route of the wall as fixed by the Israeli Government includes within the Closed Area (see paragraph 85 above) some 80 per cent of the settlers living in the Occupied Palestinian Territory. Moreover, it is apparent from an examination of the map mentioned in paragraph 80 above that the wall's sinuous route has been traced in such a way as to include within that area the great majority of the Israeli settlements in the occupied Palestinian Territory (including East Jerusalem).  
    \n\n120. As regards these settlements, the Court notes that Article 49, paragraph 6, of the Fourth Geneva Convention provides: The Occupying Power shall not deport or transfer parts of its own civilian population into the territory it occupies. That provision prohibits not only deportations or forced transfers of population such as those carried out during the Second World War, but also any measures taken by an occupying Power in order to organize or encourage transfers of parts of its own population into the  occupied territory.  In this respect, the information provided to the Court shows that, since 1977, Israel has conducted a policy and developed practices involving the establishment of settlements in the Occupied Palestinian Territory, contrary to the terms of Article 49, para graph 6, just cited.  \n\nThe Security Council has thus taken the view that such policy and practices have no legal validity. It has also called upon Israel, as the occupying Power, to abide scrupulously by the Fourth Geneva Convention and:  
    \n\nto rescind its previous measures and to desist from taking any action which would result in changing the legal status and geographical nature and materially affecting the demographic composition of the Arab territories occupied since 1967, including Jerusalem   and, in particular, not to transfer parts of its own civilian population into the occupied Arab territories (resolution 446 (1979) of 22 March 1979)).  The Council reaffirmed its position in resolutions 452 (1979) of 20 July 1979 and 465 (1980) of I March 1980. Indeed, in the latter case it described Israel's policy and practices of settling parts of its population and new immigrants in [the occupied] territories as a flagrant violation of the Fourth Geneva Convention.  \n\nThe Court concludes that the Israeli settlements in the Occupied Palestinian Territory (including East Jerusalem) have been established in breach of international law. 
    \n\n121. Whilst the Court notes the assurance given by Israel that the construction of the wall does not amount to annexation and that the wall is of a temporary nature (see paragraph 1 16 above), it nevertheless cannot remain indifferent to certain fears expressed  to it that the route of the wall will  prejudge the future frontier between Israel and Palestine, and the fear that Israel may integrate the settlements and their means of access. The Court considers that the construction of the wall and its associated régime create a fait accompli on the ground that could well become permanent, in which case, and notwithstanding the formal characterization of the wall by Israel, it would be tantamount to de facto annexation.  
    \n\n122. The Court recalls moreover that, according to the report of the Secretary -General, the planned route would incorporate in the area between the Green Line and the wall more than 16 per cent of the territory of the West Bank. Around 80 per cent of the settlers living in the Occupied Palestinian Territory, that is 320,000 individuals, would reside in that area, as well as 237,000 Palestinians. Moreover, as a result of the construction of the wall, around 160,000 other Palestinians would reside in almost completely encircled communities (see paragraphs 84, 85 and 1 19 above).  In other terms, the route chosen for the wall gives expression in loco to the illegal measures taken by Israel with regard to Jerusalem and the settlements„ as deplored by the Security Council (see paragraphs 75 and 12() above). There is also a risk of further alterations to the demographic composition of the occupied Palestinian Territory resulting from the construction of the wall inasmuch as it is contributing, as will be further explained in  133 below, to the departure of Palestinian populations from certain areas. That construction, along with measures taken previously, thus severely impedes the exercise by the Palestinian people of its right to self -determination, and is therefore a breach of Israel's obligation to respect that right.  
    \n\n123. The construction of the wall also raises a number of issues in relation to the relevant provisions of international humanitarian law and of human rights instruments.  
    \n\n124. With regard to the Hague Regulations of 1907, the Court would recall that these deal, in Section II, with hostilities and in particular with means of injuring the enemy, sieges, and bombardments. Section III deals with military authority in occupied territories. Only Section III is currently applicable in the West Bank and Article 23 (g) of the Regulations, in Section II, is thus not pertinent. Section III of the Hague Regulations includes Articles 43, 46 and 52, which are applicable in the Occupied Palestinian Territory. Article 43 imposes a duty on the occupant to take all measures within his power to restore, and, as far as possible, to insure public order and life, respecting the laws in force in the country. Article 46 adds that private property must be respected and that it cannot be confiscated. Lastly, Article 52 authorizes, within certain limits, requisitions in kind and services fo r the needs of the army of occupation.  
    \n\n125. A distinction is also made in the Fourth Geneva Convention between provisions applying during military operations leading to occupation and those that remain applicable throughout the entire period of occupation. It thus states in Article 6:  \n\nThe present Convention shall apply from the outset of any conflict or occupation mentioned in Article 2.  In the territory of Parties to the conflict, the application of the present Convention shall cease on the general close of military operations.  In the case of occupied territory, the application of the present Convention shall cease one year after the general close of military operations; however, the Occupying Power shall be bound, for the duration of the occupation, to the extent that such Power  exercises the functions of government in such territory, by the provisions of the following Articles of the present Convention: I to 12, 27, 29 to 34, 47, 49, 51, 52, 53, 59, 61 to 77, 143.  Protected persons whose release, repatriation or re -establishment may take place after such dates shall meanwhile continue to benefit by the present Convention.'  Since the military operations leading to the occupation of the West Bank in 1967 ended a long time ago, only those Articles of the Fourth Geneva Convention referred to in Article 6, paragraph 3, remain applicable in that occupied territory.  
    \n\n126. These provisions include Articles 47, 49, 52, 53 and 59 of the  Fourth Geneva Convention. According to Article 47 :\n\nProtected persons who are in occupied territory shall not be  deprived, in any case or in any manner whatsoever, of the benefits of the present Convention by any change introduced, as the result of the occupation of a territory, into the institutions or government of the said territory, nor by any agreement concluded  between the authorities of the occupied territories and the Occupying Power, nor by any annexation by the latter of the whole or part of the occupied territory.   Article 49 reads as follows: \n\nIndividual or mass forcible transfers, as well as deportations of protected persons from occupied territory to the territory of the occupying Power or to that of any other country, occupied or not, are prohibited, regardless of their motive. \n\nNevertheless, the Occupying Power may undertake total or partial evacuation of a given area if the security of the population or imperative military reasons so demand. Such evacuations may not involve the displacement of protected persons outside the bound s of the occupied territory except when for material reasons it is impossible to avoid such displacement. Persons thus evacuated shall be transferred back to their homes as soon as hostilities in the area in question have ceased.  The Occupying Power undertaking such transfers or evacuations shall ensure, to the greatest practicable extent, that proper accommodation is provided to receive the protected persons, that the removals are effected in satisfactory conditions of hygiene, health, safety and nutrition, and that members of the same family are not separated.  The Protecting Power shall be informed of any transfers and evacuations as soon as they have taken place.  The Occupying Power shall not detain protected persons in an area particularly exposed to the dangers of war unless the security of the population or imperative military reasons so demand.  The Occupying Power shall not deport or transfer parts of its own civilian population into the territory it occupies.'  According to Article 52:  'No contract, agreement or regulation shall impair the right of any worker, whether voluntary or not and wherever he may be, to apply to the representatives of the Protecting Power in order to request the said Power's intervention.  Alt measures aiming at creating unemployment or at restricting the opportunities offered to workers in an occupied territory, in order to induce them to work for the occupying Power, arc prohibited.' \n\nArticle 53 provides that:  \n\nAny destruction by the Occupying Power of real or personal property belonging individually or collectively to private persons, or to the State, or to other public authorities, or to social or co -operative organizations, is prohibited, except where such destruction is rendered absolutely necessary by military operations.  Lastly, according to Article 59:  If the whole or part of the population of an occupied territory is inadequately supplied, the Occupying Power shall agree to relief schemes on behalf of the said population, and shall facilitate them by all the means at its disposal.  Such schemes, which may be undertaken either by States or by impartial humanitarian organizations such as the International Committee of the Red Cross, shall consist, in particular, of the provision of consignments of foodstuffs, medical supplies and clothing. All Contracting Parties shall permit the free passage of these consignments and shall guarantee their protection.  A Power granting free passage to consignments on their way to territory occupied by an adverse Party to the conflict shall, however, have the right to search the consignments, to regulate their passage according to prescribed times and routes, and to be reasonably satisfied through the Protecting Power that these consignments are to be used for the relief of the needy population and are not to be used for the benefit of the Occupying Power.'   
    \n\n127. The International Covenant on Civil and Political Rights also contains several relevant provisions. Before further examining these, the Court will observe that Article 4 of the Covenant allows for derogation to be made, under various conditions, to certain provisions of that instrument. Israel made use of' its right of derogation under this Article by addressing the following communication to the Secretary -General of the United Nations on 3 October 1991 \n\n'Since its establishment, the State of Israel has been the victim of continuous threats and attacks on its very existence as well as on the life and property of its citizens. These have taken the form of threats of war, of actual armed attacks, and campaigns of terrorism resulting in the murder of and injury to human beings.\n\nIn view of the above, the State of Emergency which was proclaimed in May 1948 has remained in force ever since. This situation constitutes a public emergency within the meaning of article 4 ( l) of the Covenant.  The Government of Israel has therefore found it necessary, in accordance with the said article 4, to take measures to the extent strictly required by the exigencies of the situation, for the defence of  the State and for the protection of life and property, including the exercise of powers of arrest and detention.  In so far as any of these measures are inconsistent with article 9 of the Covenant, Israel thereby derogates from its obligations under that provision.\n\nThe Court notes that the derogation so notified concerns only Article 9 of the International Covenant on Civil and Political Rights, which deals with the right to liberty and security of person and lays down the rules applicable in cases of arrest or detention. The other Articles of the Covenant therefore remain applicable not only on Israeli territory, but also on the Occupied Palestinian Territory.  
    \n\n128. Among these mention must be made of Article 17, paragraph I of which reads as follows: No one shall be subjected to arbitrary or unlawful interference with his privacy, family, home or correspondence, nor to unlawful attacks on his honour and reputation.  Mention must also be made of Article 12, paragraph l , which provides: Everyone lawfully within the territory of a State shall, within that territory, have the right to liberty of movement and freedom to choose his residence.  
    \n\n129. In addition to the general guarantees of freedom of movement under Article 12 of the International Covenant on Civil and Political Rights, account must also be taken of specific guarantees of access to the Christian, Jewish and Islamic Holy Places. The status of the Christian Holy Places in the Ottoman Empire dates far back in time, the latest provisions relating thereto having been incorporated into Article 62 of the Treaty of Berlin of 13 July 1878. The Mandate for Palestine given to the British Government on 24 July 1922 included an Article 13, under which : \n\nAll responsibility in connection with the Holy Places and religious buildings or sites in Palestine, including that of preserving existing rights and of securing free access to the Holy Places, religious buildings and sites and the free exercise of worship, while ensuring the requirements of public order and decorum, is assumed by the Mandatory. Article 13 further stated: nothing in this mandate shall be construed as conferring ... authority to interfere with the fabric or the management of purely Moslem sacred shrines, the immunities of which are guaranteed'  In the aftermath of the Second World War, the General Assembly, in adopting resolution 181 (II) on the future government of Palestine, devoted an entire chapter of the Plan of Partition to the Holy Places, religious buildings and sites. Article 2 of this Chapter provided, in so far as the Holy Places were concerned : \n\nthe liberty of access, visit and transit shall be guaranteed, in conformity  with existing rights, to all residents and citizens [of the Arab  State, of the Jewish State] and of the City of Jerusalem, as well as to aliens, without distinction as to nationality, subject to requirements of national security, public order and decorum.  Subsequently, in the aftermath of the armed conflict of 1948, the 1949 General  Armistice Agreement between Jordan and Israel provided in Article V Ill for the establishment of a special committee for the formulation of agreed plans and arrangements for su ch matters as either Party may submit to it for the purpose of enlarging the scope of the Agreement and of effecting improvement in its application. Such matters, on which an agreement of principle had already been concluded, included free access to the Holy Places.  \n\nThis commitment concerned mainly the Holy Places located to the east of the Green Line. However, some Holy Places were located west of that Line. This was the case of the Room of the Last Supper and the Tomb of David, on Mount Zion. In signing the General Armistice Agreement, Israel thus undertook, as did Jordan, to guarantee freedom of access to the Holy Places. The Court considers that this undertaking by Israel has remained valid for the Holy Places which came under its control in 1967. This undertaking has further been confirmed by Article 9, paragraph I  of the 1994 Peace Treaty between Israel and Jordan, by virtue of which, in more general terms, Each party will provide freedom of access to places of religious and historical significance.  
    \n\n130. As regards the International Covenant on Economic, Social and Cultural Rights, that instrument includes a number of relevant provisions, namely: the right to work (Arts. 6 and 7); protection and assistance accorded to the family and to children and young persons (Art. 10); the right to an adequate standard of living, including adequate food, clothing and housing, and the right to be free from hunger (Art. II ) ; the right to health (Art. 12); the right to education (Arts. 13 and 14).  
    \n\n131. Lastly, the United Nations Convention on the Rights of the Child of 20 November 1989 includes similar provisions in Articles 16, 24, 27 and 28.  
    \n\n132. From the information submitted to the Court, particularly the report of the Secretary -General, it appears that the construction of the wall has led to the destruction or requisition of properties under conditions which contravene the requirements of Articles 46 and 52 of the Hague Regulations of 1907 and of Article 53 of the Fourth Geneva Convention.  
    \n\n133. That construction, the establishment of a closed area between the Green Line and the wall itself and the creation of enclaves have moreover imposed substantial restrictions on the freedom of movement of the inhabitants of the Occupied Palestinian Territory  (with the exception of  Israeli citizens and those assimilated thereto). Such restrictions are most marked in urban areas, such as the Qalqiliya enclave or the City of Jerusalem and its suburbs. They are aggravated by the fact that the access gates are few in number in certain sectors and opening hours appear to be restricted and unpredictably applied. For example, according to the Special Rapporteur of the Commission on Human Rights on the situation of human rights in the Palestinian territories occupied by Israel since 1967, Qalqiliya, a city with a population of 40,000, is completely surrounded by the Wall and residents can only enter and leave through a single military checkpoint open from 7 a.m. to 7 p.m. (Report of the Special Rapporteur of the Commission on Human Rights, John Dugard, on the situation of human rights in the Palestinian territories occupied by Israel since 1967, submitted in accordance with Commission resolution 1993/2 A and entitled Question of the Violation of Human Rights in the Occupied Arab Territories, including Palestine, E/CN .4/2004/6, 8 September 2003, para. 9.)  \n\nThere have also been serious repercussions for agricultural production, as is attested by a number of sources. According to the Special Committee to Investigate Israeli Practices Affecting the Human Rights of the Palestinian People and Other Arabs of the Occupied Territories  an estimated 100,000 dunums [approximately 10,000 hectares] of the West Banks most fertile agricultural land, confiscated by the Israeli Occupation Forces, have been destroyed during the first phase of the wall construction, which involves the disappearance of vast amounts of property, notably private agricultural land and olive trees, wells, citrus grows and hothouses upon which tens of thousands of Palestinians rely for their survival (Report of the Special Committee to Investigate Israeli Practices Affecting the Human Rights of the Palestinian People and Other Arabs of the Occupied Territories, A/58/31 1, 22 August 2003, para. 26).  Further, the Special Rapporteur on the situation of human rights in the Palestinian territories occupied by Israel since 1967 states that Much of the Palestinian land on the Israeli side of the Wall consists of fertile agricultural land and some of the most important water wells in the region and adds that Many fruit and olive trees had been destroyed in the course of building the barrier (E/CN .4/2004/6, 8 September 2003, para. 9). The Special Rapporteur on the Right to Food of the United Nations Commission on Human Rights states that construction of the wall cuts off Palestinians from their agricultural lands, wells and means of subsistence (Report by the Special Rapporteur of the United Nations Commission on Human Rights, Jean Ziegler, The Right to Food, Addendum, Mission to the Occupied Palestinian Territories, E/CN .41 2004/10/Add.2, 31 October 2003, para. 49). In a recent survey conducted by the World Food Programme, it is stated that the situation has aggravated food insecurity in the region, which reportedly numbers 25,000 new beneficiaries of food aid (report of the Secretary -General, para. 25).  It has further led to increasing difficulties for the population concerned regarding access to health services, educational establishments and primary sources of water. This is also attested by a number of different information  sources. Thus the report of the Secretary -General states generally that According to the Palestinian Central Bureau of Statistics, so far the Barrier has separated 30 localities from health services, 22 from schools, 8 from primary water sources and 3 from electricity networks. (Report of the Secretary -General, para. 23.) The Special Rapporteur of the United Nations Commission on Human Rights on the situation of human rights in the Palestinian territories occupied by Israel since 1967 states that Palestinians between the Wall and Green Line will effectively be cut off from their land and workplaces, schools, health clinics and other social services. (E/CN.4/2004/6, 8 September 2003, para. 9.) In relation specifically to water resources, the Special Rapporteur on the Right to Food of the United Nations Commission on Human Rights observes that By constructing the fence Israel will also effectively annex most of the western aquifer system (which provides 51 per cent of the West Bank's water resources). (E/CN.4/2004/l O/Add.2, 31 October 2003, para. 51.) Similarly. in regard to access to health services, it has been stated that, as a result of the enclosure of Qalqiliya, a United Nations hospital in that town has recorded a 40 per cent decrease in its caseload (report of the Secretary -General, para. 24).\n\nAt Qalqiliya, according to reports furnished to the United Nations, some 600 shops or businesses have shut down, and 6,000 to 8,000 people have already left the region (E/CN .4/2004/6, 8 September 2003, para. 10; E/CN.4/2004/10/Add.2, 31 October 2003, para . 51). The Special Rapporteur on the Right to Food of the United Nations Commission on Human Rights has also observed that With the fence/wall cutting communities off from their land and water without other means of subsistence, many of the Palestinians living in these areas will be forced to leave. (E/CN.4/ 2004/10/Add.2, 31 October 2003, para. 51.) In this respect also the construction the wall would effectively deprive a significant number of Palestinians of the freedom to choose [their] residence. I n addition, however, in the view of the Court, since a significant number of Palestinians have already been compelled by the construction of the wall and its associated régime to depart from certain areas, a process that will continue as more of the wall is built, that construction, coupled with the establishment of the Israeli settlements mentioned in paragraph 120 above, is tending to alter the demographic composition of the Occupied Palestinian Territory.
    \n\n134. To sum up, the Court is of the opinion that the construction of the wall and its associated régime impede the liberty of movement of the inhabitants of the Occupied Palestinian Territory (with the exception  of Israeli citizens and those assimilated thereto) as guaranteed under Article 12, paragraph l , of the International Covenant on Civil and Political Rights. They also impede the exercise by the persons concerned of the right to work, to health, to education and to an adequate standard of living as proclaimed in the International Covenant on Economic, Social and Cultural Rights and in the United Nations Convention on the Rights of the Child. Lastly, the construction of the wall and its associated régime, by  contributing to the demographic changes referred to in paragraphs 122 and 133 above, contravene Article 49, paragraph 6, of the Fourth Geneva Convention and the Security Council resolutions cited in paragraph 120 above.
    \n\n135. The Court would observe, however, that the applicable international humanitarian law contains provisions enabling account to be taken of military exigencies in certain circumstances.  Neither Article 46 of the Hague Regulations of 1907 nor Article 47 of the Fourth Geneva Convention contain any qualifying provision of this type. With regard to forcible transfers of population and deportations, which are prohibited under Article 49, paragraph I , of the Convention, paragraph 2 of that Article provides for an exception in those cases in which the security of the population or imperative military reasons so demand. This exception however does not apply to paragraph 6 of that Article, which  prohibits the occupying Power from deporting or transferring parts of its own civilian population into the territories it occupies. As to Article 53 concerning the destruction of personal property, it provides for an exception where such destruction is rendered absolutely necessary by military operations.  The Court considers that the military exigencies contemplated by these texts may be invoked in occupied territories even after the general close of the military operations that led to their occupation. However, on the material before it, the Court is not convinced that the destructions carried out contrary to the prohibition in Article 53 of the Fourth Geneva Convention were rendered absolutely necessary by military operations.  
    \n\n136. The Court would further observe that some human rights conventions, and in particular the International Covenant on Civil and Political Rights, contain provisions which States parties may invoke in order to derogate, under various conditions, from certain of their conventional obligations. In this respect, the Court would however recall that the communication notified by Israel to the Secretary -General of the United Nations under Article 4 of the International Covenant on Civil and Political Rights concerns  only Article 9 of the Covenant, relating to the right to freedom and security of person (see paragraph 127 above); Israel is accordingly bound to respect all the other provisions of that instrument.\n\nThe Court would note, moreover, that certain provisions human rights conventions contain clauses qualifying the rights covered by those provisions. There is no clause of this kind in Article 17 of the International Covenant on Civil and Political Rights. On the other hand, Article 12, paragraph 3, of that instrument provides that restrictions on liberty of movement as guaranteed under that Article  shall not be subject to any restrictions except those which are provided by law, are necessary to protect national security, public order (ordre public), public health or morals or the rights and freedoms of others, and are consistent with the other right s recognized in the present Covenant.  As for the International Covenant on Economic, Social and Cultural Rights, Article 4 thereof contains a general provision as follows:\n\nThe States Parties to the present Covenant recognize that, in the enjoyment of those rights provided by the State in conformity with the present Covenant, the State may subject such rights only to such limitations as are determined by law only in so far a s this may be compatible with the nature of these rights and solely for the purpose of promoting the general welfare in a democratic society.  The Court would observe that the restrictions provided for under Article 12, paragraph 3, of the International Covenant on Civil and Political Rights are, by the very terms of that provision, exceptions to the right of freedom of movement contained in para graph l . In addition, it is not sufficient that such restrictions be directed to the ends authorized; they must also be necessary for the attainment of those ends. As the Human Rights Committee put it, they must conform to the principle of proportionality and must be the least intrusive instrument amongst those which might achieve the desired result (CCPR/C/21/Rev. l/Add.9, General Comment No. 27, para. 14). On the basis of the information available to it, the Court finds that these conditions are not met in the present instance.  The Court would further observe that the restrictions on the enjoyment by the Palestinians living in the territory occupied by Israel of their economic, social and cultural rights, resulting from Israel's construction of the wall, fail to meet a condition laid down by Article 4 of the International Covenant on Economic, Social and Cultural Rights, that is to say that their implementation must be solely for the purpose of promoting the general welfare in a democratic society'  
    \n\n137. To sum up, the Court, from the material available to it, is not convinced that the specific course Israel has chosen for the wall was necessary to attain its security objectives. The wall, along the route chosen, and its associated régime gravely infringe a number of rights of Palestinians residing in the territory occupied by Israel, and the infringements resulting from that route cannot be justified by military exigencies or by the requirements of national security or public order. The construction of such a wall accordingly constitutes breaches by Israel of various  of its obligations under the applicable international humanitarian law and human rights instruments.
    \n\n138. The Court has thus concluded that the construction of the wall constitutes action not in conformity with various international legal obligations incumbent upon Israel. However, Annex I to the report of the Secretary -General states that, according to Israel : the construction of the Barrier is consistent with Article 51 of the Charter of the United Nations, its inherent right to self -defence and Security Council resolutions 1368 (2001) and 1373 More specifically, Israel's Permanent Representative to the United Nations asserted in the General Assembly on 20 October 2003 that the fence is a measure wholly consistent with the right of States to self -defence enshrined in Article 51 of the Charter , the Security Council resolutions referred to, he continued, have clearly recognized the right of States to use force in self -defence against terrorist attacks, and therefore surely recognize the right to use non -forcible measures to that encl (A/ES -10/PV .21, p. 6).  
    \n\n139. Under the terms of Article 51 of the Charter of the United Nations:  Nothing in the present Charter shall impair the inherent right of individual or collective self -defence if an armed attack occurs against a Member of the United Nations, until the Security Council has taken measures necessary to maintain international pea ce and security.  Article 51 of the Charter thus recognizes the existence of an inherent right of self -defence in the case of armed attack by one State against another State. However, Israel does not claim that the attacks against it are imputable to a foreign State.\n\nThe Court also notes that Israel exercises control in the Occupied Palestinian Territory and that, as Israel itself states, the threat which it regards as justifying the construction of the wall originates within, and not outside, that territory. The situation is thus different from that contemplated by Security Council resolutions 1368 (2001) and 1373 (2001), and therefore Israel could not in any event invoke those resolutions in support of its claim to be exercising a right of self -defence.  Consequently, the Court concludes that Article 51 of the Charter has no relevance in this case.  
    \n\n140. The Court has, however, considered whether Israel could rely on a state of necessity which would preclude the wrongfulness of the construction of the wall. In this regard the Court is bound to note that some of the conventions at issue in the present instance include qualifying clauses of the rights guaranteed or provisions for derogation (see para62  graphs 135 and 136 above). Since those treaties already address considerations of this kind within their own provisions, it might be asked whether a state of necessity as recognized in customary international law could be invoked with regard to those treaties as a ground for precluding the wrongfulness of the measures or decisions being challenged. However, the Court will not need to consider that question. As the Court observed in the case concerning the Gabéikovo -Nagymaros Project ( Hungary(Slovakia) , t he state of necessity is a ground recognized by customary international law that can only be accepted on an exceptional basis , it can only be invoked under certain strictly defined conditions which must be cumulatively satisfied; and the State concern ed is not the sole judge of whether those conditions have been met (I. C. J. Reports 1997, p. 40, para. 51). One of those conditions was stated by the Court in terms used by the International Law Commission, in a text which in its present form requires that the act being challenged be the only way for the State to safeguard an essential interest against a grave and imminent peril (Article 25 of the International Law Commission's Articles on Responsibility of States for Internationally Wrongful Acts; see also former Article 33 of the Draft Articles on the International Responsibility of States, with slightly different wording in the English text). In the light of the material before it, the Court is not convinced that the construction of the wall along the route chosen was the only means to safeguard the interests of Israel against the peril which it has invoked as justification for that construction.  
    \n\n141. The fact remains that Israel has to face numerous indiscriminate and deadly acts of violence against its civilian population. It has the right, and indeed the duty, to respond in order to protect the life of its citizens. The  measures taken are bound nonetheless to remain in conformity with applicable international law.  
    \n\n142. In conclusion, the Court considers that Israel cannot rely on a right of self-defence or on a state of necessity in order to preclude the wrongfulness of the construction of the wall resulting from the considerations mentioned in paragraphs 122 and 137 abo ve. The Court accordingly finds that the  construction of the wall, and its associated régime, are contrary to international law.  
    \n\n143. The Court having concluded that, by the construction of the wall in the Occupied Palestinian Territory, including in and around East Jerusalem, and by adopting its associated régime, Israel has violated various international obligations incumbent upon it ( see paragraphs 1 14 -137 above), it must now, in order to reply to the question posed by the General Assembly, examine the consequences of those violations.  
    \n\n144. In their written and oral observations, many participants in the proceedings before the Court contended that Israel's action in illegally constructing this wall has legal consequences not only for Israel itself, but also for other States and for the United  Nations; in its Written Statement, Israel, for its part, presented no arguments regarding the possible legal consequences of the construction of the wall.  
    \n\n145. As regards the legal consequences for Israel, it was contended that Israel has, first, a legal obligation to bring the illegal situation to an end by ceasing forthwith the construction of the wall in the Occupied Palestinian  Territory, and to give appropriate assurances and guarantees of non -repetition.  It was argued that, secondly, Israel is under a legal obligation to make reparation for the damage arising from its unlawful conduct. It was submitted that such reparation should first of all take the form of restitution, namely demolition of those portion s of the wall constructed in the Occupied Palestinian Territory and annulment of the legal acts associated with its construction and the restoration of property requisitioned or expropriated for that purpose; reparation should also include appropriate compensation for individuals whose homes or agricultural holdings have been destroyed.  It was further contended that Israel is under a continuing duty to comply with all of the international obligations violated by it as a result of the construction of the wall in the Occupied Palestinian Territory and of the associated régime. It was also argued that, under the terms of the Fourth Geneva Convention, Israel is under an obligation to search for and bring before its courts persons alleged to have committed, or to have ordered to be committed, grave breaches of international humanitarian law flowing from the planning, construction and use of the wall.  
    \n\n146. As regards the legal consequences for States other than Israel, it was contended before the Court that all States are under an obligation not to recognize the illegal situation arising from the construction of the wall, not to render aid or assistance in maintaining that situation and to co -operate with a view to putting an end to the alleged violations and to ensuring that reparation will be made therefor. \n\nCertain participants in the proceedings further contended that the States parties to the Fourth Geneva Convention are obliged to take measures to ensure compliance with the Convention and that, inasmuch as the construction and maintenance of the wall in the Occupied Palestinian Territory constitutes grave breaches of that Convention, the States parties to that Convention are under an obligation to prosecute or extradite the authors of such breaches. It was further observed that  the United Nations Security Council should consider flagrant and systematic violation of international law normas] and principles by Israel, particularly  international humanitarian law, and take all necessary measures to put an end ato] these violations,  and that the Security Council and the General Assembly must take due account of the advisory opinion to be given by the Court.  
    \n\n147. Since the Court has concluded that the construction of the wall in the Occupied Palestinian Territory, including in and around East Jerusalem, and its associated régime, are contrary to various of Israel's international obligations, it follows that the responsibility of that State is engaged under international law.  
    \n\n148. The Court will now examine the legal consequences resulting from the violations of international law by Israel by distinguishing between, on the one hand, those arising for Israel and, on the other, those arising for other States and, where appropriate, fo r the United Nations. The Court will begin by examining the legal consequences of those violations for Israel.  
    \n\n149. The Court notes that Israel is first obliged to comply with the international obligations it has breached by the construction of the wall in the Occupied Palestinian Territory (see paragraphs 1 14 -137 above). Consequently, Israel is bound to comply with it s obligation to respect the right of the Palestinian people to self -determination and its obligations under international humanitarian law and international human rights law. Furthermore, it must ensure freedom of access to the Holy Places that came under its control following the 1967 War (see paragraph 129 above)."    
  }
]

